{"Encounter ID":{"0":"058194cd-d4dc-490b-8ecf-9b68465e39a3","1":"0a38cf2d-5c35-4f20-bb27-e29a87b6a526","2":"12179291-2c2b-4f33-adae-4aecc037b9ce","3":"1228c055-6838-473e-a581-3b8500af9817","4":"2a4f5cf7-7142-4d03-a4dd-b1e2cf544599","5":"41aa275e-3a4d-47e2-8239-6487be7bc059","6":"43f704df-f272-406c-9137-98533a075ff8","7":"5899f16f-17eb-45a3-a57b-ac276162de13","8":"5b0e2f0d-8db8-4245-af07-7afe5564f4f1","9":"7d32cae1-fab9-47d3-91a6-8e303acbdd0b","10":"900696c1-6436-4241-8445-abeff09af04b","11":"9164b014-e147-472d-8245-65ef72c67f00","12":"b0ccc115-b9c3-4b57-a010-60976fd53789","13":"c29c8073-b3ff-418a-9be1-92d323540e4c","14":"d7d6dab6-d22b-434e-9c30-da35a64882bc"},"Transcript":{"0":"My last visit with Mark occurred March 1st, at which time no medication changes were made. During the interim, Mark presented to the emergency department on May 26th with concern for high blood pressure in context of missing a dose of his medication and being under a lot of stress. However, when he followed up with his primary care doctor on May 30th, his blood pressure was Well controlled at 118 over 86. Hello there, Mark, come on in. Hi Dr. Collins, how are you doing? Good, how are you? Well, I'm doing okay. Yeah, good. I'll sit over here. Yeah, wherever you like. Well, I want to better view you. Yeah, I was just looking over some things with your ER visit with the blood pressure, but then you followed up with primary care and it was fine. Yeah. And this is interesting. So the doctor's note in her instructions to you she recommends something that I also recommend, and that is, she was saying, these pressure, these cuffs that go, like. Yeah, I got a. They're not as good, yeah. Yeah, it's kind of like that, but not quite as big, but same thing, yeah, and I said, and my blood pressure's been well. Yeah. So my wife said, and I, if you look at my screening thing out there. Oh, sure, yeah. Irritability lately, she says I've been very irritable, I don't know if And has anything to do with the medicine, I don't know if we bump up the medicine, if that would help. Maybe, you know, we could discuss that today. How have you been feeling, though? Overall pretty well, but she's right. At certain times, I can get irritable. She says I need to get my rest, otherwise I'm irritable. Okay, I mean, that's probably true for all of us, right? Yeah. She said I was especially irritable with my youngest son, usually, and not irritable with him. Okay, was that at Thanksgiving or when did she notice that? The last couple weeks, I guess there's been a couple times. Okay, so basically. I got a nap and [inaudible]. Yeah, so we absolutely can go up on your mirtazapine. To be honest with you, you're on a very low dose, which is fine. I like low doses, but 15 milligrams is the more standard dose to be on. What am I on now? 7 and a half. So we want to double it. Correct. So 2 of those are worth, they have a. They do, luckily, yeah, they have a new 15 pill. Okay, yeah, so just notice being a little bit more short-fused maybe, is that what it is? Irritability, she said, you know, snapping, you know, not real patient. Is it just in the. Context of family or have you been like this in road rage or interactions with strangers? I don't notice it in, you know, because I play pickleball. Exactly. I actually have a new instructor and he's, you know, I feel really good about that. And work, no, I, but I don't, I'm not around a lot of people, but I think I basically along with people pretty well, I don't think I snap at them. Yeah. But Yeah. Might be part of it. wondering if there's any other reason to increase it though. What, to increase it, you mean? Yeah. Oh, I don't know. It's like a little bit of irritability, is this happening on multiple occasions or is it just something she can't [inaudible]. She's saying the last 6 months or so that, she liked it when I was on wasn't seeing you then, and I don't know what it was, but I think that was an antidepressant, I don't know if I handle antidepressants very well. Well, you're actually on an antidepressant now, it's just not such a traditional one. Ah. But I will say this, back when we first, actually hold on here, oh, I know what it was, do you think she felt you were doing better when you were taking lamotrigine? the mood stabilizer? Or Dulux? No, it was when I was seeing that Emma, and I don't even know what happened to her, she just dropped off. Her name was Emma? Emma, what was her last name? Clarke? What? Emma Clarke? Yeah. Yeah, she just like, I couldn't find her anymore in any of the systems, you know, I Google her name and it's like. Oh yeah, yeah, I see what I wrote here. Yeah, you had a good relationship with her, went to see Emma Clarke in context of increasing irritability that was noticed by his wife with worsening of anxiety and some panic during COVID. Yeah. So she, so you felt that things were going better when you were seeing her? Well, my wife does, I think so. I I don't think I tolerated the medicine very well. This one, but of course, I'm not at a double dose, you know. This one, I don't have to see the symptoms at all. And that's why, you know, the kind of, well, the one, you know, I was feeling very herpy, and I would throw up in the morning. And maybe I could have got by that if I would have stayed with it. I don't know. Sometimes it takes a while to get used to it. Yeah, I mean, to be completely fair, to be honest, I haven't diagnosed you with depression, and neither did my colleague who you met with once briefly in Boise. Mm-hmm. When you were following with Emma Clarke, did she tell you that you were depressed, or did she just say anxiety? She thought it was more anxiety, I don't know if I had to be, you know. Everyone has felt it's more anxiety related. But if I'm feeling anxious, would that maybe lead to irritability because I'm anxious? Correct. Oh, yeah. Oh, yeah. And the great news is a lot of the medicines are basically the same anyway. just working in your pocket and you're not worried. Honestly, I mean, I think my opinion, or same opinion as you, I think it makes much more sense to just go out on a dose of what you're taking now than to try a brand new medicine. And I never did follow up, and we had discussed that before, as maybe, you know, a counselor, you know, a psychologist, and maybe see someone to help me check in and maybe check my attitude or, you know, help me maybe process things. So I'm open to that. I'm curious, I don't know how much you can share about your people that are, is Emma Johnson, is she still here? No, she went to. Oh, okay. My wife knows that she, my wife's related to her, that's why I was curious. Oh, okay, no, yeah, she was. Is she a licensed psychologist or, you know? I don't know. Wait, oh, sorry. I apologize. Are you talking about Rachel? Rachel Carlson, right? Yeah, sorry. No, she is here. I was thinking of someone else. Yeah, yeah. Okay, yeah, yeah. She's, I guess she would be a first cousin of my wife, yeah. Okay, fair enough. Her mother's brother is her dad, when they're all gone, but so. Well, what you could do, I mean, what we could do is If I placed a referral for you, or you could just say, you know, you feel like it would be a conflict of interest to see her. Possibly, I, you know, I'm not bringing up her family, you know, I am, it only happened one time, sexual abuse, you know, one time, and it was actually my wife's stepdad, so it wasn't a blood relative. But there's issues I'm not going to go into. Yeah, oh no, I was, I mean. It's how her family handled sexual abuse, you know, and a lot of families do that, you know, they, you stuff it down, you know. Your wife's family, you mean? Well, all families, you know, especially when it's, you know, in her family and stuff. But anyway, I think my parents handled it right, they took me to the not a priest, but to a pastor and to a doctor at the time. Yeah. The whole thing, this is like early 50s, you know, mid 50s. They just said, just try to give them, you know, constant things. But I guess I freaked out really bad. I don't remember this. I remember it happening, I remember coming in the house, but my parents said, my mom came in and I was in the bathtub scrubbing. Mm-hmm. To almost bleeding, so I guess I felt, you know, defiled or something. Yeah, yeah. And, you know, I mean, I, you cope and you, you know, anytime you go over, you know, abuse, you know, family structures that maybe not are supportive or loving like that, you know, you have that, I think I have that in my home. I don't know what makes me irritable, I think I do need a lot of sleep. But if there's something in my brain makeup or chemical makeup that maybe, you know, I'm open to that. You think? Well, I mean, it's hard for me. I don't want to over-diagnose things. I mean, I'm not, like the goal of treatment is to not, is not to create a state where you never have emotions. Like being irritable. Oh, right. No, I don't want that. But I mean, processing it properly and not being irritable. And maybe I'm saying where a counseling might. I agree. So why don't we do the counseling? Do you want me to just place another referral for you? Sure. Yeah, because I don't know when I placed the last one. If I even did, maybe I forgot to. Yeah, I'm actually not. Well, we, I don't know if we did it. Oh, this was a long time ago. This was in April of 22. Yeah, okay. And I said, patient lives in Boise, so Americana or Myrtle would be easier. However, he may also be okay with Nampa, whichever is fastest. Yeah. Do you still agree with that? Yes. Would you, you'd be okay with any clinic? Well, I, you know, I imagine the counseling, at least right away, would be. more current, or more, you know. Frequent? Frequent, yeah. And now, well, of course, now there's going to be a change, I guess. So you may want to see me sooner than later. No, I know what you're saying, though, is that ideally, if it's someone you're seeing on a regular basis, you don't want to have to drive as far, right? Well, and now, see, I didn't. judgment why I got here, she said on time within the limit, but I was worried because I didn't get here. I did the pre-visit paperwork and all that. Yeah, I'll place a referral. I think it's a good idea, but I mean, do you find those screening questionnaires helpful? Do you go through them? Well, Because your scores are so low. Well, they're not, they need more decorations, if you know what I mean. Yeah, like 1 or 2 days? Several, you know. Okay. So, and I think we've talked about that before. Perfect, yeah, we have. So there could be 1 more, like, sometimes, you know, not often, but sometimes, or, you know, once in a while. But, so anyway, the one on the irritability, like that, I put several days because I have to trust my wife, you know, and what she sees. And I did notice that I was abrupt and irritable and kind of snapped. Yeah, no, I think we should go up. I think that that is a very smart, reasonable thing to do. And then maybe I follow up with you in two months. Okay. There's some old medications that are still on your list that I want to get rid of. Oh, yeah, there was one the other day when I was in for something. One is Lexapro. Yeah. You haven't been on that in a long time. Yeah. So I'm going to stop that. And then do you still take zinc and vitamin A over at the counter? No, not zinc, I haven't. Although that one's supposed to help with cold, so, you know. Yeah, and then. I currently take it in. Who's your actual primary care doctor? Is it Dr. Edwards? Dr. Edwards, yeah. And I will be seeing him in the month. And he's in Boise. Yeah. Park Center. And you will be seeing him. Yeah. Okay. Yeah, I was initially seeing him and then he didn't feel comfortable administrating those kind of drugs, you know, like we're discussing in here, just not his lane, I guess. Yeah, that's all right. So otherwise, though, you said Pickleball's been going well? Yeah, I just had this morning, and the instructor and I hit it off on a project. for it, but you know what, we hit it off and he's helped me to simplify the game, slow it down, you know, break the game down to a more basic level, I guess. Yeah. Yeah. All right, I'm sending this prescription to Rite Aid, is that right? Mm-hmm. Okay. Yeah, they closed the one on Vista, so we're going to State Street, that's not too far from my work. and we do go downtown quite a bit. You're right, but I did close the one on very recently actually, so now. Yeah, it was. Yeah. Yeah, I think I was in there honestly like a week before they closed or something because I walked in and half the shelves were in there. They didn't have anything on there, yeah. Yeah, it was really weird, but they. You know that. Yeah, but they still had the pharmacist, so I was very confused. Anyway, I'm glad that they [inaudible]. Well, they didn't have the one thing I needed though, so that was a problem. No. Yeah. Yeah, honestly though, that store seemed like it was not doing well. It was always deserted whenever I'd go in, so I don't know. I don't know why, maybe because, well, SaveOn is the. It's not far away. And then there's, well, that's at the corner of Orchard and Overland. Yeah, I think it's the SaveOn. Right? Or, I'm not right. Walgreens. Walgreens. Yeah, but probably you're right about the SaveOn, SaveOn would probably be the one with the most customers. Anyway. Good news about Rite Aid is even though there's not many of them, the prices are usually pretty good for prescriptions. Well, I. But they're all covered. My Medicare, yeah. Yeah. Mark, I would look at things this way. We started that medication way back in January. You've been on a tiny dose. You've been doing pretty well, actually. You and your wife have noticed that some of this irritability has been popping up more. and it seems to be causing a bit of a strain. So we're going to go, we're going to double the dose, but I don't want you to think this is a high dose, it's not. Oh, yeah, I know you were saying that, and that's my request like that. Do I need to ramp up on this one? Nope. I can just, so start taking 2 and you're going to write in a new prescription for the 15,000. Correct, exactly. So when you go and get the new one, you'll only take 1. Right. But for now, if you don't want to rush to the pharmacy, just take 2 of what you have. Why? It's the same thing. I'll do that, I'll use them up. Yeah, absolutely. Now keep in mind, it may make you slightly more tired, but probably not too much, and it may stimulate your appetite a little bit. So keep an eye on that. All right, well. But I'm glad to hear the blood pressure was okay. I think it really was probably, it was probably partly anxiety. Well, so I don't know if you know, obviously he's not your patient, but my son had polyps. Yeah. They weren't... hemorrhoids, but they were kind of like, so he had polyps and one of them burst and was like a major bloodless. Oh gosh. So he was bleeding and it was bleeding profusely. Well, you know, he has, he experiences autism. Yeah. People always say autistic, I was told that you shouldn't say that, like, you're autistic. But anyway. Oh, versus. He experiences autism. Yeah. Anyway, he has autism, and so he doesn't express things well, so. Right. But anyway, yeah, he came to us and said, dad, you need to come in the bathroom, something happened, you know? Okay, so I went in and there's blood everywhere. I said, what happened? Nothing, you know, it took me almost a half hour to figure out what happened, because he just doesn't. God, communicate. And that's one of the things that my irritability, I guess, I get. stressed because it was a situation where we were going to a Christmas party and all this like that. Yeah. And I felt that stress, and he doesn't answer, that's one of the things we need to do, we need to give him time to process things. Yeah. It's kind of difficult sometimes. No, absolutely, no, exactly, so that was a high stress situation anyway, and as I'm sure you were. Yeah, so I was in the hospital with him, little sleep, whatever. And probably not eating right, and like I said, I could not sleep. In fact, this chair is a lot more comfortable than the one at the hospital. That'd be real, just like, kind of. Yeah, no, that was a high stress situation, and I also, you know, to give you some reassurance as well, is that even if you had taken your blood pressure medication, blood pressure is not like this, right? Blood pressure does this. Blood [inaudible]. Exactly, it responds. So if you're under a lot of pain or stress, yes, your blood pressure is going to spike. We just, what we really care about are like averages over time. Right. And that's why if you have a home cuff that you can check like once or twice a week, make sure you don't have a full bladder. So if you need to go to the bathroom, go to the bathroom before you check your, yeah, something we don't talk about. Keep your feet down, arms like this, right? Yeah, and the last thing you want to do is come home from pickleball, make a coffee, make the bed, sit down, check blood pressure. No, no, it's better to be relaxed, be reading a book or watching TV, and then think, oh yeah, maybe I should check my blood pressure. there, check it. Well, one good thing is I do it, he said, maybe like 2, 3 times a week. Yeah. I've been charting it, but lately, I'll get up some morning, it's 117 over 68. That's great. 114 over 65. Perfect. With a heart rate, I have a low heart rate anyway. like 44, you know. Has it always been low, though? I have what they call a runner's heart. Okay, good. Yeah, you've told me about it before, I think. But, you know, it's been up there lately. You know, it was up like 85 the other night, and my wife said, isn't that, you shouldn't worry about that? And I said, well, it says over 100 you have to worry about. I don't know why my heart was beating more. Well, will. It's good today. The anxiety medicine. lowered, should it lower blood pressure and heart rate? Not, that's a tough question, not, well. It doesn't affect the body muscles, it's more of a. Yeah, I mean, technically, like, this mirtazapine could make you a little bit lightheaded, so maybe it could lower your blood pressure a little bit, but not much, no, but what is very common is with, again, same things for blood pressure, anxiety, pain, stress can increase your heart rate. Yeah. And then blood pressure. Yeah, but no, I think you're doing well. Have you had any suicidal thoughts? No. No, I'm very, like I said, pickleball, you know. Yeah. I enjoy my job, it's not a glorious job, you know, but I enjoy being outdoors and people leave me alone, I get along with people, I'm doing a service, people thank me, and, you know, every day 3 or 4 people say, thank you for doing this, you know, and I used to turn and say, well, I get paid for it, and I'd say, well. Now you just say. Let them think that I'm just out doing the, taking care of the parks, you know? And they appreciate it. Yeah. I mean, the great thing about park people, outdoors people is, you know, it's like a community, right? So we all appreciate it. Yeah, because people don't want to go to dirty parks. Yeah. Or, you know, whatever, but anyway, yeah, and, you know, it's a good job, good benefits, they gave me like a $470. ear and things, so, you know, I. Oh, there you go. It helps you realize you appreciate it. Is this a surprise? Or? Well, they usually try to do something. Okay, so in a couple months, you want me to make that appointment- I don't think we're going to have any no-shows today.","1":"Hi guys, hi Alex. Hi Dr. Nguyen. How are you doing? Oh, well, I have a tooth that, you know, can make problems and. A tooth? Is that what you said? Yes, a tooth. Do you know what's wrong with it yet? Well, I think part of the cap is coming off, so, anyway, do you, do you have a dentist you like? Oh, well. I guess I. Oops. That's not you. I've just been going to the same dentist office for 20 years and they always treat me right, but that doesn't mean there aren't better ones, but I like my dentist. Okay. But where do you live? You live in. Albertville. Albertville. Yeah, mine's over in Green Valley. It's called, actually they changed their name, it's called Sunnyvale Clinic. Oh, there he is, okay. He used to be called Howell and Partners. Okay. I guess they were looking for better marketing. It's a really nice place, they bought the chiropractor next door, they remodeled, it's a nice place, everyone's nice there. They also have, you know, it's basically general dentist, but they also have an oral guy that comes in, he did my implant that I had to do, so they have general and they also have an implant guy. I like them, they're all, Sam gets been there a long time, but he's not like, he's probably my age, and then there's a younger guy who's really good, there's, yeah, I like it. I don't have anything to compare it to, but I think they're great. Okay, so this is. For what it's worth. What's the name of it again? Sunnyvale, like Michael Carter, Valley Dental Care or whatever. Okay, great. It's in Green Valley. Sunnyvale Clinic. It's in Green Valley. All right, well, okay, that takes care of the -tooth part of it. For the last weekend, I have had swollen legs from the hip down, and I have pains on the inside of my thighs, and I have pain on the inside of my calves down here. Those all came together, the swelling and the pain? Yeah. It's been a week? A little, or was it a week? Last weekend, yeah. I noticed it last weekend. Both sides? Yeah, both sides. Okay, along with the symptoms in your legs, the swelling and the pain, any other new symptoms in that time, or roughly in that time? My back, about halfway up on the left side here, but I think I must have twisted it somehow. The back hurts more when you move a certain way, or? Oh, yes, yes, it was whenever I would move like this, I could feel it, yes. Okay, any other new symptoms? His weight is up Oh yeah. Yeah, you're right. Could easily be that. So both swollen and pain, okay. And obviously, you don't recall any injury. Okay, so along with this, Alex, along with these new symptoms, you didn't mention anything else. Are you having any increased shortness of breath? Any shortness of breath when you lie flat in bed? Any chest pressure? Anything respiratory going on? Well, again, walking is more difficult now. You're huffing and puffing. Pardon? So the answer to the question is yes, you feel a little more short of breath? I'm still short of breath, in fact, I have to breathe real hard while I'm walking any distance. But is that worse? the last 10 days? No. Not worse. So you do have this ongoing shortness of breath, but it's not necessarily worse, and you're not short of breath when you're lying flat in bed? No. Okay. Okay. Okay, we will address that for sure. Will you tell me other questions, anything else you want to talk about? Well, you advised me to go to the emergency room, what was it, a month ago? Mm-hmm. And so I was there in the emergency room for most of the day. Yeah. About 3, 4 weeks ago, yeah. Yeah, and I was told by Dr. Patel. The ER doctor, yeah. Yes, to stop lisinopril after he had talked to a nephrologist. Okay. So I did, but yesterday I noticed from. And that was because your potassium was high. Yeah. Yeah. But that of course could be. I don't think I use any tourniquets in the night, I try to keep the tourniquets off all the time. But anyway, Dr. Reed apparently has sent a prescription to HealthMart for lisinopril. So I don't know what that's all about, I haven't had a chance to communicate with his office. Okay, wait, you're saying he told you to stop the lisinopril? Yes. And normally, Dr. Tran would be the one who describes it. Yeah, I see, okay, let's see. So it's kind of confusing. Hypotasian, so he treated you for the hypotasian, they discussed it with the on-call nephrologist, said go home, ultrasound of your kidneys was normal, no infection, so they said stop the lisinopril and monitor. Okay. Um, Oh, you know what happened. So you're not taking the lisinopril still, right? No. I figured it was, it was affecting the kidneys more than was acceptable. And I've seen information numerous times that. Yeah, I don't know, I think it was just a mistake, the. To stop it? No, for him to send it in. Oh, okay. Unless, yeah, I'm not sure why he did that. Okay, so is that the only medication change is that you've stopped the lisinopril? Well, let's see, the only ones I'm taking are, all right, I've got a picture here, let me tell you. Where is my picture of my meds here? It's here somewhere. Yeah. I think you're on the rosuvastatin. Yes. Right? You're on the propafenone. Yes. You're on the Eliquis, apixaban. Yes. You're taking carvedilol. No. You're not taking carvedilol. No. Right, this was a big confusing thing was with the carvedilol. Okay, you're not taking carvedilol. No. And what about metoprolol? No. Neither. Neither. Okay, that's also a little, okay, we'll have to figure that out. Okay, and not, and currently not lisinopril. Okay, are you taking pantoprazole? Yes. Okay. For your GI stuff. Are you taking amlodipine? Yes. You are. Okay. You are, you are definitely taking amlodipine, okay. Yes. Okay. You took a picture of the bottles, right? Yeah. I'll switch for you. Okay, let's see. Okay, other questions, comments, et cetera? Let's see. Oh, in the latest lab, I didn't see the hemoglobin level. either on purpose or by accident, it wasn't ordered. Bone, triazine, and ProvaRaze. Well, but someone else is following your hemoglobin, so those orders are in there from Dr. Fernandez, and she probably said, this is when I want you to do it again, but I don't know when that was, because you had it when you were in the ER. Well, I'm doing it every 2 weeks for you. But that was kind of. I haven't been to an nephrologist yet. Okay, well, wait. We did our, you know, this gets confusing, we We had done a standing order. Well, but was that for the kidney or was that for the hemoglobin? But we were waiting for an appointment with a physician. Right, that was for the kidneys, not for the hemoglobin, right? Right. Because the hemoglobin's been pretty stable. So Dr. Fernandez has future orders for you to do all of her stuff. Presumably right before you see her, you have an appointment with her in Spring. Mm-hmm. So she has labs in there for you to do. Which includes the hemoglobin and whatever she needs for the anemia. Okay, anemia. But the kidney, okay, so, okay, so, right, so one of the other things we've been dealing with is the chronic kidney disease. Right. The elevated creatinine, and we said, okay, we need nephrology, and remind me when the appointment is. Oh, for nephrology? Yeah. August 8th. August 8th? August 8th, okay. Right as the initial consult for the chronic kidney disease\/elevated creatinine. Okay, hopefully they'll come up with something before then, but that's it right now. Okay. Yeah, so we'll go over the labs and we'll make a lab plan. before you leave. Okay. Oh, thank you. Right, and for the anemia, you had that M spike, and you had a bone marrow biopsy with Dr. Fernandez, and there was a small monoclonal plasma cell population, she didn't think much of it. You had some kind of genetic deletion in one of your chromosomes, so without, but without other worrisome features, she thought you might have what they call an early dysplastic syndrome, which is when, okay, there might be some changes there, it's not blood cancer, but we have to keep an eye on it, okay. This may be the explanation of your so-called MGUS. You may have seen this term in your chart, maybe not. MGUS means monoclonal gammopathy of unclear significance. And that's why she did all those other tests, and she's sort of formulating her plan, and we'll keep an eye on it. Because God forbid if it sort of goes, then she'll have to treat you, but otherwise we'll just monitor it with blood tests. For the anemia, MGUS, possible. mild dysplastic syndrome. I know it's a lot of words. Yep. But Dr. Fernandez will keep an eye on that. So that's the hemoglobin and all that. Okay. Let's see, what else is on that? So that was one thing. Right, so, right, this was all a little bit confusingly. So you had seen me before, you had had the swelling, you had had more shortness of breath, and fatigue, your heart rate was getting low, and we weren't sure, you know, what was what, but because your heart rate was low, those were a bit confusing, because your heart rate was low, and I didn't know if that was contributing to your fatigue, I thought we should hold the metoprolol. So I think I told you to stop the metoprolol and I emailed Dr. Tran. Okay, good. But then you got a little confusing in your emails, I wasn't really sure. So you held the metoprolol and you did not restart the carvedilol, right? I tried 2 times, but immediately I have. Diarrhea. Severe diarrhea. Okay, so for a while now you have not been taking carvedilol, you have not been taking metoprolol. Right. Okay. But you don't feel any better? No, not necessarily. Okay. But you're off of both of those and you've been off of them for a while. Okay. But you're still taking, oh, sorry, back to the medication. Are you still taking, this is where I'm confused. It should be on your list, but I don't know where it was. Weren't you taking diltiazem? Yes, I still am. Okay, because it fell off your list. Oh, it did? So you are taking diltiazem. Right. Can you find this again, Michelle? So who took it off your list? Discontinued by Emily North, 3\/1\/23. What? Okay, hold on, there's two in here, though. But you are taking it. I am taking it. And you've seen Dr. Tran. Next week. No, no, but you saw him, when did you last see him? Couple months ago. December. Okay, so you are taking, you're definitely taking diltiazem. Right. Okay. because he doesn't, it's not in his note that you're on it, and I think someone took it off the list, so I don't know if he knows you're on it. You're the one that's taking it, but. So you are taking diltiazem, okay. there. Well they probably held it when you were in the hospital, you know, earlier in the last year, because your blood pressure probably dropped or something, but. probably say don't, don't restart it. But so you're taking diltiazem and amlodipine? Yes. Now, are you checking your blood pressure at home? Yes. And how's your blood pressure at home? It's running basically 160 to 180 over 70. So pretty high. Pretty high. Over 70? Over 70, and sometimes less than that. Okay. Yeah, and you're seeing- Heart rate is about 50, and I'll- Heart rate's 50, so a little better than it was. Yes. Okay, it was in the 40s before, so it's a little better, but you don't feel any better, and your blood pressure is high, so this is getting pretty sticky. Okay, and you're seeing Dr. Kim, cardiology, in about 6 days. Yeah, for a few days. Yes. Okay. Okay. carvedilol probably had, probably might have done some good, but I just can't continue to take it. No, no, it's giving you the diarrhea, but the metoprolol did not. No. As far as you could. As far as I could tell. As far as you could tell. Let's see, I'm going to switch gears for a second. You had a COVID vaccine, you had the flu vaccine, you had your pneumonia vaccines, you had an RSV, you had your tetanus, you had your shingles, so you're good on your vaccines. I didn't peek at this, like no falls, no falls. No falls. Good. How's the hearing doing? I know that's a point of contention, but how's it going? As far as I can tell, it's fine, although I do get wax in the ears, but She's not saying anything. No. I still do ask her to repeat quite often, but she's usually talking to me from another room or wherever. Right, that makes it a little difficult. Have you considered hearing aids? Well, he's never been tested. Right, right. I have been tested. Right, but I mean, you feel in talking to him that his hearing is off a bit. I think it could be, yes. What do you think, Alex? Actually, I don't think it's hearing, I just might not be interpreting what I'm hearing. Well, this is part of hearing loss, this is the kind of hearing loss that I have, I can't distinguish the sounds. So did they say hearing aids wouldn't be helpful? No, they, I mean, they could still be helpful, yes. I see, but you don't have any, okay. But I didn't, I haven't bitten the bullet yet. Okay. Alex, any, no falls in the last year, right? You had one the year before, but. Well, you know, when you were, I mean, you had a fall in the hospital, when you were in the hospital, and that's this year. No, this is 2025. Well, in the last year. This is within the last year. Well, you. One in the hospital. And then when you came home from the hospital and you were still unsteady on your feet. Okay, okay. But since you've recovered from your hospital stays, you have not had any falls. Okay, thank you. So maybe we can attribute those to illness and weakness. Not that we want you to fall at all, but okay. No, you've been steady. Last time, you thought your memory was pretty stable, a little word finding troubles here and there, but. Continuous. But mostly stable. It isn't, it's not that concerning. It's kind of funny sometimes that, I'll come up with the answer a little bit later, just what I was thinking sometimes. Right, right. I gotcha. I think your memory is fine. You can't find anything, but that's a guide there. Let's see, I know we talked, I don't know if since last year you guys have done your advanced directives for health care and then we talked about it last year. We are going to a workshop on Wednesday. On Wednesday? Yeah, about that. Good. -ment when we get our trust. Yeah, usually when you do a trust, you'll do it. I mean, if you did it with an attorney. Yes, we did. They'll usually say, here's your advance directive, fill this out, and we did, but it's been so long ago. You have a trust filed somewhere, do you remember where? We can do it again, it's normal. And if that was a long time ago, it's probably good to revisit it anyway. Okay. We were thinking, well, we were considering, we didn't think we had one, so. Okay. Okay. Yeah, check it out. No, I think we did. I think we did. Okay. Alex, do you still have 2 or 3 drinks a week? 1 or 2. 1 or 2 per week, yes. Okay. Last night, we had a canned margarita. From Trader Joe's. Trader Joe's. How was it? We split the city into cans. It wasn't perfect, but it wasn't bad. Not bad for being a can from Trader Joe's. How's your GI stuff? How's your stomach feeling, all that? Oh, I still have the incontinence problems with urinary and fecal. Also, with a couple of visits to physical therapy, things have improved, and I'm feeling better about that, and it's being better. [inaudible] Yeah, and your stent removed a while back. Yes. From the, because of the, what they call the choledocholithiasis, that gallstone that was stuck in a duct that we don't like it to be. Yeah, that was, you were pretty darn sick. That was about a year ago, that's when you were in the hospital. Yes. Your shoulder's still doing okay? You managing okay? Yes, it's not that able to do that much overhead or whatever, but yeah, they're not a big problem. All right, Alex, we'll take a look at you and we'll make a plan for those things we discussed. Any other questions or concerns? I don't think so. Huh? Can you think of anything Michelle? I'm looking at you. I have a little bit of extra fat there. As long as it's fat. Pardon? It's fat. Oh, I think so, yeah. And you have the pacemaker. No. We don't. I have the loop recorder. We have the loop recorder, not the, I know they put something in, not the pacemaker, okay. So it's in, the loop recorder is in, because I see they're doing readings from something, it's from that, it's not from the pacemaker, okay, my mistake. I kind of wonder why they wouldn't give me the pacemaker. Does a pacemaker cure AFib? Not usually. All right, Alex, let's take a look. The main things I'm concerned about in the short run are just how you're feeling, the breathing, seeing what's going on with the swelling, and then keeping an eye on those kidneys and the darn potassium. And then it gets a little complicated with your blood pressure, your blood pressure is high, but the lisinopril complicates things, plus you're not taking the metoprolol or carvedilol. I don't know if Dr. Kim knows you were still on the diltiazem, so I will later today, I'm going to send him a little email just to update him, you know. Okay. Can you hear this? Yes. and weak. Some wax, not totally impacted, but a little bit, half way, nothing there. You still go to ValueMart periodically to check the eyes? Yes. Do you feel like you need a hearing or want a hearing evaluation? Well, I was going to go get one at one point. Okay. I don't know what you did. You can do it at ValueMart. Yes, but they wouldn't do it for him because he had wax in his ears. There's a little bit of wax, but it's not, I can have him flush it out. I don't want him to, you know, I mean, it's not totally impacting it, but I don't want to give him an excuse either. Hold your breath for 2 seconds. Good. Okay, let's listen back here. Give me a big breath in and out. Good. Actually stay there for a sec. Your back pain is what, in there? Or? A little higher. A little higher? What about in there? Like in there? That's not very painful right now. And it was a little worse with movement? Yes, yes. Okay, lie back for a sec. Okay. a little painful there. Yeah, it's because we push on the bone, we're trying to see how much, you do have quite a bit of fluid, and then you've got significant swelling there. Yes. This has been over the last week or so. That's when it showed up, it's been this way for a week. And no medication changes in the last 2 weeks, is that true? Well. That's true. Right, because the ER was a month ago. up to about here. You said you have the swelling but also pain where? Right there, when I'm rubbing it feels kind of like little pins and needles. I can hear it. But when I'm walking I can definitely feel it, it's the pain, but it doesn't, it wouldn't stop me walking, which is weird. Pain here. And there is pain down here too. Also more when you walk? That's when I Notice it most. And that's new also. Yes. It's like a nerve pain in me. Yeah, bend this knee. Okay. Does that hurt at all? I started to hurt a little bit there, nowhere else. Okay, push me to the right. With my leg? It's okay. Yep. Pull me that way. That's okay? Yep. Okay. I'm kind of slippery. Okay, just relax. I'm going to lift your leg all the way up, you just relax. Does that bother you? Other than [inaudible]. Throat's a little tight here. A little tight, that's a different feeling. Okay, I want you to roll halfway on your, roll. Face the wall? Quarter way facing the wall, yeah. Okay. Go, you'll scoot your butt a little bit towards me. Okay. And then roll onto, I really need to roll onto your side though. Okay. I know, it's not the best table for that, okay, there you go. Does that cause any trouble? Just feeling a little bit there. A little pain? Is it the pain you get, is it sort of a touch? Yes, it is. It is. Right in there. In there. Yep, that's painful. A little bit. Okay, let's get you up. It seems like the swelling and the pain have come around the same time, is that? Yes. So I'm going to guess that they're indirectly related to it. Directly. when you have pain going down your legs, especially when you walk, we worry about your back to some extent, but the location of the pain is weird, and back things are not going to cause swelling. Right. So you got about 2, what do we call it, 2 plus edema in your legs. 2 plus. 2 plus plus, 2 to 3 plus, something like that. It's a quasi-quantitative term, but. Uh-huh. [inaudible] So hopefully it's exam things down before I forget. Okay. So you went to the lab recently, I think that was for me. Yes, Thursday. Thursday, because we're keeping an eye on those kidneys. And that was, and the kidneys are, let's just say, stable, and your potassium is normal. Did I put a standing order in, Alex? I thought I put a standing order in. Where I said you could go. I think you did, every 2 weeks I was going to go. It doesn't. So I will continue it. It doesn't say that, but yes, it should be on a standing order. Okay, okay, so that's, so for the kidneys and the high potassium, you're going to see nephrology, but that's still 6 weeks away, so I would still, unfortunately. Every 2 weeks? Prefer you do that. It's not a problem. Okay, but we also have in the last 7 to 10 days, we've had more edema, more swelling of unclear cause. Why are you having more swelling? Are you having worsening heart failure? Are you... it a medication side effect, but you haven't changed your meds at all in the last 2 weeks, right? Except you're off the lisinopril for about 3 plus weeks, right? I think so, yes. Okay, so for example, it's not because of worsening kidney function, your kidney functions are the same, so we can rule that out. Okay. Things that can cause it include bad veins, bad kidneys, bad liver, bad heart. You could theoretically have blood clots in both legs, but that's extremely rare to have blood clots in two legs. Yeah. Can you take [inaudible] Think what? And you take Eliquis. And you take Eliquis, so it may be very unusual to not have a clot at all, that's not possible, and have 2 clots would be very odd indeed. I did try, probably 1 week ago or so, I did try the carvedilol again, but I just took 1. Okay. And 1 morning, and that was enough to Okay. Verify that it wasn't going to work. Sometimes when your protein is very low, either from kidney failure or renal failure, but 3 weeks ago, your protein was okay. Now, is it possible that all of a sudden, it's worse again? Hmm. Unlikely. So we want to make sure there's nothing urgent going on, number one. That means heart, liver, not really worried about the kidneys right now, et cetera, and again, unlikely to be a blood clot for various reasons. So I'd like to repeat the heart blood test and the liver tests. Is it worth getting a chest x-ray? I don't think so. If the heart test is, because last time you did the heart test, the blood test for heart failure, it was normal. and that wasn't that long ago. If it's all of a sudden jumped up, then we may have our reason. If it's the same, there's okay, it's not your heart, it's not your liver, it's not your kidneys, and therefore it's very unlikely to be something worrisome, but yes, it's annoying and it's giving you pain. So the question is then, do we give you a water pill? Do you do compression? So a lot of times for edema, we keep our legs up, you can wrap them, you can get compression hose, that kind of thing. It'd still be nice to know why and see if it's reversible, right? Right. So, but I want to start with these things, Alex, is to get the, you were having abdominal tenderness there, there was no abdominal mass, nothing like that, so there's a little bit of a mystery, but we want to make sure that for the moment that there's no worrisome mystery. Okay. So she's going to, okay, so what are we going to do? So Alex, she's going to give you a couple lab tests to do. Okay. You can certain, I don't know that I would wait the 2 weeks to do them again, I mean, I would probably do them the next, definitely before you see Daisy. Oh, okay. Okay? So tomorrow or the first part of next week. Yeah, you can go today if you want, but I'll leave it up to you. You don't have to be fasting. Okay. Is there a TestGenix in the building? No, there used to be. It's two blocks down on North Drive, across from the hospital. North at Bacon, two blocks away. That's okay. If you want, whatever you want to do. I mean, it's close enough in Meadowtown. Okay. And then you'll do your, and then for the kidney and high potassium, you'll repeat in a couple weeks. Okay. And we'll just keep an eye on that. You already have the standing order for that. Right. And then we got all this business here, blood pressure being high, the shortness of breath, and then the medication changes, and it's unclear what's going on. You've got the loop recorder in, you've got the low heart rate, that's a little bit better after stopping the beta blocker, the metoprolol and the carvedilol. I'm going to email Daisy because there's a lot of moving parts here. Yes, indeed. So I've got to make sure he's He was in the loop of the medications because he did not acknowledge you were taking diltiazem when he saw you. It's not common that we use diltiazem and amlodipine and a beta blocker, but we also have this blood pressure being high, so we've got to find that balance. It's a real challenge there. Yeah. Okay, and the other thing is, when should I see you again? Some of our stuff, of course, a lot of it will be with the computer, right? How the blood tests are, those are some of the immediate concerns. I'm trying to see... I've been seeing you a lot in the last year because of all those unfortunate things you've been through. Right. And before that, I think we were just doing once a year, unless you were having problems, but I'm not sure. But maybe we should, so one thing that I'm toying with in my brain is as a routine, a routine thing that I don't know, maybe go from once a year to twice a year. Okay. What do you think of that? Yeah. I don't necessarily have to see you, I think between now and then kind of depends on this stuff. We're going to, I'm going to monitor the kidneys until you can get in the kidney doc, or hopefully nothing will go crazy. If the potassium goes up, we'll have to deal with it. We need to figure out this breathing thing and the swelling, and I'm going to email Lim, and I'm going to hopefully he'll do whatever he needs to do, so I don't want to make you come in just to come in, but if you're not doing well, something else comes up, whatever. Mm-hmm. Okay, come and see me. Does that sound? Sounds good. Sounds okay. Do you want her to clean your ear? They would flush it out with warm water and hydrogen peroxide. Occasionally it's uncomfortable, it makes you busy, maybe 1 out of 20 people, most people. No, sure. Yeah? She can clean the ear, yeah. You've had it done before. Say again? You've had it done before. Yes. Here is the right. Right, yes. Yeah, okay. She will, she'll be in soon. All right, I'll talk to you soon. Okay, thanks. No problem. I appreciate it. A little more red? Yeah. Yeah. Then we have to go get more red. So the black goes up.","2":"His x-ray looked okay. Hey, how are you? I'm doing okay. How are you? I'm doing okay. I'm sure you've seen my- Well, I was looking over the notes. Yeah, so I've got- surgery scheduled for November 2nd. You're doing surgery, okay. Yeah. It is scheduled the 2nd. Yeah. So we discussed options with you. Yeah, yeah, I just, you know, I'm just inclined to get it out of there. And I think that's a natural tendency. Yeah. You did have the, it was in several parts of the biopsy. Yeah, there's one area that's a 3, and I guess on their scale of 1 to 5, and that's the one that makes it a, you know, kind of a moderate. It's funny, there's a typo that says 4 plus 3 equals 6, but yeah, the 7, it's the 7, right? The glue's in the 7. I guess so, yeah, the way I've understood it is there are 3 spots in there, and they rate them on a scale of 1 to 5, and I've got 2 1s. and one 3, and it's the 3 that requires some, you know, some treatment. He sent you for some other, did he send you for another? Yeah, I did a, he did a, after the biopsy came back positive, then I had a, what do they call it, a PSMA PET scan, where they want to make sure that it hasn't spread anywhere else, and that was good news that, you know, it hasn't spread at this point. And, you know, he described it, what we asked him, because we haven't told Brian and Emily yet, and I know you've seen Brian a couple of times recently. She's so anxious about everything. So we're going to definitely tell him before the surgery. And, but Dr. Kim described it as, we asked him, well, how, you know, how can we tell our daughters about the, he said, tell them it's localized and curable.So, you know, I mean, so I'm hoping that, you know, that he takes it out and, you know, I mean, some of the things that make me lean towards surgery are just get it out of there, one, and then two, if you go the radiation route, you know, there's hormones you got to take, you know, after it, and then if it were to come back, you can't do, you know, you can't do the surgery later, so if you do the surgery, You can do the radiation after the surgery, so that just seemed like a more sensible approach to take. And Patricia's anxious just to get it out of there too. Yeah, and it's not that, I mean, you know, a cancer like this can be cured with radiation. Yeah, yeah. And so it's... But there is something psychological about getting it out and if you need treatment in the future, having that option and so on. Yeah, I mean, I'm not looking forward to the fact that I'm going to have to have a catheter for 10 days afterwards and, you know, then you might have, you know, incontinence and stuff like that, but. I don't know. Unfortunately, it is what it is. I got to deal with it. Yeah, and not that you're risk-free, but the techniques that they've developed over the last- 15 years. Are good. You know, they use the robot. Yeah. This is one of the main surgeries that the robot is actually helpful. Yeah. To do nerve sparing surgery and all that. Good, good. So better outcomes in terms of incontinence and erections and all that kind of stuff. Yeah, yeah. Yeah, so I, you know, again, you know, I I wasn't looking forward to that biopsy, I had a fear of the biopsy and then, you know, the biopsy itself wasn't bad. It wasn't that bad. It was just, I felt I felt faint afterwards, and I ended up going back to his office, just laying down for a little while, and then I had a lot of discomfort. After it, in my, you know, just like in the stomach and I felt like I had to have a BM and it was really kind of weird, but I took 2 Tylenol and that finally went away too.And then it just goes to show the MRI is not perfect, right? It's the last year of the MRI. Yeah, a year ago the MRI showed no evidence of anything. It showed there was a growth in my bladder. that I did have, and Dr. Kim took that out right around a year ago, and that was fine, but then a year later, you know, but my PSA just kept going up, it almost kept, you know, kept like doubling every year, you know, it was... and the most recent one was 7, so I knew something was going on in there, so, anyway, it's not, you know, there's not a lot you can do about it, the good news is, yeah, It's, you know, as I understand it, it's a fairly common cancer among men, but it's treatable if you take care of it early, you know. Yeah, most are treated if you take care of it early, there's, you know. prostate cancer is kind of like breast cancer, it kind of depends what you catch, but also what, how aggressive it is, you know, what type of breast cancer, what different types and different aggressiveness, so. Yeah, I don't know if it's psychological, you know, now I feel like I got a little geeked out. What's going on down there? Yeah. Probably psychological. I think so, I hope so, I hope it's not, you know, feel this fear, oh now it's, now it's spreading after the back, but anyway, you know, other than that, other than that, I'm pretty good. Yeah, that's fine, tell me if you have any questions. Well, I saw, let's see, I saw Dr. Green, my cardiologist, just about 10 days ago, and he says, you know, his words were, can't make you any better than you already are, so. So he doesn't have any trouble with you having surgery?No, he didn't know that I was going to do the surgery, so, you know, I definitely need to check with him ahead of time, you know, because I did, even when I had the biopsy, I I didn't consult him on this this time, I did last year for the surgery, but I went off the baby aspirin for a week ahead of the biopsy and then a week after, and so I'll need to go off the baby aspirin again for this surgery. So he didn't, so Dr. Green didn't add anything to it? No, no, he said my cholesterol is good, he said my atorvastatin level was fine. Blood pressure is up? blood pressure is okay, my blood pressure is actually still low today. Do you check it out? No, I don't, I don't, I'm like Rachel who You know, it's checking it every hour on the hour. Uh, yeah, it's not good. I know it's, it's a little tricky with her, whether she should monitor it at all, but yeah. Yeah. So no, I don't check. And I am on, what do you call it, metoprolol, you know, way back when, they prescribed 25 milligram, but it made me... I don't know what it, I can't remember exactly what it did, but I only take 12 and a half, I cut it in half each day. You take a half, yeah. So I take a half each day. Which doesn't do much for your blood pressure, your blood pressure is good. Yeah. You know, you're having this chest pain, what was the cause, and you see this, okay, maybe this small vessel. Yeah, that's what they, that's why they, you know, for those complaining of that dull ache, and they said, well, let's try the metoprolol and see if it does anything, and. I can't complain that it, you know, when I first started taking it, I think it kept my, it was keeping like my pulse too low, it was like, you know, when I would do the treadmill, I couldn't even get my pulse up that high, so anyway, so they cut it back to 12 and a half.And then the only other things that I can complain about, you know, you remember my Episode in July with the ankle, you know, where initially it could have, you know, you suspected it could have been gout or it could have been an injury or something like that. And, you know, eventually it went away. How long did it take? Uh, you know, a lot longer than I thought it would, at least 3 weeks probably, or 4, but the fun- I saw you in July, and you've got a couple of videos, okay. Yeah, and it- And the funny thing is, is I occasionally, you know, I still, right, I still feel a little pain, you know, like up the side of this shin. The lateral side of your lower lip. Yeah, lateral side of the shin, and occasionally I feel a little pain. on the ball of my foot as well. I don't know, I, you know, is that like, is that like, can that be neuropathy or anything or, you know, neuro stuff? Could it be nerve pain? Yes. And then the other ache I constantly have is this left elbow of mine. And then I get these aches down, you know, the base of my neck here, and I don't know if that's just stress, it seems to come on at night more, you know, like before I go to bed, and then I go to bed, and then it's fine in the morning. Other than these, you know, I guess you'd call minor aches and pains that I have, everything's going okay. You know, my platelets, my platelets actually went up. Because I think I sent you that text, or that test, I had Dr. Patel do one of her tests on me when I was having that gout, you know, or the ankle pain, and my platelets were up to 156, it was a test I had to email you. We're, you know, going up on the portal. All right, because she's not on the system. Yeah, she's not on the system. And the only thing that came up weird in that test was an EOS number. It was 0.6 that was out of, everything else was at normal range. I'm going to guess you didn't care.No, no, she didn't care and I asked you about it and you said you wouldn't worry about it either, although I did read somewhere that that could go up when you have prostate issues. I can't imagine that would be true. Okay. Eosinophils usually go up most commonly with sort of allergic things. Okay. Could be other related things. I mean, I'm not saying that's not true, but it's hard to imagine why. Yeah, I don't know. Exactly. That's why I try to avoid looking things up on the internet. I mean, you can, you just have to know that it might be hard to get the answer or... Yeah. sometimes harder to interpret. Yeah. You know, what it says, but. So all in all, I'd say I'm, you know, I'm good. You're feeling okay? Yeah, I feel okay. I, you know, I, with all these procedures I've been having recently, I wasn't. you know, walking as much, or exercising as much, but I tried to pick that back up again, um, and, uh, you know, then I'll just have to have this, this surgery, and, you know, Sounds like we'll be a little bit out of commission for 10 days afterwards or so, and then I hope I just get used to, you know, how it impacts your going to the bathroom and all that sort of thing. Eventually. Yeah. And hopefully we'll heal up and eventually be okay. Yeah. Well, I hope this, you know, I hope these robotics do, you know, do as little, you know, they minimize any potential damage. Yeah, they certainly do reduce it. Yeah. I mean, the case is different depending on your specific anatomy. Yeah, yeah. You know, I like Dr. Kim, you know, he's a good guy, you know, he answers all the questions, I like the fact that he's, you know, kind of a younger guy, you know, he seems on top of it, and he doesn't seem overly concerned. I tend to hate that expression. -is what it is, but it is what it is in this case.Yeah, no, I know it's always anxiety provoking, but yes, most of these things end up okay, but this is why, but because there are potential issues with surgery, this is why you do have to think about is this the right thing to do, because this is why we often stop checking in after a certain- Age also, well not because of that, but because a lot of times the cancer will be sort of slow growing and you'll die from something else, right? Yeah. But when you're young and healthy and it's changing like that, it does make sense to go get it for sure. Well, I have a friend who's got, you know, is that situation you just described, a good friend of mine, he's been diagnosed with prostate cancer, but his scores must be like ones or something like that, because they're just monitoring it, and that's where, you know, you just monitor it because it's slow growing, but the fact that I have this... this one particularly concentrated area it's it's it poses a higher risk yeah so no I think you're doing the right thing yeah I'm going to see Dr. Patel on Wednesday as well just to get her take, but I'm planning on going forward with the surgery. Okay, sure. You say their platelets were okay last- Yeah, it was 156 on that, I went and looked it up before I came here, it was 156 on that latest test, and I'm scheduled to see- Sharma, for my regular visit with her, we went from, I was seeing her every three months, and then we extended it out to every four months, and my next four-month visit is actually, I think it's like October 12th or something like that, so I'll see her again before the surgery. Okay. And I got to get, I guess I have to get an EKG ahead of the surgery, too, that they're going to send me some paperwork that describes everything I need to do. How do you order? Did he? I can see he ordered one, I don't know if he told you where to do it, or? Well, I talked to the surgery scheduler, and she told me I'm going to get a packet in the mail that, you know, tells me everything I have to do. You know, there's a blood test and this EKG that they want done.Another thing is it could also really be done in Dr. Green's office. Yeah, yeah. You could get an email and say, hey, I'm having surgery, they want an EKG, should I do it in your office or what should I do? Yeah, okay, okay. Yeah, I'll see what the paperwork says, but yeah, I need to connect with Dr. Green anyway, so. Maybe I will just have them do it. My EKGs always come back normal. Are you still doing B12 shots? Not shots, but I take a pill every day. You're taking the vitamin D. I take vitamin D, I take vitamin B, and I think... Because of vitamin B, I started taking folic acid too, a folic acid supplement. I just take it. So yeah, I take six things every morning. I take the atorvastatin, half a metoprolol, a baby aspirin. And then three vitamins, B, D, and that, what do I describe it as? Folic acid. Folic acid. Yeah. You're still using your CPAP? Yep, every night. Good. Every night, and that all seems to be checking out fine, so. Okay. But yeah, bottom line is, if I didn't have this prostate thing, I'd be feeling pretty good. You'd be doing okay. Yeah. And what do you make, if anything, of these little, you know, aches and pains I have? Well, they're all different, Jason, but they're not related. Not related, okay. So the ankle pain went away. The ankle pain went away, the ankle pain went away, but I still have, you know, like I said, I still get this little pain. So when do you get that pain? on the leg, the right lower leg? Kind of in the evening, I would say, more, like even if I'm in bed, if I'm just, you know, if I move my ankle, one way or another, you know, I kind of feel it. It's almost a feeling like shin splints. So you will feel it if you move your ankle?Yeah, and then the other area, like I said, right after that ankle episode, I think I told you, my big toe would hurt a little bit, and then the ball of my foot, I would feel an ache in the ball of my foot. And when do you feel that pain, the ball of your foot? Also in bed, or when you get up in the morning? Sporadically, I would say. Sporadically. And you don't have any worsening or new low back pain or anything? No, I tweaked my back a little bit yesterday, leaning over too far to put an ant stake down someplace. So I've had a little back stiffness last night and this morning, but nothing, you know, nothing debilitating or anything like that. Okay. Let's, and then the cell phone is probably just the, you know, that, what do they call it, the kind of cell phone. I've had it for a while, but it's funny, you know, it kind of just aches and My forearm, and there was one stretch where I felt like I had a little, you know, puffy area here, like there was maybe some drain in here, some fluid was coming, but that's gone down, I think, I think my elbow is. I'm looking at your PET scan with some DNA. Yeah, unfortunately my arms are up here like this. Oh yeah. But they said, but they said my neck was fine because it was, it was, you know, it was a head down to mid-thigh. Yeah, they didn't, they don't always comment on these, on the musculoskeletal system, they didn't mention any problem with the neck, they didn't say there was, you know, smart fluidic degenerative changes in the low back. Yeah. Mild to moderate, but. Yeah, yeah. Mild, mild arthritis, multi-level degenerative changes in the spine, which we always see. Yeah, for sure. It doesn't really mean much. Okay. Where do they see that arthritis? On the PET scan. But in my neck? -on the lower back. The lower back. It doesn't mean it's not in the neck, but they didn't mention the neck, so. Okay, okay. But usually if you have degenerative changes in here, you're going to have them in the spine. Okay.Up here too, but is it causing your pain? Not necessarily. If it just comes at night. Well, you know, and I think what causes it actually is sometimes if I'm watching TV, I might doze off a little bit and my head flops back, you know, and it probably... Sure, also. Maybe I'm tweaking something. Right, and it may depend on the angle, I mean, I don't know where you are, I don't know the angle of your head. Yeah, yeah, yeah. Just stretching out the tendons and the muscles there. I think, you know, I think my head just falls back like that when I doze off, so maybe you'd tweak something, I don't know, but it's... Well, you know, there's no tumor there. Yeah, yeah, exactly, exactly. So that PET scan, you know, it would have lit up if there was something there. Right, so nothing lights up and you're fine. Yeah. Let's see, Jason, housekeeping stuff. Mm-hmm. Just look over this stuff, that's okay, that's okay. Hearing's still okay? Yep, yep, hearing's good. Yeah, maybe when it's not good. All right, your colon cancer, you're good there, nothing lights up on the pad, you had a colonoscopy in 2019, so you're good there. So I had that in 2019? Yeah. That's when I had it, okay. Yeah, so now, yeah, and I've- made contact with Dr. Khan now, so, and I talked to Khan, I had a video conference with him, I was having some constipation, and that you had to give me a referral to him to get in, so I've seen him and he said, you know, I don't, he said, I don't, you know, you don't need to see, you didn't need to see me until. whatever that would be, 2029. I assume you're okay. Yeah. Let's see, you had a vaccine. You had a COVID, you had a flu. Yep. You had tetanus, you had your shingles vaccine. Yep. So you're good unless, you know, I don't think you need the RSV vaccine, honestly.Yeah, I don't think I'm going to do it. I think you can wait on that. I don't think I'm going to do that. So you're good there. Yeah, and what was the other thing that hurts me that I'm not going to do? Yeah, I think that was, okay, I've done all the vaccines, I think I'm good there. Yeah, no side effects either, but I was having a sore arm, COVID and the flu. November 2nd, I think it's a Monday. So Jason, have you had any surgeries? No, the only, the only, I've had, I've had a few things, I had, I had a A catheter ablation for SVT back in 2014, then I had, I think it's called an angiogram by Dr. Dublin in, I think that was like January or December of 2020, maybe something like that. Yeah, I think that's what it was. And then the only other thing I had was to have that I had that biopsy removed from my bladder in October of last year, and the only thing that had, the only thing that happened weird, and I want to ask you about this, after that bladder biopsy thing, last year, I had, I had like all these spots on my forehead and like my bald spot, and I thought it might be, um. Was that last year or this year? Yeah, that was October of 23, October of 23, and I had all these. You know, these spots, I thought it was a rash, I thought it might have been the cap that they put on my hand or something like that. I actually went to the dermatologist, the dermatologist thought it looked more like bruising than a rash. So I don't know, do they put something on? I asked Dr. Kim about it, he couldn't think what it was, I suppose I couldn't talk to the anesthesiologist, did they put anything on your head to monitor things? Maybe it was the cap, I don't know. But it was, but I had like these blotchy spots. But you weren't under Genil's anesthesia. Yeah. You were just sedated. I was sedated, yeah. But you weren't under Genil. You didn't have a tube down your mouth, right? I don't know.I don't know. I doubt it. I don't know what it's saying. You don't generally put anything on your head. No? Okay. I mean, not that I. Other than the calf, huh? So maybe, I don't know if I was allergic to the anesthesia medicine or, I don't know. It was the weirdest thing. It wasn't anywhere on my body except, except like on my forehead. And, you know, my bald spot, so it seemed maybe it was really the cap, you know, the surgical cap, they did put a surgical cap on my head, but I don't know, I don't know, I don't know. Yeah, no, I don't think I had it. Well, for this surgery, for this prostate thing, I probably will be under general anesthesia. Oh, yeah, yeah, for sure. Yeah. So to determine your risk for surgery, number one, what's your surgery? Number two, have you had surgery before? Number three, what medical conditions do you have? And number four, do you have any new symptoms that are worrisome? You don't have anything really new, right? You've got the leg thing, but there's more like fevers, new shortness of breath, or high schools, nothing worth really worrying about. your chronic conditions in terms of your heart and whatever, Dr. Patel, I don't think there's anything there that they would say, oh no, you're not safe, I'm not sure. Okay, okay. Yeah, and the, you know, I was awake. I was awake for that catheter ablation thing too, I was awake for that. Yeah, so you haven't had any main- And even the angiogram, I was awake for that too, so those, I guess those don't really- qualify as a. No, other than to know, right, other to know that, okay, you had sedation. Yeah. For some of those, you had sedation, you were getting a colonoscopy and. Yeah. I'm not sure about the. Yeah, I've definitely been knocked out for the colonoscopies, and I definitely was knocked out for the bladder biopsy, because I don't, all I remember is going in there, and then the next thing I remember was waking up and- Presumably those were just sedation, not general.Yeah. Well the colonoscopy for sure was just sedation. Okay. I assume that the bladder one, it was sedation. Okay. Okay, so it sounds like, well you got the elbow thing, that's not particularly new, you got the neck thing, probably from position, especially if it's only at night time, and the leg thing, at the moment, sounds- It's more muscular. What does it feel like? What's the nature of the pain? It's, the best way I can describe it is the same sort of pain you get like with shin splints where it's just kind of a. achiness in the, like in the bone area, you know, I mean, it's just an achiness, and it was, that's what the ankle pain started with, the ankle pain, you know, when I came in for the ankle pain, it started, it was just kind of a pain in front of the ankle. And then, then it really went to the ankle, and I remember when you were, you know, when you pressed on it, I practically jumped out of there. No, that part doesn't work. No. So if you, Jason, if you walk on your tiptoes, does that hurt? And if you walk on your heels, is that okay? Yeah, that's fine. And I can walk, you know, it doesn't prevent me from moving. Yeah. You can hear this okay. Yep. Yep. You can move your neck up and down, okay, no problem. Yeah, yeah. Does that hurt? No. And so when you get the pain at night, it's like in here somewhere. Yeah, it's like, it's like right. You know, right down there. Yeah. Does it hurt now? No. Not really, other than the pressure. I'm assuming, Jason, that's just more from whatever position you're in. Yeah. But it doesn't hurt now? No. Okay. No, I mean, when you press on there, I get a feel. It's a little sore. Yeah, a little sore. So this is, these are where, so these muscles insert in your skull there so you can move it up and down. Yeah. So that's often the sore spot. Oh yeah, that's the sore spot, yeah. So I wonder if it, how about there too?No, it's a little more on that side, it's more pain. And I wonder if you notice that more on that side at night, well, so it could be coming from that. Yeah. Okay, hold your breath for 2 seconds. Good. One more time. Good. Okay, just relax. Good. And give me a big breath in and out. One more time. And your breathing is still okay. You do your exercise. You can walk up a flight of stairs and not get short of breath, that kind of thing. Definitely. Okay. We're at a lie back. Okay. The so-called functional capacity. Okay. It's one of the things they use for surgery. Bowels have been? Bowels have been fine. I had a stretch where I was having a lot of constipation and that's when I talked to Dr. Khan. Oh right. And then, you know, I was taking Metamucil pretty regularly. Okay, that's okay now. Yeah, and I've kind of stopped taking the Metamucil in my bowel movements every turn. Okay. Everything's returned kind of to normal. I'm going to take this off. Okay. Oh, you might have done tight. Yeah, it's a little tight. Sorry. That's okay. I'll just do that. It's a little tight. Yeah, maybe these shoes are too tight. There we go. Now if I just push here? No, I mean a little, you know, a little bit of pain on the inside bone where you were pressing. That's okay. Yeah, yeah. Not too bad there. No. Pull your foot up towards you, then pull it out, push it out towards me, like up and out. Oh, up, let's see, up and out. And to your right. Oh, I see, I see. No leg, just no leg. Okay, just the foot. Just your ankle, yeah. Okay. That's okay? Yeah. Any pain there? No. That's okay? Yeah, not a little bit of pain there. When you say in Bali or foot, do you mean there? No, I mean, I mean, up, up more toward the toe. Yeah, that, yeah, that right there. Is that sore now? No, no. Tickle or sore? A little tickle. Okay, that's sore?Just when, you know, yeah, I mean, it's a little sore when you, you know, when you press. And this feels normal? Yeah. Okay, we're going to lift your leg up, just relax. Okay. Tight hamstrings. So your leg doesn't bother you. No, no. And you get it here. Yeah. You said you get it when you move your ankle sometimes. Yeah. This pain somewhere in there. Well, or I just start feeling the pain and then it hurt, you know, it's more prevalent if I, you know, turn it one way or another. Okay. So it's a little hard to say, but when you say that, when you turn, well. when you turn your ankle, you move your foot in, it makes it a little worse. It's sort of suggestive of a muscle tendon thing. Okay. Yeah, it probably is a tendon. I mean, and I almost wonder if it was related to the old ankle thing, because this muscle goes down here. I'm sure, I'm sure that's what it is. And so it could be. Yeah. And I don't know if it's sort of mechanics of walking or exercise and putting more strain on this leg. When you talk about a nerve, and this feels normal to the touch, right? Yeah, yeah. When you talk about nerve then, like a nerve pinching somewhere, so... it could be a nerve can be pinched on your ankle, it could be pinched behind your knee, and of course in your spine is the most common spot. So for example, when I lifted your leg up to put tension on it, it didn't really make it worse, which doesn't prove anything, but. No, I do have tight Achilles every now and then too. In fact, it was funny, for the biopsy, or not, yeah, for the prostate biopsy, you know, they put you on an antibiotic, you've got to take it one day ahead of time, the day of, the day after, and the first one- He's prescribed me was, started with an L, low something. Oh, he's got [inaudible] Yeah, that's exactly what it was. When I picked it up at the pharmacy, there was like a 6-page you know, risk. It's not our first choice, yeah, because of the tendon, yeah.Yeah, and so I told Dr. Kim, I said, you know, I have tight tendons, and I have, you know, I think I have elbow tendonitis in here too, so he ended up, I ended up doing some other antibiotic in lieu of it, you know. I mean, it's rare, but it could be serious at times. Yeah. And I assume this is still this. Yeah, I don't know, do you feel any puffiness? No, that's a little sore. There. Yeah, I see. That's where that tendon thing is. Yeah, yeah. Yeah, at one point it felt like I had a little puffiness. Somewhere in there. Well, I would show you, it was like right in there is where there was puffiness. But now that's gone, too. Yeah, right now it's going up, too. Yeah. So, you know, with the leg, I guess the leg, it just depends on if it's... more bothersome or just are concerned about the cause? You know, it's not, you know, other than when I came in here for when it was really bad, it's definitely not. Not debilitating or anything like that. I mean, so with the leg, you can either do nothing or you could, you know, let's say it's muscle, let's say, okay, then do gentle massage, heat, whatever, stretching it if you want, or you can just do what you're doing. Okay. see what happens. All right, that's right. I don't see any of it, the circulation is good, there's no evidence of blood clot, I don't think it's a nerve thing. Okay. And if it is, where is it coming from? I don't, I'm not behaving like that. Yeah. But obviously it changes, it gets worse or? If, you know, tendons are, you know, all tied in from here to here, that's. That's probably what it is. All right. That's what I think. All right. Well, just got to learn to live with a future. More aches and pains the older we get, I suppose. Unfortunately, I told, I probably told you what my 84-year-old patient said when he died, unfortunately, but. Oh, no. He came in, this was a while ago.Yeah. I said, oh. He was just following up. His name was Tom. Tom, how are you? How's it going? He said, well, I wouldn't give to be 65 again. So then I got to know Tom. Those aches and pains get worse. They creep up on you. Yeah. Yeah. No, it's... Well, and, you know, and I guess the best thing you can do is, you know, try to exercise and walk and do things that keep you nimble and strong. Yeah, no, there's, I think that's definitely true, Jason, is to stay active. Yeah. I'm glad you're doing that. Yeah. You know, you're pretty healthy. You got these things, well obviously the apostate thing, but we're hoping it's going to be something to go through, but you should come out the other end okay. Yeah. Eventually, do people who have that... You know, the prostate surgery, assuming nothing goes wrong, you know, do they eventually get over the incontinence and the, you know, and the, you know, the, or do you, I mean, it depends all your life or something. Well, so in the old days before the robot, it was a big problem to have chronic incontinence. Yeah. And erection issues and so on. Yeah. And then there's a difference between the immediate post-op and it's a little longer. Yeah. Most people long-term don't have a lot of issues with incontinence when you're wearing a nightgown or that. Okay. Obviously he wouldn't tell you that, he wouldn't guarantee that because. Sure, sure he can. It's just less common. Yeah. Yeah. So usually we're cautiously optimistic that you won't have a lot of RISD tool problems. Yeah. I would imagine those for the first few months are a little. But you know, I would, you can sort of pin them down on that, hey, what are the chances? Yeah. In a couple years, I'll be having significant confidence. I mean, I think it's pretty low, but I can't quote you the percent. Yeah, yeah. But it's pretty low. I, you know, I think I've made up my mind that I'm going forward with this. I think Jason, it's reasonable. Yeah.Under your circumstances, I might do the same thing. Yeah. I mean, I probably would do the same thing. Yeah. It's really what I meant to say. Yeah. Yeah, I think so. I think it's the best alternative. It's, um... And Jason, I don't think there's any problem with you having surgery. I don't know if Dr. Kim's going to want me to put in my word, but, you know, heart, I think Green doesn't think there's a problem. Your functional capacity is good. You don't get short of that. You can walk up a flight of stairs, no problem. Yeah. No major lung problems, you're doing the sleep apnea, the CPAP, I don't think the hematologic issues are significant, you know, so there's no reason that you don't expect this to be a totally safe surgery for you. Yeah, yeah, okay. I don't know about the thing on the head, you can mention it to the anesthesiologist. I'm going, I will, I will. It was the weirdest thing. All right. So Jason, we've been setting you up, I think when we do this, we set you up for a yearly and then you come in if you need something. Yes. Should we do that? Yeah, I think so. Yeah, and then if you need some- I mean, what's the alternative? Do you see some people my age more frequently than annually? Only if I'm, say, monitoring their diabetes or I'm a little unclear how their blood pressure is doing. Okay. Otherwise- Yeah, I don't think I'm in that camp, yeah. I don't know. You're good, though, with the urine and everything. I think so. I think so. Yeah, and especially given that, you know, I mean, I imagine I'll continue to see Patel regarding these blood issues. I don't know, maybe eventually I can stop seeing her. Nothing changes. Probably, no. And then, you know, this prostate thing, I've got Dr. Kim on the case, part Dr. Green. Yep. I joke with Patricia, I mean, I think I've seen more doctors in the last year than I have in my prior 62 years of life. I know. Yeah, this happens.","3":"Hi Lisa. Hi, [inaudible] You're, I know we've got multiple things going on, you're having surgery soon, right? Mm-hmm. When is it? May 2nd. May 2nd, and this is the hip? Yes. Are you sick or not sick? I have been sick for today is 11 days. Okay, then I'm not worried. Can I take this off? It's like all on my head and my neck now. 11 days you've been sick? Yeah. Okay. I got it last Tuesday. We didn't have Thanksgiving. I couldn't cook the turkey. Had to throw it away. It only cost me $10 though. I know. But, and now it's a constant tickle and drip. Last night I wet my pants coughing. Okay. But other than that, I'm good. No fevers, no shortness of breath? No. Okay. And your surgery, it's a hip replacement, right? Correct. Right. Right. May 2nd, 24. I hope he doesn't have a hangover. That's right. may not have you going to the, oh, it's Johnson, yeah, okay, Johnson doesn't seem to use the pre-op clinic very much. All right, so got chronic issues, we got your pre-op, we got your wellness exam, and I think you made it to the lab. I did. I don't know, I don't think Johnson wants stupid labs, no. They said they'll order, if they're going to check and if there's duplicates, they're not going to order those. Okay, oh I see, he might order his own labs if it doesn't, if he doesn't have what we want, okay. Yeah. Sometimes I want bleeding tests which aren't indicated, but they're used to their old habits and they sometimes, but I don't know with Johnson what he does. This should be enough, but Yeah. We'll leave it up to you. Is your last hip surgery, what was it, 10 years ago already? It was 2014. Oh, it's not, okay. No trouble during the surgeries, right? Anesthesia, bleeding, nothing? Let's see, Lisa, where to start or where to continue? Let's continue with you.So with this cold, we'll talk about, tell me other questions, other stuff you want to talk about, whatever. You know, I actually don't have any questions. Okay. I've been doing things to help me since I'm older. I had, I don't know if I told you, I had a new shower, Rebath come in and pull out my old huge tub. Okay. I have a walk-in shower now with bars. You got a walk-in, good. And a seat. Excellent. And my car was, it was so low to get in, it killed my hip. I bought a new car February 3rd, I got a Ford Rangers, an SUV. Oh, you're doing it in 2? Yeah. Good. And I'm very careful about what I do. I don't feel limited in any sort of way. I'm happy. Your moods are doing okay? Yeah. Okay. I still do my dog sitting jog every day for 2 hours a day. Every day? Mm-hmm, every weekday. And I do some weekends for her. In August, I'm going to do 15 days and she's going to pay me $1,000, which is wonderful. So you have the one client you work for. And she's a physical therapist with Green Valley Hospital. Oh, gotcha. That's how I met her. Does your sister and husband still live with you? He had to go by ambulance again. The VA sent him. He has PTSD and she rarely gets out of bed, you said? Yeah. But he has another blood clot in his lung, so they're going to keep him on blood thinners forever now. But he's the one that got this and gave it to me. Lisa, are you still smoking about 5 to 10 cigarettes a day? You know what, the last few days I haven't been smoking at all. The last few days? Yeah, but before that probably 5 to 10. Do you ever think about stopping? Do you want to stop? Every day, every day. And yes, I do want to stop. When I saw Dr. Green for my Pap smear, he said want to stop, just call me, I'll order the prescription, and I know you would do the same thing. And you never had any particular medication for smoking cessation, right?When I quit once for 3 years, I did a cold turkey. Cold turkey, so you never had and previously never needed medication to stop? I tried the patch once. A nicotine patch, okay. Yeah. Because I do everything to try and be healthy with my vaccines and everything, and here I am smoking and I'm just. Right, the little, illogical, not logical, I mean. Illogical. I mean, you could, but you could rationalize it, look, I'm doing all this good stuff, so I just have this one bad thing. No. I'm not saying that's right, I'm just saying. No, no. Or, but yes, we would say, gee, you're making all this effort, why can't, let's put the effort into this also. I know. Okay. -C-LISA, let's go back to MyList, and I'm going to just read, oh, I see you had a Pap smear, you don't need a colonoscopy yet, bones, we'll talk about your bones, vaccines, where you had a COVID shot, did you want a flu shot? Well. I had flu at the same time I had the COVID at HealthMart. So you got a flu shot. Uh-huh. That's funny that it didn't come over. It was like it. That's so weird. I can look it up. Oh, wait, wait, wait. I see a COVID shot from October. Did you have one after that? Yeah. In December? Okay. And it was December or January. Okay, so the flu shot and the COVID shot didn't come over from the pharmacy. They usually do. So you had those. You had RSV vaccine. Your tetanus is up to date. Your shingles is up to date. You've had pneumonia shots, so your shots are good. Yeah. And then, of course... Someone is following your breast, I don't know if Dr. Thompson, she's got your, you just did one, okay. Excuse me, one thing we talked about last year, Lisa, and I don't know if you thought about it or did something, but that's this notion of having your advanced directive for health care. Funny you should bring that up, that is the one question. So I bought this thing online, it's called a Knox box.I don't know if you've heard of it, you put everything about you in -ice box. Mm-hmm. So who's ever going to be your, you have all your impact. [inaudible] So I tried to do, is it a health care directive? Mm-hmm. And I got all the way done with it and they wanted money. Who wanted money? The site. So where do I get a health care directive? I'll give you one. I probably gave you one before, but I'll give you one. You can just download it from the internet. Okay. I'm ready. Yeah, you thought it might be one of your friends, could be your, I mean, technically you need a, you need a power of attorney for health care and also for finances, but. Yes. But yes, you want to, in your case, because you don't want it to be one of your sisters, right? Or your sister, so. Yeah, it's going to be my girlfriend, that thinks I'm her mother. -things are, I mean, and I don't know, her medical situation, I don't know if you'll want to have a backup in there too. No, she's perfectly healthy, and her mom and I are really good friends too, so. I see, okay. She's very logical. She's safe, and. Oh, yeah. Safe meaning she's probably, we don't expect anything to happen to her in the next 10 to 20 years. No. Okay. No. So that'll likely be your person. Yeah. Okay, we'll give you -bleguin, so the only, there's different forms out there, this one is okay, it just has to be California compliant, it's a state thing, so it has to be California compliant. The forms aren't the greatest, but they're reasonable. The real question is, Ben, what you want to think about is under what circumstances do I want what treatment? Yeah. Like, I don't think you would Like most people in your situation, like you would say, do everything you can unless it looks futile or helpless or my quality of life will be X and that's what you need to think about. Hey, if I don't have X level of functioning, don't go for it or pull the plug or whatever. Yeah.Those are the kind of things, and then talk to her about it and get it down and whatever. Okay. That's the key. And I... answered those questions on those forms. Okay. I spent a lot of time thinking. So you spent a lot of time, okay, good, good, good, good, good. Because some of the forms will go more in depth, but. Okay, let's see, what else is on, let's go back to my list here. Pre-op, [inaudible] You were having some hearing issues, you were going to see the ENT, I don't know if you ever did that. I haven't made an appointment yet. Okay, not yet. But I know I've lost a little bit of hearing in my right ear. Okay. You said your moods are doing okay, I don't know, you see a psychiatrist? And are you still on the same meds? You were thinking of coming off, but I don't know. No, I'm still on the same meds. Okay, which is? Flexipro. Oh, I see, Lexapro. Trazodone for sleep if I need it, and Ativan, and. Okay. I'm going to, I told him when we spoke the other day, I'm going to start Coming off of them. So you are taking trazodone because someone said, you said you were, oh, it's the dosage was the dosage. Right, I have 100 milligrams, I'm not taking the 50 milligrams. Right, but it's listed as, I mean, you're taking 1 100 or 2 50s? 1 100. Okay, because we have it as 2 50s, which is still 100, that's okay. Okay. We'll just leave it in there. And then- And the semaglutide, so for the diabetes, you're on the semaglutide, you're doing, but we got you on the Wegovy for some reason, because we couldn't get you on the semaglutide, we couldn't get you on the Ozempic? That's what. That's weird. That's what. Okay. You had said to me, no, you want the Wegovy, but it's perfect, then you got the insurance to approve it.Somehow we got it, because you do have diabetes. technically. I guess if there's a nice thing, you're at, you're, okay, so you're on the highest possible dose. And I have a question about that. Yeah. I have to be off of it for 2 weeks before the surgery. It's usually 1 week, but okay. Okay. After the surgery, can I go back to taking the same dosage? Yeah, that's a good question. I was, probably it's worse. Because I want to stock up, meaning I want to get 1 more order, it only cost me $156 this time. I think there's a little risk in being off it and then going back on the same dose in terms of side effects, but I, and I've only had a couple people experience and most of them have been okay, when you go back on the dose you were taking. Yeah, and it's only going to be for 2 weeks. Yeah. When's the surgery? The 2nd? May 2nd. Which is Oh, that's a Thursday. What day do you normally take the? Wednesdays. Okay, so normally you would take it the 1st and the 25th. I take it once a week. Right, so are they saying? So 2 weeks, I'm going to calculate what 2 weeks is before. Right, so. I'm going to go Wednesday, so it's probably the 15th. Oh, Wednesday is the 18th, yeah. Okay, 18 weeks. So you're going to do that one and then not again. And not do any more. Okay, then make sure you start it up right up. Because then, because if you continue on Wednesday, then it'll actually be 3 weeks until you take it again, right? Yeah. If you do Wednesdays. It really does help me. I mean, I've gone down 28. Any side effects? Not now. Okay. So your weight is down. You went to the lab. Your A1c is down to 6.2, I think. 6.2 from a peak of 7.0. Good, and no major side effects? Nope. Okay. My hair is thinning a little bit. You're getting your regular eye examines? Yep.Okay, you're taking your blood pressure med and your cholesterol med? Yep. Every day. We have your, what else we have? Your osteopenia, which is your thinning bones. Your risk is a little higher because of the smoking. I think you're taking vitamin D and some calcium. You know what? I haven't been, but now that you mention that, I need to go to HealthMart today and get a multivitamin. I was thinking of getting Centrum Silver. I don't know what you recommend. But they said on the Wegovy you should be taking a good vitamin too. So certainly that is okay, but in addition to that, you should be taking vitamin D. Vitamin D. Vitamin D3, at least 1,000 units every day. Okay, and it's just vitamin D or vitamin D3? D3, that's the pill form, I don't think you'll see it in any other form, but. probably update your bone density sometime next year. That's our osteopenia. that your fatty liver, your tests were okay. The breast cancer, you're off the tamoxifenol. Mm-hmm. Earlier this year. You're still taking your heartburn medication, I think. Yep. The omeprazole. So I can take the vitamin D3,000 units along with? Yeah, whatever's in the multivitamin, which is probably 400. Is Centrum Silver good? You don't care? It's just a multivitamin for someone over 50, it's fine, you know. I never thought I'd be taking silver. No, I know, I don't know if there's much difference in the different brands, you know what I mean? That's obviously a well-marketed, well-known brand. still take gabapentin? Yeah. And I don't know if I need to, but I still have those nerve things in my legs when I have my knee done, when I have my hip done, I have the same thing, and it does kind of help. Okay, you can go through the surgery, see how you're doing at some point, if you want to try lowering it or stopping, you can see what happens, and then you can always go back on it. But you also, you still have the kind of neuropathy in your feet, you get that numbness and tingling in your feet.Yeah, and the other day, I put on my thong, my flip-flops, and the, you know, the piece of leather there that your toes go around? Mm-hmm. It was around my second toe, not between my first and second, and I didn't know until I looked. I mean, it felt kind of funny, but I don't feel there really well, but I have no problem walking or driving. I think I just have a really light case, and I also get massages, and when I get massages and pedicures and they massage the bottoms of my legs and my feet, I find that it helps when you get those nose ologists open. Yeah. All right, and of course, the other thing we'll do later is the EKG. Yeah. Yeah. We can talk about that, we'll definitely do that. Let's see, and you went to the lab and those were definitely improved all around. Liver tests were normal. Oh, you didn't do your pee test. Oh, I thought I could pee and I couldn't, so I told them that it'll be tomorrow. Do it later, do it later. And they said I have 2 hours to get it there. Oh, bring it in, you mean, I see. Mm-hmm. Okay, so do it when you can. But I have the kit. Okay. that's for your, just monitoring the diabetes. Your other tests are okay. You got this, you know, your hemoglobin is a little bit elevated. It's been like that for about a year, but it's not really, it's sort of been up and down. What causes that? Well, most commonly, well, a lot of things in your case, it might be the smoking. so I had this white blood cell count up and down. It was normal recently. It's just slightly abnormal. The hemoglobin, so normal is 15.9, you were 16.3. Are you concerned about that? Yeah. Okay. I was 17.3, yeah. Is that what it is? No, you're 16.3. Okay. Way back in 2022, briefly, you were 16.3. Okay. Let's see if we go back further. Yeah, so you've been up and down.So with this elevated hemoglobin, it's been sort of up and down over the last few years. Nothing way outside of things. It tends to go like this if we look back. But I'm going back to 2021. If I go back further... So this is not a new issue, it's not a worsening issue. Okay. This sort of elevated hemoglobin. July 10th, 2020, it was 17.1, after that it was 17.5. So you just had this up and down hemoglobin. Honestly, other than my, you know, the normal aches and pains seniors get when they get up in the morning. Mm-hmm. I feel really good. Okay. Other than this darn hip. Yeah, once the hip is fixed, I'm ready to go. Because my stepsister and I want to go to Scotland. Oh, good. Before the hip got bad, were you doing any, you were doing some regular exercise, circuit training and all that. Yeah, I joined Bay Area Gym, and they thought it was the band, the IT band. Initially, when you had, yeah. And so I was working out there, I loved it, and then I fell and broke my wrist. Oh, right. I could, well, I would go back now to the really screw up my hip, so I don't want to do it. No, just wait until. I'm going to wait, but I'd like to join there again, it's an incredible place. And going on to current symptoms, Lisa, so other than the cold, you're not short of breath, no fevers, obviously a little bit of cough. Prior to that, you were doing okay, no chest pain, chest pressure, racing heart, breathing trouble. Nope. Tummy's been okay, no black stools, blood, major pain. No. No, any urine changes? I know you had an infection not too long ago, but. No. Okay, now, no funny rashes? Nope. No new swelling in your legs? You already mentioned your pain issues or lack of. In fact, the swelling in my legs has really stopped. Okay, good. Good. And my ankles, I should say.Let's see, do we have anything, pre-op, arthritis, diabetes, blood pressure, cholesterol, liver, weight, moods, sleep, elevated hemoglobin, your neuropathy, or your heartburn? [inaudible] -steopenia, let's put that on there, osteopenia, osteopenia. Oh, I know what happened since the last time I saw you. Hmm? In February, I got a darn tear in my cornea again and had to go to the ER for them to put the drop in. It was, I don't even know how I made it to the hospital. And then I saw Dr. Patel after. and you said thinks I sleep with my eyes a little bit open, because my sister does. So he told me to start sleeping with a mask, and I have been. That's the only. You said a tear in your. Cornea. Cornea. Like a, yeah. Like a corneal abrasion? Yes. Yeah, corneal abrasion. Who's on your left? Who's on my left? So he said maybe it's because you're sleeping in town, so you're wearing a patch, is that what you said? Wear a sleep mask. A sleep mask. So my sister ordered a couple of the silk sleep masks. That's funny, I'm laughing because my youngest daughter does that, she loves her sleep mask. My sister loves it too, I find sometimes I'm grabbing the back and taking it off, but it's really good if you sleep with your eyes open a little bit, and then he gave me some ointment to put in if I'm not, if I don't have the mask. I haven't used any of them. I have so many appointments, I don't even know what they are. So let's see. planning for the future, but Well, my planning for my future is my estate planning. Got to think about that. I'm doing that now with this. When Alex was dying, I went on OnlineLegalHelp.org. I did everything. House went in the trust. I just have to now amend my trust agreement because one of the trustees has passed away. So I'm working on all of those things. Good. Then with the health care directive. I don't plan on leaving my house anytime soon. It's two stories, but I can still.I'd like to live in time like even 5. get there. My financial guy said I have enough money to last me until I'm 94. And then I started laughing. That's funny. That's a pretty precise. That's weird that he would, he was probably just joking. No, because they run. He's with a lot of [inaudible]. I know, but it's too, it's so precise, because you don't know what, I mean, there's so many. Variables. Yeah, there's so many variables. I know. One's You know, neither of which you can control, your health. Yeah, I know. And the macro economy and what's going to happen with costs of things and investments and all that. I mean, they make these assumptions about, well, you know, in the last 50 years, this is the return, this is what's going to happen. I know. Who knows? Okay, hold- breath for 2 seconds. Good. Longer time here. Give me a big breath in and out. before. You said you don't feel short of breath, right? Not at all. When you're walking around, okay, you're going to put this over here. And I did a lot yesterday. But I bet you, you did, you felt okay. I. Other than the annoying cough. Yeah, I cooked, I did a lot of cooking for the next few days. I had to get the house ready for the housekeeper, she comes today. I always have to clean before she comes. Right, clean before the cleaner comes. That's okay, right? Yeah. Let's get you up. Can you hear? No, barely. Oh, yeah. It's the right side is worse. All right. Okay, Lisa, so she can do the EKG. Mm-hmm. She's going to make you a 6-month and a 12-month appointment. Okay. We will do our labs in 6 months. Okay. So she'll give you that paper to do in 6 months. Just make sure, God forbid, if Dr. Johnson sends you for more labs, that you don't do these 6-month labs. that I am going to give you today. Okay. You know what I mean? I'll tell them don't do any Dr. [inaudible] on the last.That's right, there you go. I'm going to assume we're still doing okay on the Wegovy since you've been on this dose. If you have any trouble before I see you, let me know. But since you've been on this highest dose, we're not making any dose changes at the moment. But yeah, you do want to just stop on that 18th or whatever it is for the Wegovy. Or that will be your last dose. Yes. EKG. So you're going to want to take your top off. Vest open up in front. If you want to cover on top of the blanket, you can do that too. So I'm going to put those there. Okay, so just my top? Just your top. Appears like California advance directive. Oh, thank you There's two main parts. Who's your power of attorney? Your friend I'll go up to you and put a backup The second part is. Does it provide a power of attorney? So yeah, that's what this is. Oh, okay, okay. And then the second part is That's to do with your agent. This is your wishes It's not that detailed, but you can write stuff. Like if, on the thing online, if there's more info, you can write it all in here. Okay. And then there's a bunch of optional stuff. You don't have to fill the optional stuff out if you don't want. It's optional, but they include it in here. Okay. Like even your doctor, it's optional. You don't have to put any of this in here. The only thing. So once I have this and it's all done, who do I give this to? Because a hospital says, do you have a health care directive? So it's your thing. You want to have it. You want it. or you want your friend to have it, but it would be nice to have it in the charge, so we can, you give us a copy, we scan it in. Okay, so I say my doctor has it. Yeah, or you say it's in, yeah, it's scanned into Epic or whatever, yeah. Into what? Epic is this. Oh, Epic, okay, I'll say it's scanned into Epic, okay. And it has to be signed, and then here. Witness.The other key, it has to have 2 witnesses or Notarized. Okay. But this is Florida compliant. Okay. So are we done after this EKG? Yeah. Because I want to talk about this cold. Oh, the cold. And. What's your question? Well. What should I be, I feel like I need to be dried up. See, at night, I'm getting a tickle and all that stuff that's running down. Are you taking anything for it? I have been taking Sudafed, sinus, and allergy. Not behind the counter, just you grabbed it off the shelf. You didn't ask for it behind the counter. I ordered it from Amazon. Yeah, that's not. I'm assuming it's not pseudoephedrine, it's just phenylephrine. Oh, yeah. I'm sure it's phenylephrine, you can't order pseudoephedrine on Amazon. Because what I wanted was the regular red Sudafed. Yeah, so that you have to ask for behind the counter. Okay. So if you want something to dry you out, right, so I'm not worried about medically, but if you want to treat it, you want to dry out your nose, and the things I would try Sudafed can be helpful, but what we're really talking about is pseudoephedrine. Okay. And it's behind the counter. Okay. You have to ask. out, you can either get it by itself or combine with something else. If you combine it with something else, then you get two meds maybe working on your medals, for example. So, it comes combined with all sorts of things. You can get, and it's the D, it can be Mucinex D, Dayquil D, Allegra D. I can get Mucinex. But I mean, what I was going to say is, you don't just like to buy two separate things, right? Because if you can. Yeah. So, what I might do is For example, if you want a combo, get something like Allegra D, because it has the Allegra plus the Sudafed. The Allegra might help dry you out too. Okay. Plus or minus, sometimes what helps with the congestion of a cold, even though it's more for allergies, is something like Flonase. So I'm going to write that down.I think I can get that over the counter now too. Yes, absolutely. Now we get the sense of this. It's the blue one, not the green one. I would do something like this and something like that. Okay, cool. The worst part of this whole thing is my runny nose. I could, I lean down, I. Do those. Okay, cool. Thank you. You're welcome. Very good. Well, unless I have something happen, I guess we'll see in 6 months. You let me know, okay? I will. Thank you, Dr. Cohen. I'm glad you're doing well. Thank you, Sherlock. 23 and 24. Okay. Okay. Why is it on those wounds? I don't know. I don't know, Nanny.","4":"Well, you're not going to be able to do it now anyways, because if I put the referral in now, it'll be like March, April before you get your colonoscopy. But I, if you were my sister or my mother or my wife, I would advise you not to wait on the colonoscopy. They're probably also going to ask to do an endoscopy and look down into your stomach. to make sure that you don't have an ulcer. I understand, and it is America, and I will do anything that you want me to do, but I also like to sleep well at night, and I don't like this to be on my conscience. And so you can make your own decision, but if we wait, we may miss something. and I don't want it to be missed or wait too long because we've already waited and we shouldn't have waited the 2 months. Okay. Once again, if it gets done, it's not going to get done anytime soon. It'll be a lot warmer. Good, that's fine. I love you and I want the best for you. I know. I just had such a horrific experience with the last one, but I just. You'll be happy to know that they don't use as much of the, that you don't have to drink the whole gallon, now it's only a half gallon. You drink a quart the night before and a quart the day of, and that's it, not like we used to do. Well, it wasn't even the drinking part that was bad, it was going to the bathroom. Yeah. You know what you do is you get a TV tray, you bring it to you in the bathroom and put your pillow on top of the TV tray. That's really honestly true. And then hopefully your legs don't go numb from sitting on the toilet for too long. Yeah. The ibuprofen, how much of the ibuprofen are you taking? Anywhere from 3 to 4 a day. So you got to stop taking the ibuprofen. because that could be why you're iron deficient is you might be giving yourself an ulcer in your stomach and you may not even be feeling the pain from the ulcer. That would be my guess right there. That helps me so much. I know it does, dear, but it's. Okay, I'll do what you tell me. But that makes sense why, right? I was trying to take that instead of pain medication. I know you were, but I can't burn a hole through your stomach though. Okay. If we do the endoscopy and your stomach is perfectly clear and clean and pristine and it was like, we don't know why you're iron deficient, then you can go back to the ibuprofen, but it's, we got to protect you. Okay. Because we like you. Thank you. If we didn't like you. I want you to be well, and you have a tendency to put stuff off, and I know why you do, but still. Well, you were, I was living with you when I went through the last one, you know how awful that was. It was not the funnest day. The procedure and everything was no big deal at all, it's the prep. The prep is a lot better than it used to be. I hope so. Have faith, have faith. But I just. I know. I know, and I'm with you in that too, but I just don't want something to happen to you because I did something wrong or I missed something. Well, you're always very thorough, so I wouldn't worry about that. I know, but still, once again, I would still take that Gilton and I like sleeping very well at night, not having to worry that I missed something or did something wrong, you know? Yeah. Okay, so we'll do your blood work, we'll stop the ibuprofen, and I think There is a new rheumatologist coming to town supposedly in September if I haven't told you that already. Oh, who's that? Oh, I don't remember his name, but he's from Salt Lake. He'll be moving here. So he'll be seeing patients Monday through Thursday there along with Kirk and Paul. Oh. So you'll have the whole -kit and caboodle over there. Good, good. Well, this medication seems to be doing really well, so. Which is good. Stress levels doing okay, other than me stressing you out just now. Yeah. And you, did you, do you get your Prolia down, did you get it downstairs, and rheumatology? They were going to do it when I saw them at the office. Yeah, that's perfect, I just wanted to make sure, okay. All right, did you have any other questions or concerns or? No, now I'm just concerned because I have to. Don't be concerned. We'll do it together. We'll be colonoscopy buddies. know my dear. So I will see you back in 3 months, so sometime in December, December, around the 13th-ish. So should I just get my CBC done today? Do I need anything else? Yes, well, CBC and the iron panel, and I ordered both of those for you too already. Okay. And they'll come to me. Good. And then if we see you back the first of the month of December, then we'll keep, we can keep, that will keep a good pattern for the refills. Okay. All right, let's go get your blood done.","5":"but I can hear you from here. Yeah. Yeah. When did she start getting sick? Probably like yesterday afternoon. Yeah. I picked her up from daycare and she was kind of wheezing then and coughing a bunch. Yeah. She coughed a lot last night and then he was taking her to daycare this morning and decided not to. Yeah. Well, so yeah, last night by the time I was putting her down, she had this kind of loose congestion. You really hear it a lot. Yeah. And then kind of got some of it cleared before she went to bed, so. Yeah. She slept okay. Yeah. But then this morning, woke up really congested and like the same kind of loose chest congestion, but also had the wheeziness. Yeah. You can hear it in and out. Yeah. Kind of the high-pitched whistle. Yeah. And coughing all night like that. Yeah. And runny nose. Yeah, runny nose. Yeah. Her eyes are still kind of watery. Yeah. And then this morning, just pretty lethargic and everything. I took her temperature whenever she got up and was 98.6. Yeah. So pretty normal, but just figured it was better for her not to be around the other kids today. Yeah. And then she ate like normal, but did take like a two and a half hour nap this morning, which is unusual. Yeah. So she's definitely not feeling more right. Yeah. And no vomiting or diarrhea. No. I mean normal stools. Yeah. Yeah. And is she drinking her bottles like normal? Yeah. Yeah. Okay. And ate like two eggs this morning in between bottles and then had cheese a lot. She's a tank. Yeah. She's a tank. And some ground turkey, green beans, and an ice lunch. She's funny. Huh? Is that funny? Did they say anything in daycare about what's going around or anything? No. Didn't say anything about RSV? No. No, there was one case in the classroom over Christmas break, but we weren't there. Yeah. So. Okay. Did she get the RSV shot? Yes. Yeah, she did. Okay. And the flu. Yeah. Okay. Yeah, she got both. Yeah. Good. And then, has she seemed like she's short of breath at all, or just that raspy? Just raspy. Yeah. Yeah. I mean. Yeah. Yeah. I would say no. Hi. Hi. What you doing? What you doing? Can we look at you? Huh? What you think? All right, let me have a look at her and then I can discuss more of what to do and everything. Oh, she's sitting so nicely, huh? Yeah, she's trying to crawl and stand up too, so. Mm-hmm. It's a really fun. This morning she did fall over backwards a couple times, which is unusual for her, so. Just listen to whatever they're saying. Can you feel her left nose? No, not really. Yeah. Yeah. I mean, if they were big, then I would. Yeah. They're not too big. Okay. I was just curious with everything else there. Oh, you can't? Oh, it's okay, baby. It's okay. It's okay. Oh. I know. She's definitely lost her voice. Yeah. So that's as much noise as she can make. Yeah. It's okay, pumpkin. You're okay. You're fine. Hey, you're okay. She's been having a little bit of diaper rash, so we've just been putting Desitin on her. Yeah. Yeah. Oh, baby, listen to your voice. It's okay, we can have a quick. Yeah, that was one of the main things this morning. She's normally very talkative in the mornings, and she just couldn't hold noise, so. Yeah, I think it was a good call to keep her out of the day here. Good, [inaudible]. It's okay, you want to sip it, mommy? There you go. Just because she probably doesn't feel great. Yeah. Yeah. Even without a fever, I'm sure she doesn't feel good. Yeah. Can I just look you in the ears? Yeah, it wasn't nice, huh? A lot of kids, once they can sit like that, it's like, don't knock me down. Yeah, she's kind of like that too. I'm just going to look you in the ear. That's it. I can't get in there. So I'll tell you a little bit about what you're hearing and what the potential causes are. Sure. What she has is bronchiolitis. Okay. And bronchiolitis is kind of like the small airways of your lungs, and it gets inflamed and irritated and lots of mucus production, and you do get a little bit of bronchospasm. So that's why you hear a little bit of a wheezing. The good thing about it is she's got no signs of respiratory distress or like difficulty breathing or anything. And the signs that we look for is like flaring of your nostrils when you breathe, breathing fast, sucking in between your ribs, using your stomach muscles and your neck muscles to breathe. Typically during the day you're pretty comfortable and it gets a little bit worse at night time. Yeah. And so the causes of this, probably the most common one is RSV. Less likely with her having the shot and probably having the shot will also help her not get like complications or like let it get really that bad. You can still get it, but you don't get it as bad. Mm-hmm. And then there are other things like human metapneumovirus can do it, parainfluenza can do it. So parainfluenza is quite common, especially when you have the loss of your voice. So that could be like one of the viruses. Whatever virus it is, the treatment is humidifier, saline in her nose, suction her out if you have to. Suctioning with a bulb syringe is usually a two-person job at this age because she will not be happy. Yeah. And if there's nothing to see to suction out, just do like a saline spray. Okay. I don't know if you have one of those at home. Yeah, we've got like a little pan saline spray. Yeah, perfect, yeah. And the saline sprays actually have been shown to decrease the illness by an average of 2 days. Oh, wow. So it actually does make a difference. And then there is a test for RSV, so we could do the test. I always like to tell parents, like, I like to do a test, so then I'm going to do something about it afterwards. The value of it's going to be, okay, so we're dealing with RSV and not parainfluenza, or we can tell the daycare that she's got RSV and tell other parents this, but it doesn't make any difference to the treatment. Yeah. Okay. Let's say, like, the kids who do get respiratory distress, when they go to the hospital for it, they get, like, supplemental oxygen if you need it. Yeah. They get deep suction, so they take a suction thing and go all the way down and just get all that mucus out. It's basically supportive care, but really nothing much else. So hopefully you won't need to do that. I would only go if she's like not able to eat or she's got clearly like difficulty breathing. The other things we often get asked about is albuterol, like a nebulizer. Yeah. And they actually say not to use them because it doesn't make any difference. And sometimes all you get is the side effects. So she's shaking and high heart rate and it's not doing anything else and she feels terrible anyway. So now we just made you feel worse. So, but yeah, that's really the options. If you want us to do a run a RSV, we can, but it's not going to help me much from that perspective. I'm pretty indifferent on it. I know. Because it doesn't. You tell me what to do. I would say not to do it. Okay. Because I think it'll be negative with all of her preventative stuff, and I think it's probably parainfluenza that's causing the whole thing. Yeah. Okay. The other thing that you might hear of is like, oh, she's wheezing and she's got no voice and everything, so why don't they give her steroids? Steroids kind of suppress your immune system a little bit, and if she had respiratory distress, yes, I would want to maybe do a steroid just to help her out with the swelling, but it turns off your growth centers for about a month. It's like, you know, it's too much. Okay. Yeah, it's not just a cough medicine. Yeah. Yeah, so that's what I would do, and then as far as like complications of this, The most common complication would be an ear infection, and it's usually about day 7 to 10 after something like this. Okay. So if you think, oh, we're doing great, she's out of the woods, and all of a sudden, she wakes up in the middle of the night screaming, fever back, it's probably ears. Okay. And then, just come back in, back the next day, or. Actually, one of my patients said it's like, oh, it was awesome. We were up at like 1:00 in the morning. Kid was crying and whatever. I went on the portal and I made the appointment for 8:30. It was like, oh, that's kind of nice. Yeah? Yeah. And think about that. And actually, what you're doing now with her chest like that, like just kind of tapping and everything, it's called chest percussion. You kind of cup your hand like this. It helps her move the mucus. Oh, okay. Yeah, so that's a good thing, you see? Natural instinct. Yeah, but that's all I would do at this point. Okay. Ibuprofen might work better than Tylenol just because it's an anti-inflammatory and a lot of the problem she's having is inflammation. Yeah. Okay. Would you recommend giving her some or just? Yeah, especially before bedtime tonight. Okay. Ibuprofen. Yeah. Okay. Yeah. Not Tylenol. Yeah. We don't have ibuprofen, we'll look at some. Yeah. I wish, they haven't sampled us like since pre-pandemic. I wish they would. Yeah. Oh well. Yeah. That's easy enough to get. Yeah. Yeah. All right. Good. Thank you. Well, hopefully she gets better and. Hopefully know your impressions. Yes. Yeah. The typical course of this is like she'll be pretty like miserable for 3 days, 5 days at the most. Oh, yeah? And then it's like the cough will usually go away after about 2 weeks. Okay. So, hopefully we will not see any. She has like a general baseline kennel cough from daycare, so. Yeah, from daycare. The joys. Oh, yes. Yeah. Seriously, the good thing is though that research is very clear on it. The kids who go through all of this and go to daycare early, by the time they're 5 or 6, they never miss a day of school. It's like, they're good. They've seen it all. That's our goal. Okay. Okay. All right, Munchkin. Humidifier and keeper hydrate. Yeah. Okay. Yeah. Yeah. Yeah, I'm not saying. All right. You feel better. Thank you. Sorry, I had laid you down. It's like, wrong move. All right, see you later. Bye. Bye. You're welcome.","6":"Left knee, what's going on? Well, it's my right knee, see that? It's your right knee? Yeah. That's even different, okay. It did that, and then now it's doing it again, but it was huge. I need to take your leg out of this. I know. I'm sorry. Yeah, I know, I put, and I thought I was going to put those on. Okay. But now it's not too bad right now, but that was bad. It almost looks like you have bursitis around it. Something weird, but it's like this, it's, depending on how long I stand up, you know? It's not too bad right now, but when it was. But this all, this is [inaudible] Yes, yeah, and then it gets whoo, like that. That's fluid buildup. Right. When did this start? I don't know, it's. I'm sorry, I'm just trying to [inaudible] No, it's October 12th. Actually, and that picture was really good, thank you. Uh-huh. Yeah, it was really bad then, it kind of hurt, it's. It's all fluid. Yeah. GPS said it lost. Yeah, and usually it just kind of swells up in the back sometimes, you know? But it could be, but that could also be coming from the back to the front. If there's no extra room for the back for the fluid to go, it will come to the front. Okay, yeah, that was the first time I ever did that and I was like, holy crap. Yeah, you're going to have to see it work though. I mean, that's pretty much. That's not good, huh? Oh, no, nothing, not good, but I just. Okay, so the other thing was. I need to get an x-ray on this too. I took an x-ray recently. Oh, okay, let me take a look. I think, but. Okay, let me take a look, I'm not seeing any. I think it was that right leg, but I'm not sure. And then I did change it in the chart, you said left, and went down. No. [inaudible] Well, the left again. Oh, no, I did put right knee, because I think, what is wrong with, okay, you know what? I'm not even going to ask me anymore. Okay, I did write down right knee. Okay. Now let me see if there was an x-ray done. -that something. The reason why we need an x-ray, you did get one, and why did you get one, this is a 07\/29\/24, so in like July? Yeah, because it was just aching and swelling. But it wasn't a swelling like now? Not in the front like this, never in the front. Okay, gotcha, okay. This is a. Okay, so it's actually taken a turn for the worse. Yes. Yes, and it's painful now, like, you know, like. And you did have, you did have super, this is a [inaudible] kneecap. Okay. Like [inaudible]. Oh, I did have some, a little bit? Fluid, joint effusion, you had fluid. Oh, is that my x-ray? Yeah, this is your super, this is the. Oh, where the diagravex is really faking it because I don't have the glasses on. So it's mild right suprapatellar joint effusion. What does that mean? -fluid, just what [inaudible]. Oh, it's like, whoa. So, effusion is fluid. She's so sweet. And suprapatellar means in front of the knee. Yeah. So, I mean, it's basically what you showed me, but it seems like it's a lot worse. Yeah, when was that? This was, oh, 3. Oh, in March. Oh, yeah, it got a lot worse. So, what I'm going to do based upon that, I'm going to order an MRI, because an MRI gives us a lot, it is like a road map to [inaudible] knee, it gives me a lot more information. Okay. And so that's basically what we need. Yeah. Because when I refer you on, [inaudible] I can't get that off the ground barely, you know what I mean? And I need to figure out. And I can't put it on the ground. Oh, no, you can't, no, I wouldn't even try right now. Okay, yeah, okay, I was wondering. Now, I do have a really good knee person, but they're in Walnut Creek. That would be okay if you really like them. Yeah. I really like you. Actually, I'll let you know, it's a 2-ygo too. Cool, thank you. Although they have, they must inject it, I just have to, I'm supposed to go for knee surgery, I haven't done that yet, but. My sister did, she's so happy she did. Yeah, I'm, everybody seems really happy, and I was so happy I found her, and then somebody was not happy, and I'm like, no. Oh, no, don't go with the happy, go with the happy people. No, it's just the person was, and I'm like, well, I think we're getting to the point of where it's not even making a lot. Is San Ramon better? It might be further away. No, at 1 it takes time. Okay, no, just, I just, she's in. three different locations, so. This is her main place, so it looks like, right? I think this is the right person for you to see. Let me order your MRI, because that's important. I have one more weird thing to tell you. Okay, let me just, I just want to give you some. I'm not going to, I'm going to let you finish this. Because I'm old now, so if I get. Oh no. I can only do 1 thing at a time now. Oh yes. I used to be able to do 2 and a half, and then it was 2, and now I'm like, no, now just 1. Otherwise, I'm like, what? Isn't that amazing? What am I doing? I couldn't remember who I was seeing when I came in today, okay? That's not cool. Yep, no, it sounds like me. You guys are in motion. I was just like, Dr.  [inaudible] Yeah, one of those people. [inaudible] So because I'm asking you to get an MRI, I'm going to put this down as urgent, although it's not urgent, it's not life-threatening. Right. But I am going to put that in there. Thank you, okay. Okay, so. Now, do I do that before I see the doctor then? Or does that [inaudible]. No, just get in to see her. Oh, okay. Would she like this information beforehand? Yes, but don't postpone it based upon that. Okay. My thing is get in to see her. Okay. And she can always see, oh, it's scheduled. Okay, well, we're doing the best we can. We'll get it done as much as we can, but. Should I just continue to ice it when it's really fluid? No, no. No, don't ice it? No. No, you can continue to ice it. Yeah, oh, okay. Because that decreases the fluid buildup. Yeah, a little, yeah. I don't know what's causing the fluid. Yeah. I don't know if it's bursitis, if it's inflammation of the joint, the lining around it. Is it coming from a Baker's cyst from the back of your knee? So I don't know what is happening. But we need all this information. Yeah, this is mild compared to what it usually is. Yeah, no, no, we need to figure it out though. This is not okay. Okay, so I've done that, so there's one other thing you wanted to talk to me about? Yeah. Okay. Okay, so this has to do with my We went on a weekend trip to Yosemite, and it was a long weekend, and I was extremely tired. We got home Monday, but then Tuesday, well, Monday night, I got this weird thing where when my eyes were open, I had the spins. Mm-hmm. And I mean, I wasn't drinking or anything, I just had the spins, yeah. And you were lying down? Lying down, standing up, anything, yeah. And were the spinning [inaudible] migraines? But I used to get migraines. [inaudible] migraine. Okay, it was to the right. To the right? I believe it was to the right, yeah. But then I've had it once before when it was just like half a click, half a click in my eyes like that. I've had it one other time, but this time it was complete spins like, and nausea. What does that mean? It's probably crystals in your ear. Oh. Okay, so if you can. That's right. So this appointment's only 15 minutes. I know, that's fine, I can make another appointment. [Inaudible] So I need you to put your, I need you to put your neck here, actually your head is touching the table. I'm doing it with you to the left. Yes, okay, hold on, okay. Up your legs. You need to bend your knees. I can do that. Is that okay? Yeah, you're fine. Okay, so are you feeling dizzy? A little bit, yes. Okay, which, where's the room feeling? Like this. Okay. Do you trust me that you're not going to go anywhere? Yeah. Okay. I'm going to have you bring your head towards me. Your eyes? My eyes, I just want to see them open. Open. Go back to center. Okay, I got you, you're not going anywhere. You're not going anywhere. Okay, you're not going anywhere. It's like you're falling out. I know, but I just wanted, that's why I had to hold people up. You're okay. Thank you. I'm holding you, I'm holding you. Oh, you're okay, you're not going anywhere. Okay. You're not going anywhere. It's not a good feeling. I know, I know, that's why I wait until you're stable. Okay, I'm good. Are you sure? GPS signal lost. Okay, all right. Thank you. So you have benign proximal positional vertigo. What the heck is that? Yeah. Basically, crystals are in your inner ear, and they're moving, and it makes you feel like you are moving. It's almost like severe. Vertigo? No, severe, what do you call it when you're on a ship and you have. Right. But it's. It's crazy, I couldn't barely walk. Yeah, no, and it's nothing for me. And I wanted to throw up. Oh, yeah, because of the, you know. Yeah. I had to shut my eyes and make, hold onto the bed, and it was like. Oh no, it's terrible. Oh, it's terrible, yeah, yeah, and it's, I've got the residue, but when it was going on Monday, it was like 24 hours of horrible. Yeah, there's a treatment that you can do for yourself, so I'm going to see if I can get you that information. So is this common? Actually it is. Okay, good. Yeah, I was thinking I had a brain tumor or something. No. It was pretty scary. No, the room does spin. It's spinning, oh no, it's going around like you're in a merry-go-round. I'm not trying to say it's like nothing. And it's fast, too. Yeah, I don't want to say, oh, I don't know what you're doing, it's not a big to do. Oh, yeah, it's a spinner. It is really crazy. So basically, I'll give this to you. I know. You want to sit, you can sit here. And so basically. They're just fine after. So this is your outer ear, this is your middle ear, and this is your inner ear. I know I see this if I cut into you or MRI or CTs get in your brain, and I don't plan to do that today. But do you see these, the snail? I call them the snail. Do you see that? It's hard, this is pretty. Can you get my crystals in there? There's 3, these? There's a line here, there's a line up here, and there's a line here. That tells you in your, gives your information to your brain about your three-dimensional position in space. Okay? So these semicircle canals, that's giving, this is giving the information to my brain that I'm not moving, that I'm sitting, and I'm moving forward, yet it's sending messages where I am. which is really important. Mm-hmm. And sometimes you get crystals in here, so instead of these tubes clearing out, the fluid moving, it gets stuck in there. It's almost like a level inside your ear. Uh-huh, and so your body's like, what the heck? And you get nauseous, and you feel your fingers spinning because this is not stabilizing. I'm going to go to the ER almost, that's how bad it was. Oh, it can be really scary, so I'm not trying to say it's nothing. No, I'm glad you knew exactly what it was, because that's exactly what it was. I mean, it's, yeah. But you feel like. I love the things that they suggest. Pelvic collapse, like what the hell has that got anything to do with anything? Yeah, it was so, it was horrible. So. I didn't know if it was from going to Yosemite or the elevation. No, it's in here. It's in here. How do you get those crystals? I could go all these times. Why do you get the, the crystals I think are pretty common. Unfortunately, sometimes they get stuck, and that's the ear shift. Okay. So for you, they just got stuck. And so they call the Epley maneuvers. And athlete maneuvers are kind of similar to what I just did for you. Oh, really? Put your head. You put your head back. Yeah. And then you turn your head and you have to let it sit there like for literally 30 seconds. Okay. Because you're trying to, basically you're trying to shake the crystal a little. The crystal, yes. Then you bring it back. You will be. Yeah, a little bit. But actually, the more you do it, the better off it is, which seems crazy, but it's scary. So how often should I do that? You could probably do it four times a day, as much as you can. Okay, no, I will, because it was very. You might want to do it with somebody else in the house, because, you know, when you're like, oh my God. Yeah, it does feel like you're falling off the face of the earth or something, you know what I mean? Yeah, it is. It's like the whole space, the whole thing's going crazy. Pretty frightening, I was scared. Is that what happened the first time too when it was going to, oh, thank God. So these are the, so you can look up the Epley maneuvers and I. Okay, so we're going to write that down probably. Oh yeah. Perfect, Epley, thank you. And actually you can go online and you can actually look at people doing this so you can see what it looks like. This was helpful. Wonderful. Well, this is, I wouldn't know if I would get all the way up, but you can see the person lying down, and then they're just, basically, they're trying to maneuver that, those crystals out. Yeah, I just got in bed, I couldn't even get up. No, yeah. I was like, so, I mean. No, it's scary. Yeah. I was just, I got, you know. Oh, here's a better picture, this is a video on the phone. Oh, okay. -ally only with head movement does fluid within the inner ear also move, informing the brain that a head turn occurred. However, should a crystal called an otolith gets displaced into the posterior canal of the inner ear, the PPV dizziness occurs. Fluid movement occurs due to the crystal rather than head turns, causing the brain to think movement has occurred, even though none has occurred. And your eyes were doing this. Were they? Oh my God, I'm so sorry. Oh my God, I'm so sorry. I didn't even want to tell you, I thought it was horrible. I didn't even want to tell you. degree to the other side for another 30 to 60 seconds. The head is then further rotated another 90 degrees, accomplished by [inaudible]. Oh my God. Which is then held for another 30 to 60 seconds. At this point, the head should be turned 45 degrees from the horizontal. While performing this maneuver, another individual can help with these position changes. The maneuver is then completed by having the clinician sit up. So what's going on with these position changes? Essentially, the head is moved in such a way to manipulate the crystal to fall towards the canal opening. With each position change, it takes about 30 to 60 seconds for the crystal to settle. [Inaudible] You have to stay in that position. If turns are made before the crystal has a chance to settle, the crystal may fall back the wrong way and the maneuver will fail. Okay. It's also important that the head positions are angled correctly or else the crystal will not settle to the correct position in the canal and the maneuver will fail. Also, if the position changes are done too slowly, the crystal may not settle quickly enough from lack of momentum and the maneuver will also fail. Once the crystal falls out of the canal, the dizziness should resolve if due to posterior canal BPPV. God bless you, thank you so much. I thought I was dying. Thank you. Oh my gosh, I'm so happy. And you can just look up the [inaudible]. Yeah, [inaudible] But I will put that, I will put the [inaudible] over in [inaudible] That is so nice to know, that's just, that's it. Oh. And you're not crazy. Oh yeah, it was not a good thing. No, it's been, it's very frightening. Oh yeah. It's very, very, very frightening. So I don't want you to think that [inaudible] No, I mean, I was pretty locked down the hallway, I was just, ah. And I kept saying, I'm going to have to go to the hospital, just leave me alone, I've got to go back to bed. It's scary. I was in bed for like 24 hours, just, yeah, really scary. And then through to say, no, it's nothing, don't worry about it, wonder what you're going to go through. No, I'm so glad that you said that. Oh my God, I didn't want to tell you, I was like, should I tell her? I don't think I can handle this. Well, it's terrifying. It was terrifying. Oh boy, I will testify, it was terrifying. I thought. Can you tell me if there's something wrong? It must be something, I have a sort of brain tumor. Oh, yeah. It is going around my head. Oh, yeah, I thought, yes, something popped, I had a stroke, it's, this is part of a stroke. Oh, my God. Oh, my God. That music was about to make me stroke, but that's, no, I'm kidding. Actually, I like that, that it's like, could you go a little faster? It's like, okay, that is really about to","7":"hot, you know, once we, so I stopped about 2 weeks ago. Good to see you, yeah. So we'll see how it's going to, I don't know when my last, I think we hadn't had physical for a very long time, it's like [inaudible] delaying it and canceling it, because I was. Yeah, I think we got labs done, we should really get blood work probably done too. I know, but the thing is, I probably not this time, I'm leaving in, also in a week. Okay. For Singapore, so, but I would probably come back in the summer or something, yeah. Yeah, and actually that will be a good estimate because. Yeah. Then that will give us 3 months of being off the birth control. Maybe you just subscribe and then I come back and I could just do it whenever, you know, so I don't have to email you again. So also, thanks for the mammogram thing, and their time right now is in March, so I think I have to also come back and do it. Oh, really? Yeah, because I call them and they're like, no, you know, March is our, I'm like, I'm going to leave in a week, it's not going to happen. Yeah. time, so. How about you? I mean, it seems like you've been pretty busy, you have a leave, right? So I guess. Wait, what? Did you take a leave? I mean, I've gone on vacation a little bit. Okay, all right. Well, then that's fine. But no major leave. Okay, well, because you just had a child, right? Yeah, there's two of them. Because I thought you have a fraternity or something. Oh yeah, that's true. Probably the last time we saw each other, I did go on leave. It's a long time ago. So I came here usually with a tool, but you and I haven't had a physical with you in a long time. Not for a long time. So, yeah, so that's the only change that I just took that off and see how, you know, go to the next blood work and see how, if it's going to work out. And you might find that maybe you need to be on it like half the year. Okay. Like just not to lose too much blood. Okay. And like if you kind of, if it's important for you. Right now it's actually not very heavy. Yeah, so that's perfect. Yeah, I just had, I just had one. And it's regular, it's not heavy at all. I mean, you could consider taking like an iron pill once a week now. Yes, yeah. Because you stopped that for a bit, right? I actually totally stopped. Yeah. Because you told me that since I'm not, you know, bleeding. Exactly. And my blood work last time was back to normal. Improving. Yeah. But we should definitely do the blood work again. Yeah. To make sure it's not. Okay, then you. Because I think that last time the mammogram shows that I should just go back to the normal one. Yeah. Because, you know, back then they were, they watched it for 3 years on my, a little lung, and they said it's benign, so they said just go back to normal mammogram. Yep. That's the one that you prescribed. That's the one I prescribed, it's a regular screening mammogram. Okay. Yeah, because those are like pretty much all your major issues. Yeah. that's the only thing. What about colon cancer screening? No, I have not had that. Do you recommend one? Yeah, I mean, you're, I would recommend. Okay. Is there one that without, because I think that the, they said the full scale one is pretty painful and you have to do a lot of. Well. Is there one that if you don't have the history, it's like what my husband was doing. Like the stool test? Yeah, something like that, I mean. So a stool test is less accurate. Okay. But then you don't have to, the hardest part about colonoscopy, even though the procedure seems uncomfortable, you take like, you're in twilight and it's usually not painful at all. Okay. The hardest part is doing the diet, taking the laxative. The day before, right? The day before. Yeah, you have to have it in a while. And having to poop all the time. Yeah. So that's the part that really, and it basically takes like a day of your life to do it. So, but if it's totally normal, there's, you're basically clear for 10 years. Oh, really? Okay. Versus. Because I was thinking about every year, I'm like, well, that's a, unless you have a history, right? Or if when they do it, they find a Some suspicious things. Okay. So I mean, you could do that. I generally do recommend that for people who are young to kind of get baseline colonoscopy. Okay, I have never had it. However, if you, this year, is just like busy, you could just do a stool test. Okay. What do you think? Well, like I said, I'm going to have to maybe email you when I come back. Yeah. You know? Well, I mean, I can order the things now. Because I'm leaving next week. But even with the colonoscopy, you probably wouldn't be able to do it until June anyways. Yeah, that's what I'm thinking. So you could just schedule it to do it when you get back. Yeah, instead of just do both, I'll just do the full. The colonoscopy? The colonoscopy when I'm back. When you're back. I think that's a good idea. Then you don't have to worry about getting the stool tests every year. Yeah. Because if you. If it's once every 10 years, unless there's issues. Yeah. Which if there is issues, you obviously would [inaudible] Yeah. But hopefully there's not, obviously. Okay, so colonoscopy, what about Pap smears? I think I've done it once. When was that? That's when I was, still had Dr. Thompson, because she retired, or she, she's no longer, I think she's not retired. So I Remember last time I was telling, you know, I'm going to have to get my, another, you know. Pap smear. Yeah, I'm going to, no, I'm going to actually get another doctor. Oh, another. A gynecologist. Gynecologist. Yeah. Do you have an idea who you're going to get? No. Yeah, because they kind of gave me some names, but I think I have, you have someone to recommend? Yeah, if you're okay with going to Orinda, I really like Dr. Rivera. And Orinda? Yeah, but here, yeah, I don't really love the gynecologists that come here. Okay. Oh, actually, there is a new male gynecologist that people like, but he's also a male gynecologist. Okay. No, Norvinda's fine, I mean, once every year. We're less than that, even. Yeah. Because if your Pap smear is normal, it's every 3 to 5 years. Okay. I mean, yeah. I had one probably about 5 years ago. I see it, yeah, so you're just due now. Yeah. So let's get you connected. You don't actually need a referral for me for gynecology, but I'll give you one just so you know the name. Okay, do I have that contact number? Yeah. If I call them. But you, like a gynecologist is kind of like an extension of primary care. Yeah. So you don't really need like a referral or anything. Okay. And then how about exercise? How's that been? I'm actually doing regular, especially when I'm in -singapore. Okay. Here, when I come back, you know, when you have a schedule, like you, when you're off to travel So hopefully once I go back there, the exercise team is going to visit, you know, holidays and all that. Are you guys, you guys are in Singapore more, almost more than? Yeah, so we're pretty much partially moving there, we're not just traveling. So I think that's the plan, at least for Lin, and I have, I'm consulting over there too, so I have my thing. So this time I'm going to go there first, and Lin had to teach, so he's going to stay for longer. But yeah, I mean, we're both going to be there for quite a long, so we will have doctors over there. Yeah, okay. We'll have 2 sets of doctors, especially 2 ESTs. You could consider just getting your Pap smear while you're in Singapore. Yeah, I could do that too. Yeah. I could do that, I would let you know if I actually get it over there. You definitely don't need to get 2 of them, so. Right. But, and if I show them the, if I show you guys the data and it's normal, then it's fine. Yeah, of course. Or have you got the colonoscopy while you're there? Yeah, I was thinking, because I'm going to say they're long-term. Here it's very hard to schedule once I come back. Yeah, it sounds like in Singapore they are pretty easy to get things done. Oh yeah, right away almost. Here you have to wait for like a month. Yeah, it's crazy, yeah. I mean, a lot of my patients just go, like when, if they live in 2 different places, like China or Thailand, they'll just get everything done there and then bring the results back. A 2 gets, you know, all his CTs like within 3 days. It was crazy. So over there, and it doesn't cost much either. No. So. Even when you pay out of pocket, right? Without insurance. Yeah, no, they'll, no, they, yeah, they pretty much all out of pocket. Even out of pocket, it's. completely affordable. It's so crazy. It's not like here. Yeah, like, I think a lot of things there, it's like, even the copay here is more expensive than paying for it. Yeah, than full, yeah, full payment over there. It's really a scam, I mean, America, it helps us go. They make it a commodity, unfortunately, here, so. Yeah, rather than like a necessity, which it is a necessity. So what else we need to talk about? So let's see, so we, let's order, I haven't ordered blood work, so let me order that. So basically blood work would be, and the good thing, if I, everything I order, you could print out. So when you go there, you could say like, well, I want to get this in Singapore. But you'll see your doctor and they will help with that too. So you order a Pac-Stay too? Oh. You can't really order a house moving. Okay, I'm going to see a gynecologist. Yeah. To order, okay. Yeah, you would have to see one day. So if you recommend one, then I would see if I could call before I come back. Yeah, that would be ideal. Because that would be a long-distance call. Even call them to make an appointment before I come back. Because once I come back, I'll probably stay a short time. So, you know, when I come back and call, usually I won't make any other. Do you guys come back just to, like, do your visa? Or why do you guys even come back? Because Omar still has not like fully retired, so he's still 50 to 70% here, so he still has to teach every now and then. But me, I mean, I had to just come back and take care of some of the things in the house and all that thing, and pay a visit to my folks because they were getting old. Because they live here. They live in New York. They live in New York. So, yeah. Oh, yeah. So, I just came back. Like I said, I mean, even I came back here, I was still in trouble. You're traveling a lot. Yeah, a lot. You know, one thing you should consider after 50 is recommend to get updated pneumonia shot. That's another thing. So, we could, it could give you that. Or, and flu shot. You haven't got your flu shot this year. Have you? No, I have not. I have, I got the COVID shot. COVID booster. Yeah. Do you want your flu or pneumonia shot today? Is it going to be painful? Because I'm going to be in trouble soon. It's not going to be painful, but you could have like a mild flu-like symptoms for the next 24 hours. Okay. 20,000 might be okay. Yeah. Because I'm leaving on Tuesday. Yeah, I think, I would recommend it because I mean you're traveling. Okay. Which there's lots of flu going around right now. Okay. So actually would be good for Tuesday to get it now. Okay. Yeah, because I don't want that to be doing [inaudible]. Yeah, no, so yeah, let's, if you're okay, let's do it now then. Okay. And we'll do the [inaudible] And that's just 1 time until you're 65. Okay. That's like after 50 kind of shots. Yeah. Like the shingles. You got the shingles already, right? I hope so. I think that I got the second one. It says- It says that you have, so. Yeah. That's pretty much up to date, except for your flu shot Got that. I think that's about it, so we'll do an exam, listen to your heart. Anything else that you wanted to bring up? No, not much. It sounds like you're relatively. I'm relatively, like, free of anything. It's just mostly that anemia. It scares me, because, you know, people at this age should have something. No. I don't know. And you seem very healthy. I'm trying to. I'm going to look into your eyes first, just to make sure I don't see anything. No, your eyes look great. I remember last time, the one you were very anemic that one time was trying to tell. Oh, I see. Oh yeah, I'm sure. Because even my husband saying that, yeah, you look really pale or something. I'm like, I have no blood flowing through my body. Take a large breath in. Okay. Pardon me, what does the tool teach? He's a biomedical. Biomedical? Yeah. What school does he teach at? UC Davis. UC Davis, okay. And you mind laying back with me? So is that, is he like biomedical scientist or business? No, he's a professor just teaching basic science. Basic science, okay. Basic knowledge about, you know, Because these research is about synthetic membrane, synthetic cells, you know, you know, biomedical, you know, how do you make ball sensors and stuff like that? So cool. Yeah. Any pain? How about you? Me? I'm doing similar things. So currently, the reason why I am in -singapore is to develop a biosensor for, so ocular toxicity testing, you know, for products that, you know, like face cream, eye drops, and those, you know, ingredients and the entire cocktail formulation will have to go through the eye test. So right now, I mean, they're using a lot of animal testing and I think regulations like try to limit that. as much as they can. So basically it's a way to test those? It's a in vitro testing platform. So you're not harming any animals, but you're getting accurate data that would. We try to get, because we're using the tirfum, tirfum is the outermost layer, so that's the first primary. So we're trying to develop a in vitro synthetic platform. to sense, you know, how irritants or foreign materials could do to your eyes, then [inaudible]. So it's all research, like, you know, science, but try to see if we could put into a practical use. Because, I mean, to kind of confirm that it's really working well, you would need to, like, compare it with, like, the standard gold, which would be like. Right now, they're all animal testing, right, so we've tried to put. And then. See if the data correlates with the animal testing. Yeah, pretty much. So a lot of companies will be interested. Right now, especially cosmetic companies, they are even actually forced to source animal testing because they are trying to advise. They are animal free. Yeah, cruelty free. And all that things, you know. Very good to see you. Likewise. I'm going to give you some, a lab test that you'll do when you get back. Yeah, so I could wait here if you want to give me a shot or 2 shots. Oh yeah, and we'll give you the 2 shots. All right. Great. You're going to be working your arm. All right. Very nice to meet you. Take care, you too. Did you guys Purposely schedule your appointments back-to-back? Yeah, so that we could come here, we could drive here together, you know, since we were going to see. But why was his video? Because he had, all of a sudden he has a meeting, he has a second mental, so then he has to change it to a phone meeting. That makes a lot more sense, I was so confused, I was like, why is he video and you're in person? No, we should be both here in person, but he really needed a physical, oh, he wanted me to ask you, since you could see the internal schedule, can you see if you could fit him in, you know, before June a 10 or something. Yeah, I don't think so. You need to doubt it. Okay, yeah, because he really needed physical for me, that's why he's, but right now he can't. Yeah, I know. He had to go to Sacramento. Yeah, I mean, yeah, I'm so booked. I'm sure. Yeah. But do, I mean. I'll keep in mind. If there is a cancellation, let us know. I'll let you know. Okay. Thank you so much. See you. See you. Okay, cool. He's [inaudible] and flu, flu ball, awesome. Then you saw a couple of referrals and labs and that's it. Okay. No follow-up either. Okay.","8":"Patient is a 47-year-old female with a past medical history significant for lupus, followed by Dr. Lee and rheumatology that originally was referred to us by rheumatology for evaluation of kidney function. She had a baseline kidney function of 0.61 to 0.98 of creatinine, and then it worsened in October of 2023 to 1.14 and then again increased to 1.29, which is what originally prompted her referral. She also suffers from chronic pain and had been on Celebrex 200 milligrams twice daily. [inaudible] and that medication had been lowered secondary to her reduced renal function. to 200 milligrams 3 times weekly for severe uncontrolled pain. Creatinine had improved to 0.87 in April. Her urine was bland without protein. Ultrastone of the kidney showed a right kidney measuring 10.4 centimeters with a small lower pulse cyst measuring 19 millimeters and a left kidney also measuring 10.4 centimeters with normal cortical thickness and echo texture. She had no hydronephrosis. Other pertinent past medical history includes non-alcoholic fatty liver disease, chronic GERD, generalized anxiety disorder, opiate dependence, fibromyalgia, migraine, COPD with asthma, type 2 diabetes, mellitus, depression, and hypothyroidism. Her lupus has been managed on esathioprine and Benlysta. Um. is on digoxin for SVT, metformin 500 milligrams daily extended release, and Mounjaro for her diabetes, Spiriva and Symbicort for COPD and asthma. Pain was being managed with imoscontin, oxycodone, celebrex, gabapentin, and hydroxyzine. Her hypothyroidism is being managed with levothyroxine. At her initial evaluation, she was hypotensive. and furosemide, swelling was controlled, so her furosemide was reduced to 20 milligrams twice weekly as needed for swelling. Celebrex reduced further to 200 milligrams twice weekly. She was encouraged to maintain adequate hydration. She was having issues with urinary retention and she was referred to urology for evaluation. Her narcotic dosing was thought to be contributing to her hypotension and perpetuating AKI episodes due to the weight loss from her Mounjaro. Her diabetes was well controlled with an A1c of 6.5%. Labs on 2\/8\/2024 show hemoglobin of 14.2, sodium 141, potassium 4, chloride 109, bicarb 28, BUN 16, creatinine 0.82, GFR 89, calcium 9.9, microalbumin to creatinine ratio 4.2 with urine creatinine of 260. Blood pressure today is 94 over 59, heart rate's 89, her weight is documented at 186 pounds. When she was seen by me previously, she was 170 pounds, indicating that she has gained 16 pounds since last in. Her Mounjaro dosing is still at 10 milligrams every 7 days. [inaudible] Yay, it looks cute. I like it. Yeah, it's a pain, huh? It is. Doing hair. Yeah, it is. It's so much easier this way. I'm too lazy. I'm like, I'm barely getting mascara on. I shouldn't say I'm lazy. I'm too busy. Too busy is more. Yeah, yeah, yeah. Busy sounds better. I always got time for that. Otherwise, your hair just ends up in like a ponytail, right? Yeah. Yeah, because you're like, okay, I got to go. Well, how's life? Life has been pretty good. Yeah? Any major changes to your health? During the winter, I've been fighting some pneumonia, some walking pneumonia. It's been hard to get rid of. Mm-hmm. But other than that, nothing much. Okay, okay. I did tell the nurse, I have been concerned because in the kidney area, it's been very tender. Mm. It doesn't feel like, you know, when I urinate, it doesn't hurt, so it doesn't feel like there's like a UTI or bladder infection. Yeah. But the, when I do urinate, the pee is very cloudy, very, like a greenish gray color all the time. A greenish gray, I wonder if that's a medicine, huh? Does it smell? No, it doesn't seem like it's, you know, nothing unusual. And I haven't been taking anything out of it, you know, that would make it change. Oh, did you get in with urology? I'm trying to see, I see. No, they've never, they call me. Left message to schedule with patient times 4. And I called. Did you call? Yeah, I called times 4 and they keep saying that she's busy, she'll call me back. Oh my gosh. And when I keep calling back, oh well she's on the other line, she'll call you back. And then she never calls back. Okay, yeah, we got to get you in with them. So yeah, let's look at your, oh, we didn't do a UA, so we'll get a UA today. Okay. We'll just make sure there's not an infection. Okay. Are you having any other symptoms like urgency, frequency, burning? No, because I still don't urinate a lot. Okay, yeah, we got to get you in with urology. I mean, maybe it's discolored even from just your retention. I noticed I've been, they put me back on the Lasix. Okay. Because going off the Lasix, I'm just, even with taking the Lasix twice a day now, I'm so swollen all the time. It just feels like my skin is just ripping apart. Yeah. It's tricky, well, your labs for your kidney function look perfect. Oh, okay. Like, I mean, you just, I don't think, I think this is more of like a hemodynamic issue than anything else, like, you don't have any blood or protein in your urine, when we checked it before. Okay. And then we check for like Total protein and albumin and all of those are normal. Okay. And your kidney function is at 89%. Like it's totally normal, normal, normal. Okay. Like there's, if I'm looking at anything and there was anything off on your labs, it would be that you're just a little dry. And I know that you, I think you were pretty good at drinking water. Yeah. You drink around 70 ounces a day? Yeah. Yeah, okay. That's what I thought. Yeah, and maybe you were just a little dry right when you took these labs. But otherwise, these look perfect. You know, when you saw me, you had lost a bunch of weight. Yeah. And your blood pressures were in the 80s. And I think that that has a lot to do with it. Losing weight, being on pain meds, and then blood pressure being low. But now you're like... corrected back out. Okay, the nurse said that my blood pressure is still pretty low. It's fine. I mean, you're going to run low for how much you need for pain meds. Okay. As long as you're above 90, I think you're doing okay. Okay, and she's been watching the pain meds pretty close. Excellent. Yeah. Yeah, that's excellent. Because all of these other ones that you've had have been just fine. You were 85 when I saw them. Yeah. It was way too low. But yeah, we'll get a urine sample on you, but I don't think you have to keep seeing me. I think we need to get you in with urology for sure. Okay. Is what we need to do for you. Okay, yeah, and I don't know how to get her, you know, I keep calling, but. You have their number still, or? I don't know if I have it still, but. Let me see if I can find it, and then I'll just give you Dr. Morris Urology. That's hard. I didn't know urology was like that. GI is really hard to get a hold of. So, Carter, Jenkins, Turner, okay, there's too many. Ah, see profile, where's the address? Oh, here's the phone number, okay, I'll type it out for you. Okay. So yeah, I would call them again and get in there with them. So urine, urinalysis And then obviously, if you start having more issues, like you get blood in your urine or protein in your urine or something like that, then, you know, we're here still. Okay. You can come back and see us. Yeah. Or, you know, if they are worried about your kidney function again, but right now everything looks beautiful. Okay. And you can just see us as needed. Okay, great. Urine clean catch, okay, and then we're going to get a urine today. I'm going to say \"cloutier\". And it's green? Yeah, it has like a greenish gray to it. Green colored urine. Yeah, we'll see. Okay, any other things that you're worried about today? Not that I can think of. Okay. Yeah, and your kidneys themselves really, you wouldn't feel pain pain unless you had like stones. or you had an actual infected kidney, and in that case, it would be a massive infection, and I would also see like elevation of your white blood cells, which I don't see at all. Yeah. And you're not having any other symptoms, so it very well could just be back pain. Yeah. Which makes it a little tricky. So we'll just do a urine dipstick and see. After I get done, we'll take a listen to you, and then you can check out like normal, and then if there's an infection after it finishes spinning, then I'll have them call and we'll give you antibiotics, okay? Okay. But I want you to call urology, get in with them, you can follow up with us as needed, your blood pressures look much better, and I see you gained a little bit of weight back, which I think was good. Yeah. And yeah, and then if you have issues, then you just come back and see us. Perfect. I love your sweater, by the way. It's really fun. I am obsessed with those cows. Yeah, they're cute. Okay, big breaths. Good, perfect. -fect. Okay. Let's see your pupils. Okay, and then no other symptoms? No nausea, vomiting, diarrhea? I had a little nausea and vomiting, but no diarrhea. That's from your Mounjaro, or is that? Probably from the Benlysta injections that I do weekly. Oh, I see. Okay. That's annoying. Yeah. I'm sorry. How about chest pain, shortness of breath? I've had a lot of shortness of breath and chest pain. With your pneumonia? Yeah. Okay, is it getting better? It's staying about the same, but I go see the doctor here next week. Okay, that's kind of working on you with it. Yeah. Okay, and anything else that you're worried about? Okay, well easy peasy for seeing us, and like I said, if you have a UA we'll treat it, but for sure I want you to get in with urology. Okay. Because you're not peeing normally. No? Yeah, it's got to be anatomical. It's never been right. Yeah, questions, concerns, or comments? No. No? You guys are too easy, what are you going to do with the rest of your","9":"on hormone therapy for about 5 months. She was last seen 3 months ago. She's currently on the estradiol patch of 0.0375 milligram twice weekly and progesterone 200 milligrams nightly. How are you? Oh, there you are. Okay. Oh, sorry. I was having a hard time getting this going. I'm so happy to see you because they emailed and said that you were not going to be the person and that they had to change the date or something. Oh. I was like, wonder what happened. Here I am. Okay. -you, how about you? Good, yep, just fine, yeah. Any changes to your allergy list since we last saw each other? No. Okay, any changes to medications? I want to go through those with you real quick. Yeah, that medication list is very long and a lot of them are outdated. Yeah. So it's like, I mean, I can use up the whole appointment crossing the list. Well, let me just go through some. Are you doing the eye drops? Yes. Okay. The bupropion? Yes. Yes. The 300, yeah? 450. 450, got it. Okay, perfect. Let me make a note of that. [inaudible] 450. Okay. Clonidine? Yes. Okay. Still doing the 0.1? Yes, just that 1 at night. Perfect. And then the estradiol patch? Yes. And then the estradiol vaginal cream? Yes. Agavapentin? No. Oh, you stopped that. Good. You titrated off of it? Yes. Good. Good for you. Levothyroxine? Yes. 125, perfect. We have to move that to 137. Oh, 137, you got it, I will change that. All right, perfect. But modafinil? Yes, the same. Same, okay, 100. Progesterone? 200. 200, perfect. Topiramate? I'm down to 75. Ooh, good for you. I know, I was on 300 for 20 years. Oh my gosh, good for you. Yeah, so 75 is like amazing. That's crazy. And then the tirzepatide, you still doing that? Yes. Okay, how many units are you up to now? 3 milligrams a week. Okay, perfect. All righty, and then the Novolog? You don't do insulin, yeah, I think we talked about that last time. No, I do use insulin, I have an insulin pump. Oh, yes. But with the tirzepatide, I can't take any insulin. Ah, got it, okay. So I speculate within the next few weeks or months, I'll probably need to start taking insulin again, but that's going to be an interesting process, so I hope I don't die. I'm dead serious. We don't want that. No, no, no, no, no. No, no, no. Okay. I think I got everything. Oh, the midi face cream. Yes. Okay. So I ordered more of that last night. And my question about, oh, did you see that on there? What? No. What happened? Last night when I did my paperwork, I ordered one of the refills. Oh, yeah. Mm-hmm. So what I realized is I could have probably ordered the refill prior to last night because there's refills on my page. Mm-hmm. Is that accurate? Yeah. Okay, because I ran out and I've only used exactly the exact amount that it says to use, but I think it's a slightly inaccurate measurement. And so, you know, I didn't realize I could just order more. Yes, you can. But I just didn't bother to look. Yeah, there should be a year supply on there for you. Oh, okay, perfect. Then the other question I have, well, the other thing I wanted to address in And when I say this is an inaccuracy, I don't mean that like in a grumpy way, but just, it's still more like a factual way. Okay. I noticed on the patient history, there's one thing that I'm a little sensitive about. Yeah. Well, of course, I'm sensitive about a lot of stuff, but this one is particularly embarrassing. I know. But where it says that I smoked. Ah, that's great. I did, but it says has not for 16 years. Yeah. But I'm not sure how that I'm not sure what I said that made that inaccuracy occur in the dictation, but I have not done that for at least 35 years. Oh, because that's the highest that they go in the drop down menu. It goes smoking in the last 1 to 5 years, 5 to 10, and so plus 16 is the last one. So that's, yeah, so it's more than 16 and that's the last one we can, we can choose, so. That's the most, okay. Yeah. I saw that and I was just like. How'd you get 16? I know, I'm like, what did I say? I'm like a stupid AI dictation. Exactly. Yeah, okay. Yeah, yeah. Was that, was that it? Was that the only thing? Yeah, that's all. Okay, perfect. I was just like so ashamed of it, it was just. Oh. Everybody's, you know, we're silly when we're young. Yeah. How is the vaginal estrogen cream going for you? Okay, so I had a little bit of, like, I think I told you last time I had some dosing mess-ups with that. So I ended up having a prescription from my PCP primary care. So I've been feeling that one and then I, I purchased the one from you prior to that prescription just, just out of pocket, not through insurance, which was great. However, tomorrow I have an appointment with my OB because I've been having postmenopausal bleeding. So we did try to have me move down in the estrogen and see if that would clear it up, but that's only been a week and a half. Okay. So it was hard to say if that changed it or not really in a week and a half. However, I'm still having it. Okay. So I have fibroids. Yeah. I have just 2 of them. Mm-hmm. Not a big deal. One is 4 centimeters. One is like, I don't remember, is less than that. It's little, but I'm guessing that that's what it is. Yeah. But I have to go and address that tomorrow. Okay. Did they just, did they do a recent ultrasound? Yeah, I had an ultrasound done, I wanted to say it was like maybe October, but I can't remember for sure. I'm thinking it was October. However, I had some ultrasounds done several years ago, because at one point you could feel the fibroid. Oh, wow. Mm-hmm. So I guess that's what happens if you're skinny. So yeah, it was like poking out, kind of. Yeah. So my OB was great and did an ultrasound then, and then a year later she did a follow-up. So that's nice because we have a baseline. Yeah. So, I guess we'll just have to play around with my hormones and see, you know, if that's, I don't know, I don't know what we do, but I'm just terrified that I'm going to have to go off of estrogen. Oh. And secondly, I absolutely, I mean. I don't want to have any surgeries. Yeah. So that's my next big fear. Yeah. And then my next priority after that, aside from obviously staying healthy, is I'm just worried a lot about my utilization of resources because have really awesome health insurance that I really appreciate and love and value because we've had them for many, many, many, many years and they've raised my kids and been very good to us. And so, I mean, as somebody who's diabetic, like my life depends on that. And so I don't like to just like waste, I don't like going to the doctor and just waste, like going to I want to be cautious about how I use the resources, if that makes sense. Yeah, that makes sense. So I'm trying not to overlap in my care. So I'm a little bit worried about how I'm doing this now, because I've got a primary care doctor, I've got MIDI, I've got OB, I've got a psychiatrist, I've got an endocrinologist, and I'm like, oh my gosh. Yeah, yeah. Yeah, I totally get it. That's a lot. I, you know, since your, is it your gynecologist or your primary care who does your hormones for you? The primary care has been doing the hormones. Okay. And she's awesome. I really, she's very, very good with hormones. It's kind of her specialty. Yeah. So I really trust her. But as soon as I had any bleeding, she was, you know, you go to the OB. Yeah. Yeah. Yeah. Postmenopausal bleeding, we don't necessarily play around with that. The estrogen that you went down to, is that the 0.0375? Is that what you're on now? Yes. Or did you go lower to the? Because I was on 0.05, so I went down to 0.03. Got it. Okay. So that's what you're on now. And then the progesterone. you're on the 200, did they suggest increasing your progesterone at all? Not yet, but I haven't gone to the, I haven't gone to the OVF. Yeah, they'll probably do that for you. So as far as, you know, people who have their sort of hands in the pot, I think the only thing that we did, if you wanted to stay with your primary care for the hormones, was doing the vaginal estrogen and then once you kind of figure out what's going on with the postmenopausal bleeding, anybody can take over that prescription. The face cream and the arousal cream, we can just meet, you know, once a year for that. So that, if that kind of helps distribute the. Okay. [inaudible] So is that, I mean, is that something that MIDI does with some patients? Oh, for just the, just the custom RX medications? Yeah. Yeah, uh-huh. Oh yeah, well, yeah. Okay. Yeah. Okay. Yeah, because if you do your hormone somewhere else, then yeah. Okay, well, that's good. Well, because the other thing is, is I wanted to maintain the relationship with MIDI because my hope is that they might be able to do the testosterone if that's something that ends up being an option later. Yeah. I mean, it may not be for me either way, but if it is, that might be a good thing. Yeah. So. Yeah, absolutely. Mm-hmm. So I don't, I know they're working towards that in all 50 states, and I don't know where Washington will fit in. We're not on yet. We're not on yet. We're in the works. However, you know, I would ask the OB when you go and see them, because it's, you can do it in the state of Washington. It's not Washington itself. It's just MIDI isn't licensed to do it in Washington yet. So the OB may actually, if you stick with the OB, they may be able to. Obigun, they can prescribe it for you if that's something that they do too. So, but you're on my list. I have a list running of all my Washington patients who are waiting for the testosterone to become available through MIDI. And so you are on my list and, and I, if, when it does happen, I'm not going to say if, because I know it's going to happen. When it happens, I'm going to reach out to all of my patients on the list and let them know. Okay. Thank you. I appreciate that. That's good to know. Yeah, I don't actually know what my OB's perspective is on testosterone. Yeah. You know, it seems like everyone has a very different view, so I don't know. Yeah. It's hard to know until you're in there. Yeah, exactly. Yeah. Are you, which, which health care system are you going to? That is Northwest Women's Health. Oh, yeah. It's Dr. Emily Wong's office in Seattle. Yep. So I'll see one of her ARNPs. Yeah. I mean, the Hannah. They're pretty hormone savvy there. So most of them, the ones that I've had interactions with. So I think you're probably going to be okay regarding that. Okay. Yeah, Dr. Wong is like, crazy amazing. Yeah. Like seriously, the few times that I've been in her, you know, had her for my doctor appointment, I'm like, honored to even be in the same room. Uh-huh. Yeah, I get you. Yeah. I know. Yeah, she's, I know of her, so. Yeah. Yeah. Okay, so let's, so you have enough of the arousal cream and the face cream on, in your orders section of your portal. So you can always renew those. And then when you get to the end of the refills, just make an appointment to come and see me. And we can refill those for you. And then when I find out about the testosterone, I'll reach out to you. If you're already on it, great. If not, we can get you set up. Okay. Oh, well, great. Like a plan? I'm glad I visited with you today and figured out those things. So I've got all those in the background. Yeah. Great. Okay. Cool. Thank you, Julia. You're welcome. I'm glad that it was new today and that you're still there. So that's good news. Yeah. Thank you. You're welcome. All right. So if anything comes up, let me know. Otherwise, I'll see you next year. Okay. Or at the end of the year. All right. Okay. Take care. Okay. Have a nice Valentine's. You too. Thank you. Bye-bye. Bye.","10":"All right, before we get started, I wanted to ask you, I'm using this new program that records our session and then types out the note for me. Is it all right if I use that today? Yes. Okay, great. Thank you. How have you been doing? How had the wedding go and everything? Yeah, well, it didn't go exactly as I planned. It was a beautiful wedding, but everything started on Friday night where I just, I felt left out because Alyssa invited me to... her, you know, father-in-law's house. They were doing like a little bit of a rehearsal. Yeah. So I was going to be in New Hampshire anyway because my sister's rented rooms in the hotel. Yeah. So I went and my daughter was there. When my older daughter was there, everything was great. We were the only two from our family that were there. She had like a whole bunch of people from her family. And then I said to Alyssa, oh, you know, Auntie Rachel and Emma are here. They flew in this afternoon from Georgia. So, Chloe's dad said, oh, call them, you know, where are they? Bring them over. And Alyssa, oh no. And he was like, Alyssa, your aunts, what are you talking about? So I said, oh, I'll call them. But then Alyssa went like this to me. And he goes, Lily, are you sure you don't want your aunts and your cousin to come? And she's like, yeah, I think they went out to eat, so they're fine. Yeah, so who knows what she's thinking. Yeah, I thought that was very weird how she didn't want... Many of her family, I mean, my daughter left at 8:30 and then she asked me to stay with her. So I stayed with her till like 11:30, but the whole family was telling jokes and stories that I'm not involved in. So I started getting really anxious. My friend is a nurse and she said, I think come inside because she saw me getting, I was like, she's like, you need to breathe. She's like, Heather, don't have a panic attack. I can see your head. So it's that I said, Yeah, it's pretty hard when people tell you not to, not to have a panic attack. Yeah. She's like, you just have to go along. I said, I'm trying, but I feel really left out. Like, I don't even feel like I'm her family. I feel like you're all her family now, and I'm like an outsider. So, anyway, the wedding came and I had a drink, which I never should have done, so I started seeing, like, Chloe's mom. Chloe is, you know, Alyssa's wife. yeah okay yeah she's like where are the girls where are the girls and i'm like oh i don't know Hannah so like then i saw her like kind of grabbing mom and dancing with them and And yeah, I don't know what happened, all of a sudden I felt this really like, like jealous, I felt very, very jealous and angry, I felt angry, so I was like, oh my God, stay calm, I tried. Yeah. Like, what's wrong? I said, I don't even feel like I know my daughter. And she's like, you can't do this at the wedding. You can't. So I tried, but then Alyssa was just like everywhere. So when I finally grabbed her hands. Yeah. I made a big mistake, you know, I said, Alyssa, you know, I love you, do you love me? And she was like, mom, what are you doing? Yeah. And I I don't even feel like I know you anymore. You're my daughter. You never come to see me. And she goes, mom, you're stressing me out right now. She's like, please don't do this to me. Yeah, I'm stressed out too, honey. I said, because I don't feel like you're a part of my life anymore. We can't do this now. Yeah. Like, mom, I love you. I'm sorry that you're feeling this way, mom. But I have guests to talk to, mom. And, you know, yeah, of course we'll dance. Yeah. So I went in the ladies room and cried and then after came out and then we all, you know, started dancing. Yeah. I felt terrible because my sisters were like, you shouldn't have done that, you know, to her. And I said, I know I shouldn't have done that, but I did it. It's already done. Yeah. Yeah. You've had- felt the need to kind of say that and I mean it's hard weddings are not they're not the easiest for families with multiple layers of concerns. I wish I had spoken to her like a week or two before and said how I was feeling because Grace and I um Grace's like I think why don't you see if she'll do a telehealth? I think you need to tell her how much you miss her. Yeah. And how you feel because, you know, you're keeping it in So see, I was holding it in and then boom, it came right out at the reception. Yeah, and it probably didn't help that you were having a drink, you were feeling anxious, so I think it makes sense. Everyone was asking me like, what's wrong? Are you okay? And you know, And then I felt bad. I did apologize to her the next morning because we all went down in the hotel and we were having breakfast and she goes, mom, it's fine. She goes, don't worry, I already forgot about it. She's like, I'm leaving for Nashville on Wednesday. So I said, oh, okay, I'll call you. you know, before you leave and not to discuss any of this. Yeah, that, but just to check in, yeah, yeah. Right, the trip, how's everything going, but I do, I did say to her at the wedding too, I think I said, Can we go into Starby? And she was like, mom. And I said, no, not, not now. I said, like, later, later. And she goes. Mom, if you want to, I will, so I don't know why I did that. I feel bad now. Well, I mean, it's probably what... you really want that, so maybe it's something to discuss in the future, right? Like if you want to repair the relationships, right? Because you didn't have the greatest relationship with your family, right? So I think like trying to you know, not even repair, not that there's anything wrong, but like try to get to a healthy relationship with your daughters and sons, right? So I think it makes sense to want that. I mean, I'm sad if I don't see my daughter for 4 months. Yeah. I can't help it. I said, I'm being honest and saying, like, I love you. I want to see you. Right, right. You know she's busy. Everybody has, you know, all my children are working full time. Yeah. I understand. Yeah. But other kids find a way to see me. Yeah. Yeah, so maybe you guys come up with like a plan, like maybe you check, you know, you have a date like every 3 months and then 2 months and then once a month or, you know, whatever you guys. decide, but maybe you have to make a plan, right? Sort of like, so it doesn't fog up, you know. I feel, I felt depressed, like, Friday night, I went back to the hotel, and I was already depressed. Yeah, probably, I mean, I imagine the alcohol with all the meds you're on, too, like, the medical ones. And I started drinking, and you know my emotions took over and I feel let down right now like yesterday I couldn't even get myself to I think I brushed my teeth and washed my face but I stayed in I was I was so, like, emotionally exhausted. I was just exhausted. So I don't know. I mean, my friend, I went down and saw her. Because I want to show her a couple of the pictures, and she's like, oh, no, you seem like you're there again, you know, because I started crying. I said, I'll go back to where I was, but I'll be honest with you, I feel a little bit depressed right now. Yeah. I mean, I'm happy for my daughter because she's happy, but I'm not really happy with my life right now, you know? Yeah, yeah. Well, it's all in so many different factors of things going on, right? It's not just one thing, right? Yeah, it's not just one thing. It's, you know, being in this building, I'm having terrible heartburn, which I haven't had in years. So I'm stressing out. And then when I go to eat, it's like the acid reflux. So I had to start taking the medicine that I took for years. I mean, yeah. So I don't know what's happening, I just, I feel like dumb, you know, I don't, like the wedding was something to be looking out. Like, even my sisters are like, oh my God, it's over that quick? Like, I'm not planning, right? Right, it's hard, weddings are so hard, you know, it's too much. Then I'm like, oh my God, that's it, now it's back to, you know, reality, and, you know, I don't like my reality right now. That's, I have to figure out what I can do for myself that I'm not constantly thinking of like, why is Alyssa not calling me? Why is Alyssa not seeing me? I have to do things for myself and get. might focus off that. Right, right. And maybe it'll be harder now because of that sort of like event, right? But the hope is you can get there in time. How, so I know, I think like one of the things medically you were getting your stress test and echo, how did that all go? They canceled it. My sister went to Portugal, so she's like, oh, I can't take you. And I said, well, I could get the ride, but. Why should I get myself stressed out before the wedding? I can do it after the wedding. So I wish I didn't do that now because now they can't get me until September 8th. Yeah, well that's actually pretty good. I was thinking you were going to say it was later. So it's such a coincidence, they're going to do the test in the morning and then I have an appointment with him, the cardiologist, at 1:30, so I'll just stay in that career and get it all done. Okay. What about, do you see a neurologist since I last saw you? Not yet. Okay. I think that's in September too. Okay. So my primary, oh no, she was out of the country. Oh, okay. So my primary, like refilled. my imitriptyline for me. Good, okay. So I will be going back to see her in September too. Okay. And I think I'm seeing my primary one more time. i don't like this primary anymore so i'm gonna because she's filled out like the letter that i need every year to like continue um getting like food stamps so i said i'm going to be fair and go and see her one more time i'm not going to tell her that you know but So I would make sure maybe you get an appointment with someone else before you stop seeing them. Yeah, that's true, right? I need to call the insurance and find out like. Because I've had a lot of clients have trouble finding a PCP recently, so I would make sure you can get one first, right, before you drop the one you have. That's true, right? Because then I'll be without a PCP. and you really need someone to coordinate everything yeah no thank you for telling me that because i'm not like my sister keeps complaining too oh i hate your primary get another one i said you think it's that easy yeah it's not easy but it's worth a try right yeah i mean i think Yeah, you need to trust the person that you see and coordinate all your care, right? So I think it makes sense. So maybe, yeah, call your insurance and see who's available, who can take you, and then just get that appointment in the books, you know? Yeah, I'm just, like, yesterday was like recovery day, you know? Yeah. I was sweating like crazy because I went to my hormone doctor and she upped the patch. Okay. So now it is, let me see what the dose, so I was sweating like crazy at Alyssa's wedding too, which was bothering me. Yeah, that's not Estradiol? It's Estradiol 0.0. 375. Okay. So I just started the new one, so at the wedding, all of a sudden, I just started sweating, like purposely, I mean, I was dancing too. Yeah. But like- My older daughter said, oh my God, mom, your hair is like stuck all over. She's like, are you going to pass out? Like, are you okay? And I had to go outside and keep getting an ear because, but the nurse that was there, the friend I have, she said, you might experience maybe some hot flashes at the beginning until your body will adjust to the new. Yeah, she's probably right. Yeah, I'm going to wait like 2 weeks. I mean, if it doesn't stop, then I'm going to have to call her and say I'm sweating even more now, you know. Yeah. Yeah, I think it makes sense to do at least 2 to 3 weeks, right? I don't know how long it takes, but I imagine as with any other med, at least 2 to 3 weeks, right? Yeah, it usually does, right? So I'm just going to try to like. You know, even yesterday I was like sweating like crazy, but today so far so good, so we'll see. Yeah. We'll see what- How have you been doing with your eating? Yeah, I kind of like almost have put that as like- I'm not like super strict with the plant diet anymore. Like I had chicken Friday night at Alyssa's, you know, after potty. And I didn't like feel bad about it. I said, you know what, you're going to eat, you want to eat chicken even for the wedding. I wanted chicken. So I had chicken at the wedding and I ate, you know, but I still have like, you know, like today I just started a 28 day challenge to do like, like workouts, like on a chair. Okay. Yeah, and like I put my, it's an app, so I put my age, I put my weight, so I, my goal is to get to 128 by February something and the coach I have keeps saying you can do it you know they keep sending you all these inspirational things but you know it's not like she really knows that I I cut my food Anyway, do you know what I mean? Yeah, I mean sometimes those things can be counter like productive. So I think we do have to watch that. Yeah, well, I mean, they're like, you know, fruit, of course, in the morning, like fruit, oatmeal, which is most of the foods that they're recommending, I love anyway. Yeah. Yeah, they don't know that I have this thing in my head with like portion. That's what I'm worried about, I think. I'm a little bit worried about that. I don't, because I think we're already worried about that getting worse in general, right? I know, but I have to focus on something, Sophia, so I thought maybe if I do this. This 28 day challenge and I can get through it then. Yeah. I feel like I'm doing something. Well I mean what if you're, what if you do the challenge but don't focus on the eating part? Right. You just work on the exercise. That's what I am because my foot, I actually, Ethan's at the wedding. And, yes, it is still swollen, but I wore sneakers yesterday for the first time, so. Yeah, so I think, like, maybe using it as a way to, like, help you focus on. Right, rather than weight, right? So we want you to get strong, right? I do want that. We want you to move, we want your heart to move, your heart rate. Yeah, I want to get more like flexible, because my shoulder is acting up again, and I just finished PT. Yeah. But he's like, if you don't do the exercises every day, Heather. at least once. He's like, it's different than Friday. We have the after party. It's hard, like it's easier for them to say that, right? But it's, yeah. I was with my sister. So, you know, I was waking up in a hotel. Everyone was like, okay, let's all meet down at 10. So nobody was like going to say, oh, gee, and this will wait till you do all your shoulder exercise, you know, they'll, hurry up, let's go, you know, so we were on a time crunch, and then my sister decided, oh, let's make an appointment to have your hair and your makeup done, like, are you kidding me, Rachel? It's Saturday, there's no way. My sister went into the salon in the hotel and talked this woman into giving me a one foot and five foot. So then I was sitting on the chair with the woman that she cut my hair and I did my makeup and my sister was sitting very calmly, my sister said this is what you needed, the one that came from Georgia, you need to sit down and get yourself in a calm, I wish I could have continued that at the reception instead of choosing to drink. I wish I never chose to drink. I mean. Because I'm not a grigger. I'm not. Yeah, but you can only do so much, right? You're only a human, right? So, you did the best you can. Yeah, I feel bad. I hope she really has forgiven me and I just have to keep going forward, right? Yeah. I can't keep dwelling on it. No, I think you're right. I mean, I think back to the mood and sort of your eating, right? So I think like we know that sort of like. -limiting food and constricting, right? Like that in itself can really sort of decrease your mood, right? So if you're not getting the right energy, you're not getting the right protein, right? That can help like make things worse. So I really want to- I want you to do the challenge. I'm not saying not to do the challenge, but I'm just worried that the, whoever this, it's probably not even a real person, right? It's probably like a robot, but. It's still a picture of a woman, Olivia, saying she's my coach. I don't, I mean, how do I work a coach, right? Right, so I think like maybe just. if you can like tune that part out and just focus on the exercises and leave the eating for now because i worry that that's only going to get us more in an obsessive pattern oh i see what you're saying i mean i am going to go to the grocery store today by like i went out of food So I'm going to go get the foods that I like to eat and I'm going to walk. So I'm going to start, you know, not like crazy speed walking like I did before, like five miles, but I'm going to start doing like, you know, miles, see how my foot is. Right. And go slowly because he said if the swelling doesn't go down, I don't know what we're going to do. I mean, you can't just have your foot swollen for the rest of your life. Right, no, it's not good, yeah, it's bad. So I, you know, I'm not going to push myself, that's why I got the gear exercises. No, I think you're right, it's good, but I think the- The nutrition part is the part I want to just put aside maybe. Right, okay, so I'll focus more on, you know, the exercises and just- getting myself to a place where I can eat and feel guilty about life and not be thinking about it like every minute, you know, don't eat this, don't eat that, you know, it's like I have to, yeah, that is still, I don't know how I'm really going to ever get that under control, it's going to. It's going to be like a working problem. Yeah, I mean, I think, yeah, we'll have to probably get a little bit more help, right? It's not going to just be me and Grace. I don't think it's going to, even when I tell myself, like, come on, Anna, but then I always fall back into it again. So I might do good for a few days and go, oh, stop thinking of calories. You're good, and then the guilt comes, and then when the guilt comes, then I, it's almost like I have to punish myself because I overate, and that, you can't do that, so it's a whole mind game, you know. Yeah, I mean, I think that's why I'm worried about it. That's why I don't want you to even like pay attention to the scope because they don't know you, I think, right? So I think we need to focus on what's going to help you feel better in the sense of like, exercise, movement, right? The things that are safe for you, eating the foods you want to eat, but really trying to just focus on giving yourself energy, right? So like fuel. Right? Right. How are you going to think clearly that you don't have the right fuel, right? That's true. Right? How is the medicine going to work if you're not feeding your body fuel, right? Right. Right? It's not going to work if it's just going through you, right? Right. So that's another way to think about it. You know what, I don't know, I'm going to call my dermatologist because she ups the medication to 100, the spironaxone, and I'm getting, like before the wedding, I hadn't gone to the bathroom in four days, I'm getting. Oh, it's constantly, yeah. My sister's on it too and she goes, oh my God, it does that to me too. And I'm like, oh, it didn't do it when I was only doing 50. what's 100 now? Yeah, so maybe you could do 75 or something like that. And I'm going to call her and- or unless I do like maybe like so um Friday I said no 50 so the whole weekend I only took 50 milligrams of it because I already like couldn't go to the bathroom so it made me feel very uncomfortable. Yeah I would just call them and just make sure that it's okay like what dose you should be on right to mitigate the constipation. Right, right. I see you don't have an appointment with Grace until like a couple weeks from now. Do you know you're supposed to have one this week? Yeah, I did. And I woke up and I was so, no, not, no, this week she's not like answering back. So I got like an automated message. Because I messaged her yesterday, and then I heard nothing, so then I messaged her again today, and I said, oh God, maybe she's sick, because last week I canceled with her, because I got the flu shot, and I was, oh my God, I was still sick for like three days. Okay. But now this week, I know I'm starting to feel like I need to talk to someone and I bought that automated message thing, Grace, where we... What did it say? What did it say? It said Grace will return to the office February 15th. And I'm like, oh God. She must have a coverage. person. She said if I need anything to call, yeah, it was a message that gave me like a woman's name. Okay, yeah, I see it now, I can see it in her email, yeah. Did I call that person or? I mean. Do you feel comfortable talking to like her supervisor? I mean for me, I feel like I don't know if we can wait like before I get back. Yeah, I don't think I might end up calling like a hotline. I feel like I'm not going to. Yeah, so I don't think. I feel like that about what I did at the wedding. I feel like I need. like discuss this you know yeah so do you i mean we can i think we should try to reach out to her supervisor the one who's covering for her and see if she can fit you in or maybe like someone else Because I think it would be nice for you to check in with someone this week, and then, I mean, essentially, maybe when Grace gets back, we could see if she could squeeze you in, like, the week she gets back. Oh, I hope so, I know. So, look, do you want me to help coordinate that? Yeah, oh my God, if you can, because then I thought... When I wrote her on the calendar, I thought, oh no, that means she's returning, but they didn't give me, you know, an appointment, so what does that really mean, you know? So I started getting anxious about that, you know. Yeah, I don't know. Yeah, I don't think we can wait that long, I mean, especially where we are now, so, so I think, let me talk. Let me write an email to her supervisor just to see like who's covering for appointments. Is it the supervisor or someone else? And then I'll have them like see what the office staff can reach out to you and try to get you in. And then I think you and I should try to meet next week, just in case, like whether you meet Grace or not, I mean not Grace, whether you meet with someone else or not, I think it would be good for you and I to just do a quick check-in maybe. Okay, because I like- I was, because my, you know, my sister was like, maybe you should go up on the medication. Well, I mean, I would prefer that, but I don't, I don't want to push you towards something you don't want to do. But I think, I mean, I've always thought that the higher dose was better for you. I mean, I guess in my mind, I'm thinking that too, but the food thing is coming into my head again, you know, like how I got really hungry, like I'm afraid of that happening again, you know. Like when we, what do you remember I told you? -you off all the time? Yeah, I remember. And I don't like the feeling because then I do eat, like I overeat, that's the problem, you know? All right, so I could see you, I could see you next Thursday, I could squeeze you in around 10:30, would that work? Or sorry, not 10:30, sorry. I don't know why I said that. 4:30. Yeah, 4:30, yes. Okay, thank you so much. Actually, could we do... Tuesday at 4:30 or could you do Tuesday at 4:30 instead? Yeah sure Tuesday 4:30 yep. Okay that's a little better because I have another yeah I think that will be better. Okay, so we'll see you next Tuesday. I mean, I think if you want to go up, I think we should go up, but maybe if you want to think about it, you can think about it and then let me know. In the meantime. I'm going to talk to a Grace supervisor or whoever's covering for her and find out like how we could get you in and see someone like twice before Grace comes back. I really appreciate that because I was like, oh no, what do I do now? Do I just sit here and say, uh-oh, you have no one to talk to, you know? And I think, I mean, I think. Having 1 of those hotlines available, like 988 is 1 that you can text or call. You know, I think those are great because it's just like an unbiased person who can listen. Right? They're not going to tell you what to do, but it's nice to have with another person. That's not your sister, not your daughter, not me. Right? Right, because they really, you know, I know they mean well, but like my older sister was like, you know, son, like when we left the wedding, she was like, the whole time in the Uber, you should have never done that to your daughter. I'm like, Megan. I mean, I really, yeah. And that's not what we would like. But then she made me cry again, I said you're making me feel worse. Yeah, yeah. I mean, are you trying to make me feel worse? Or what are you trying to do right now? Because I already hate myself that I did it, so why would you make it even worse for me, you know? My niece was really good from Georgia. She was like, I can. You know what? You're okay. She was like very calm and she was like really trying to say to me, don't think about it right now. You know, Alyssa is not going to be mad at you. She just got married. She's happy, and I'm like, okay, okay. Sorry, I'm not trying to ignore you, but I'm just trying to write the email before I have to go see the next patient. Oh, okay. So I think, yeah, I think definitely maybe call the hotline even today, like if it feels like it would be helpful. You can call as many times as you want. They're all. free and available to anyone of any nature, right? It doesn't have to mean that you're wanting, like you're in a bad place, it's just a place to talk, right? Okay, yeah. So I think definitely call them. Yeah, I felt really like lonely yesterday, you know, I felt like. Yeah, it's not easy. So let me reach out to them and they will, someone will call you, hopefully to book something with you. And if they can't, then I'll have one of my people tell you kind of what the status is, okay? Okay, thank you so much. I appreciate it. Alright, hang in there. Alright, take care, Heather. Bye. Say bye-bye. Thank you. Thank you. Thank you for watching. Thank you. Thank you. Patient denies suicidal ideation, but reports getting really lonely and. hopeless after daughter's wedding.","11":"65-year-old man seen as a new patient for elevated PSA, which was 6.52 on routine blood work in May of 2024. No history of prior prostate biopsy, no family history of prostate cancer, baseline voiding symptoms mild. He was seen also in SHARP ER for gross hematuria in February 2024 with a CT abdomen pelvis showing prostate enlargement, but no other acute abnormality. History includes pre-diabetes, -peptic ulcer, disease, hypertension, and erectile dysfunction. Urinalysis today, no blood or bacteria. 65-year-old man seen as a new patient for elevated PSA, which was 6.52 on routine blood work in May of 2024. No history of prior prostate biopsy, no family history of prostate cancer, baseline voiding symptoms mild. He was seen also in SHARP ER for gross hematuria in February 2024 with a CT abdomen pelvis showing prostate enlargement, but no other acute abnormality. History includes pre-diabetes, -peptic ulcer, disease, hypertension, and erectile dysfunction. Urinalysis today, no blood or bacteria. Post-Fried Residual, 201 milliliters today. Hello. Hi. How are you? Good. I'm Dr. Carter, it's nice to meet you. Mm-hmm. How can I help you today? [Foreign] [Foreign] But you were in an emergency in Sharp last year for blood in the urine, right? Mm-hmm. Oh, yes, I was urinating. Okay, well we have to investigate a little bit. Did you smoke? No. In the past? No, if I smoked, maybe a cigarette, maybe a month or something. Okay, a few times. No, not anymore. Okay. Anyone in your family who has had cancer of any kind? Mi papá tuvo el próstata como a los, no sé, unos 70 años, 75 por ahí. ¿Qué? 75. De edad. Él murió. Bueno, murió de grande ya, pero no murió de eso. De eso, ok. No. Pero tuvo. El próstata. El próstata, cáncer de la próstata. Ok. Otro. causa de su visita hoy, o lo más es que salió elevado el número del antígeno de la próstata, una prueba de sangre que puede señalar riesgo de ese problema. Mm-hmm. Y eso fue la razón que le mandaron aquí su doctor de cabecera. Okay. Pero también debemos discutir sangre, porque parece que no lo han investigado completamente. Investigación para el sangre en la orina consisting of a special tomography of the kidneys and also my little camera inside the bladder to see what is happening. And that is what I recommend. For the prostate, this number, the antigen, is something pure benign, done by the prostate, it goes out to the blood where we detect it. Una próstata más grande va a ser más del antígeno y el número va a subir un poquito, pero cuando es muy, muy alta, o si está subiendo muy rápido, estamos pensando qué más pudiera explicar este cambio. Y lo que recomiendo, en un momentito te voy a examinar, y si la próstata tiene nódulo o es algo extraño, pero recomiendo que debemos repetir ese prueba de sangre para verificar que si está elevado. Y otra tomografía específica para la próstata nos puede mostrar, por ejemplo, el tamaño de la próstata, porque mi dedo nada más toca un lado, no completamente, y no puedo decir exactamente el tamaño. Y estamos pensando en el nivel y el tamaño. Se comportan todo bien, pero si el tamaño es muy pequeño, el nivel es muy alto, más peligro. la tomografía nos va a mostrar más el volumen de la próstata y también nos puede mostrar si hay área de peligro. Mm-hmm. Okay. Tiene alguna molestia en la vía urinaria? No. No, pero contestaste a esas preguntas de. No la entendí, yo me imaginé que era el tiempo largo que podía ir al baño o algo así. Es más que cuando orinas, es la orina así. No. No. No. Okay. Intermittence is no, okay? And how often do you go to the bathroom? Less than 2 hours. The thing is that I can go 3 or 4 times because the doctor gave me pills to. Tamsulosin. To not retain liquids and that makes me go to the bathroom too. Okay. Okay. And you know the name of that medicine- Okay. Okay. No estás vaciando completamente la vejiga, y quizás al tomar una pastilla para abrir la vía urinaria, puede ayudarle a orinar más completamente, porque al orinar, si no estás vaciando completamente, va a ser llena más pronto. Y estás teniendo casi 200 mililitros de orina después de orinar. Pues si le molesta eso, contéraste, se pregunta si, ok. Maybe a different way of answering them, but the most important thing is the quality of life. In the urinary [inaudible] with this problem of urinating more frequently or with intermediate urination, does it bother you or not? No. Okay. No. Okay. Stop, please. If you'd like to step out. Yes. Okay. I'll go over and [inaudible] Okay, let's see. Okay. You can get dressed. Okay. Sangre realmente es más urgente. Sí, más preocupación que lo demás. Porque cáncer de la próstata, como en su papá, es algo que puede tener y vivir con muchos años. Criastones y todo eso. Y morir de algo diferente en muchos años. Pero sangre en la orina puede señalar algo con más riesgo. And do we have to make an appointment with you? Yes, please. What they're going to do at the exit is explain the way to fix the blood tests, tomography of the kidneys, and another of the prostate. And they're also going to schedule an appointment to come back here. Okay. I hope we'll discuss all the results. And I'm also going to look inside the bladder with a little camera. Okay. Okay? And then we'll do everything. Yes, but the bladder has to put the probe in. Yes. Don't think about it. We use an anesthesia gel, it's not harmful, it's a bit strange in sensation, but it's not harmful. It's better to be sure of your health. It's very important, and it's nothing else, less than 2 minutes. So right now, nothing is being seen, inflamed or anything? There's no way of seeing, it's nothing else I can feel. Yes, did you understand, Emily? [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Foreign] [Forein] [Forein] [Forein] [Forein] [Forein] [Forein] [Forein] [Forein] [Forein] [Forein] [Forein] [Forein] [Forein] [Forein] [Forein] [Forein [Forein [Forein [ Okay, thank you. You're welcome. [Foreign] Okay.","12":"Yes, it's the emergency department. And this is your Emilio, interpreter number 400654. Got it. Okay. Okay, all right. So, I'm Dr. Gonzalez, can you give me an idea of what brought you in and we can discuss the results of the tests? Okay, my name is Dr. Gonzalez, can you tell me why you came and we can discuss the results of the tests? Oh, I came because, I don't know, my blood pressure went up. [Foreign] Okay, what happened is at midnight my blood pressure went up and I couldn't sleep, I felt Okay, anything else? No, that's all. Okay, and it said in the triage note that you were having some pain in your chest? No, I just felt like, I don't know, like, how do I explain it? I don't know, I felt like I was kind of [inaudible] I don't know, like, I imagine it was high pressure, I don't know. -ly what happened is, I don't know how to explain, but it was like my chest was agitated, I think it's because of the high blood pressure. Okay, okay, have you felt similarly before? [Foreign] Not that I remember, and if it happened, not recently. Okay. Any medical history that you're aware of? No. No. Okay, do you, have you ever had any surgeries? No. Okay. Do you smoke cigarettes or drink alcohol or do any meth, cocaine, heroin, anything like that? Oh. [Foreign] Just beer. Okay, all right. And then family history, any family history that's significant? Any heart problems, any lung problems that you're aware of people at a young age? [Foreign] No. Okay. No. Good. What you're testing here looks good. Your lungs are fine. It doesn't look like you have an infection and your heart is in good shape. Okay. Have you felt pretty good over the last couple hours here? Yes. So your blood pressure was high when you came in. It's difficult to know if that's because of how you were feeling or if you have maybe high blood pressure as a medical. condition, but you will need to get that followed up in a clinic. Okay, but we didn't see anything in the blood work or the testing that looked to be a problem with your heart or your lungs or anything dangerous. no vimos nada en los exámenes que pudiera ser peligroso para su corazón o sus pulmones o algo malo. Okay, so hard to say exactly what happened, but keep an eye on your symptoms, if things worsen and you can't get a follow-up, you can come back, but I'll give you a referral to a doctor in a clinic. Entonces, bueno, manténgase atento para estar monitoreando sus síntomas. Le voy a dar un referido para que vea un doctor y pueda dar seguimiento. Okay, it's all good. What I'd like you to do is if you could buy or borrow a blood pressure cuff and then at home take a little notebook and check your blood pressure in the morning and in the evening and just write it down. Don't get nervous about the number, just write down the number. Perfect, yeah, that's good. Okay, and do that for 2 weeks and then you'll take that information to the doctor and you'll see how your blood pressure changes a little bit day to day or by time of day. Okay, [Foreign] Okay, that way they'll be able to tell if you need to start a medication and what type of medication would be best. [Foreign] Okay. All right. So far, I think you're going to be just fine. Do you have any questions for me? No, [Foreign] Good. Oh, that's all. Okay. All right. Thanks, Nexafil. Appreciate it. Thank you. Have a good day. Okay. All right. Just wait right here, okay? Thanks. Normal exam. No large [inaudible] with heart rate. No acute distress. History obtained from patient using Spanish interpreter. My independent interpretation of patient is chest x-ray, lungs clear, no significant cardiomegaly or signs of pulmonary edema. My independent interpretation of patient is EKG, sinus tachycardia 103, normal PR, normal QRS, Roman QT with a T-wave inversion of lead 3, otherwise non-specific ST changes.","13":"Hello. Good job. How are you doing? No good. No good, because why? Oh, pain. Pain, pain, pain. Pain. You were falling the other day. I have a hip. Do you have pain because you fell? Oh, no. I have pain anyway, but the fall didn't help. My hip, oh. Yeah, you've had pain there for a while, though your pain there is worse. It doesn't help. Kind of in your right butt. I can't use my foot, I can't put weight on it, it's better than it was, it still hurts. You fell a week ago? No. Sorry, 2 days? 2 days. 2 days ago. That would have been 3. Yeah, 2 days and 3. Oh. But you can't put weight on it? No. I mean, you can't put weight on your foot? No. And this stupid thing, it won't quit draining. It's been there since February. Right, you were supposed to go see the surgeon. I did. You did? What did they say? That did. Said it could be a cyst or an abscess. They never told me which. But you saw the guy at Meadow Clinic? No, I can't. Not dialy- No, no, no, I don't, no, they sent after the hospital, they wanted you to go see this special surgeon. I know, I don't know that. You didn't go see [inaudible] They did. The referral's in here, all the info's in here. So you never saw the person they told you to go see? No. I didn't know I was supposed to. Okay. They gave me absolutely nothing when I left the hospital. No papers, no nothing. No. Okay, so you were, because I saw you, right, right before that, and you had this big growth there, it seemed to be infected. Yeah. You were. They drained it a little bit. Yeah, you were in the hospital for about a week almost. Yeah. They thought it was just an abscess, but, so they had been talking to this specialist at Meadow Hospital, I guess. Recommends referral for follow-up with Meadow oral maxillofacial surgeon, which has been placed with the assistance of HLN. I don't know what HLN is.Invert? Well, probably in Fairview. Fairview, Miami? I think so. There's got to be one here. I don't know why they talk, I don't know if it was that person because there's no one like him around or because he was the one on call that week, right? So for example, if they need a super specialist like that, they probably rotate taking call and I don't know if he was the one on call that week or he's the one, I'm not sure. Okay. I guess we, at this point it's. not an emergency, but we should follow up on it. So I might have to email this guy, though, to see what the deal was. So what's been happening, Olivia, with your jaw since then? It just kind of sits there like that? No, I. This thing. It dreams all the time. What does it look like? Puss. Like thick yellow? Yeah.  Does it seem to be getting bigger? No. No, okay. Okay. Oh. Olivia, before you fell, how were you doing? Normal with the arthritis and just hurt my back. Right, so lots of your pain stuff. My back, valence is not there. My back, it sucks. I don't know, I have to hang on. Is the balance bad because your legs don't work or because your head is dizzy? Probably both. No, but I want you to think about it. I mean, are you having trouble in your head with dizziness or wobbliness? Oh, yeah. If I pick it backwards with my eyes open. So if you look up, you get dizzy? Yeah. Okay. Without hanging on. If I hang on, it can do it. I've always been that way. You've always been like that? Yeah. So do you think the issues with falling and balance then is more related to your legs and strength and pain and? Right now it is. Before this, were you still getting epidural shots sometimes with Dr. Lee? It's been a while. In the back. Yeah. I haven't had any in a long time. How come? I don't know. The pressure of going, this is killing me. You mean just to get out of the house? Yeah. You're like, it's not worth it to you? Nope. Okay.Took 2 and a half hours to get ready to come here. Okay, well, especially with this fall. Yeah. And I've been having real bad burning in my throat. And you're taking your Percocet, right? Yeah. From Dr. Patel at? Going a day. So there was another issue from the hospital, again, they weren't sure what was going on here and if it could have anything to do with the Fosamax. But I don't know, when you saw Dr. Patil, I don't know if you saw that you were in the hospital, I don't know if you looked at those notes. I can't tell from his notes, so, but you're still taking the Fosamax for the osteoporosis? Yeah. Once a week, right? Okay. The other thing, Olivia, they. No, actually. The bosmaps he changed every day. It's still, but the prescription is still the once a week prescription, the Fosamax. Okay. Do you think? Yeah. Because he only gave you 12 tablets to last for 3 months. Oh. So it should be every week. Okay, 2 months a week. I wonder if you're thinking of the acid pill. Maybe. Are you taking the acid pill, the pantoprazole? a day. 1 a day, okay. It's not, all of a sudden it isn't helping, well, it's just a real burning throat. You have a lot of burning in your throat? Yeah, just right there. Just more recently, you told me, because before you were having some hoarseness, and we didn't know if that was from acid, so we said let's give you this to see if it helps the hoarseness, I don't know. I still have the, I have to No, I don't, I don't know, it's, I take the pill, I don't do nothing. Do you feel like also you have heartburn or you just have the burning in the throat? Just the burning in the throat. Okay. And I get sick in my stomach. You have nausea. Yeah. Is that every day? The nausea? Just about. Just almost. Everything I eat, it just, oh, burns. It burns when you eat? Yeah, and then my stomach hurt, well, when I swallow.When you swallow, you feel what? Burning. Burning, okay. And then my stomach starts hurting. It starts hurting? Yeah. When you swallow? I'm a mess. Yeah, you're a little bit of a mess. As you met, Olivia, when you saw Dr. Omeya last time, he wanted you to do a little bit of blood work. Yeah, I've been able to get there. I know, especially recently, but I think it's because you were still thinking about starting Remicade, right, for your? They're not going to do that. My insurance won't pay for it. he just keeps insisting. What I don't know is, for example, because you failed the other things the insurance may pay for, but I'm not sure. Sometimes they'll pay for it if you failed the other things that he gave you. Yeah. But with your insurance, I'm not 100% sure. Yeah. Mm. Olivia, I know you don't feel good, did you want to get a flu shot or a COVID shot while you were here? Yes. You want to do both? Yeah. Okay. Yeah, she put the flu, I'll put the COVID in. Mm. You haven't been sick with COVID recently, right? No. The other thing, at the hospital, Olivia, they noted some breathing issues and they said, well, maybe we should give her this other inhaler to try. Yeah. I know you're using the albuterol as needed. How often do you use the albuterol? 34 times a day. Oh, you do. Did you know that they had sent another inhaler to the pharmacy for you? No. I told you, they tell me nothing. And when you use the albuterol, you think it helps you. Yeah, it's okay. Okay. The reason, especially if you're using the albuterol 4 times a day, the other inhaler that you take once a day, every day, may help ease your breathing so you don't feel like you need to use albuterol. It might be worth it. Real expensive. They won't pay for it. You tried to get it, or you know from past experience? I tried to get it. The one from March? Yeah. Are you saying you don't want me to send it in again? No.I can't afford it. Okay. Olivia, how are you doing with the restless legs at night? It's been really bad this last week. Worse this week? Yeah. How was it before then? It was pretty good. It was doing okay, okay. I think you're taking gabapentin still. Yes. Okay. Olivia, we do have to address your hip, but tell me if you have any other questions. So. I'm worried about your hip, I'm worried about your falling, and I'm worried about this thing, amongst other things. Well, the falling was my fault. I didn't wait for help. I could do it. Trying to turn too fast. Trying to turn and walk at the same, and step at the same time. Okay. And it's got overbalanced. So, Olivia, do you think you can, well. I guess it goes without saying, you are at risk for falling and so you really got to be patient. Yes. I mean, I don't know if you have a fracture there or what's going on, you can't put weight on it. It's either a fracture or bruised, it's not broken. Well, fracture is broken, that's what I mean. But you can't put weight on it, really? No, it hurts. Right in the back there? Yeah. Okay, is that where you landed? Did you land right on there? Right on my Didn't they say you had a fracture in your butt? I don't know. Yeah. You mean before? Yeah, I was. Well, she did have compression fractures in her spine, you know that. Yeah. That's the one. That's in my back. And just on a side note, they reminded me, you have this aneurysm in your aorta, but when you had the testing in March in the hospital, they did the test for other reasons, but they looked at that and it's not getting any bigger. So I'm trying to minimize other testing that you have to do. And because that was done in March, we don't have to repeat that, and it's not getting bigger, so. Because if an aneurysm gets too big, it ruptures, and then you die instantly, or fairly quickly. So, let's see, Olivia, let's see, this is what's going on. So it drains there?Uh-huh. Do you have pain there? When it wants to drain. Does it hurt now? It's like there's pressure right now. Does it hurt now? No. It's coming from your jaw. If you touch the area, there's pain. But I mean right now, does it hurt? I can feel it. But is that sore right there? Yeah. How about that there? Yeah. That's sore? Uh-huh. How about in the bone? No. No, just in the skin. So the bone right there is not too sore, but down in the skin it's a little sore, right? Yeah. Okay, let me look in your eyes for a second. You can leave your glasses on, I just want to look under your eyes, just like that. Okay, good. If you, Olivia, if you lift like that, does it hurt? Yes, no, I couldn't lift. Oh, that's okay? It's not too far. That doesn't hurt too much. Uh-uh. I put it straight out and then lift it to try to. I don't think I can do that. No. That hurts more? Yeah. Okay. And what about, Olivia, what if you do this? Look at my leg, like what if you go like that? Just push it out. Yeah, push it that way. Oh. But not, but from your knee, not from your foot. Like this. Olivia, watch my knee. Yeah, like that. Does that hurt? No. What if I do this? That's okay? Yeah, you know, it's, oh, it's beginning to hurt, it starts hurting right there. Does that hurt, does this hurt your hip? Yeah. That hurts your hip there? Uh-huh. Okay. Right in where your hand is? Uh-huh. Right in there? It's lower, oh, right there, oh. Right there? It's real painful, obviously. Yeah. Can I look in your mouth for a sec? I just want to see if we can see anything here. Okay. You're okay, you can bend over if you want. Sorry, Olivia, let me, my apologies, let me look in your mouth one more time, because I was focusing on your throat, say, ah, good. So you have a lot of burning when you swallow? Yeah.And the burning's in there somewhere, or is it more in your chest? No. [inaudible] And you feel it more when you swallow? When I eat. Oh, when you eat. And just sit and eat as I. Okay, so when you, also, you feel it also when you're not eating? Yeah. But you feel it more when you eat. Right. Is that right? Mm-hmm. Okay, so first things first is this hip business. I don't know if there's a fracture there. Fracture is the same thing as broken. Fracture can just be a crack or it can be displaced. It's a little hard to tell whether you have a little fracture there. And then the second thing is, you know, sometimes when you have a bad fracture there, sometimes it's surgical and sometimes it's not. With your lungs, though, people probably aren't going to be crazy about wanting to do a surgery anyway unless they have to. Normally what we would do, though, so we can help figure out what's going on and manage you the best we can is we would often get an x-ray. I don't know, but I realize this is difficult for you, but. I don't think I can. So one option is to See how you do over the next few days. I don't know, should we give you, like, for the, through the weekend, like some extra pain medication? Yeah. And then see how you do, but if you're not improving into next week, then I think you've got to do the x-ray. Because if you can't walk next week, I think it's a problem. Okay. Like I said, I think it's better. It don't hurt near like it did. It's 2 or 3 days ago? Yeah. Okay. Okay, so that's number 1. So we're going to not do the x-ray, but if you can't walk next week, I think we've got to, I'm not sure, maybe try to do an x-ray somewhere, but if you can't move, that's going to be difficult.Or, you know, if you really can't, if you still can't move and you can't get to an x-ray, then then probably, not that it's a great place to be, but in the ER, they have the people that can finagle you into an x-ray position and help you, right? So that would be our backup too. Okay. The second thing is... in no particular order, this burning you have in the, not really, push on me, do you have pain there? Just stomachache. Are you taking, you're not taking anything like Motrin, Aleve, anything like that? No. So it's unclear what's going on with your stomach pain and your burning in here, do you have an ulcer there? Is it just bad heartburn? I'm not sure. Yeah. The only way to really look in there, unfortunately, to for those kind of symptoms is like with a camera. Yeah. You know, do we want to send you to someone to take a look? No, I don't think so. Obviously not right now. Would it help if we increased your acid medication temporarily? Like to, I don't know, like to take it twice a day or take a Pepcid and then, you're taking the pantoprazole in the morning? Mm-hmm. Okay. I don't know if we added a second dose or -gist takes the one. Right, but I'm, one thing we can try is to have you take an evening dose and see if it makes a difference. Okay. But other than that, I don't know if there's much we can do, especially since we can't get you in for a scope right now. Yeah. The third thing is this thing. I don't know why they contacted this guy there. in Fairview, I don't know, he was on call. The good news, now does it puff up sometimes pretty bad or does it just stay like that? No, it just gets, I can feel the pressure. So sometimes you have more pressure than this? Yeah. But it doesn't get as bad as March, right? Oh no. But it fills up, because right now it's pretty small. Yeah. But it's still draining. Yeah. So again, we want to do as little for you that as necessary, right?We don't want you to have to have a procedure or a surgery if we can avoid it. Yeah. Obviously we'd rather not have this thing, but, so I'm going to send an email to the guy that's not even in the hospital. It itches. It itches, do you put anything on it for the itching? Yeah, just some hydrocortisone. Sounds like those are real small Thank you. It's just not clear. Is that hurt there? No. Just in the skin. [inaudible] Okay. Let me back up to your stomach for a second. Are you having any black stools? No. The Percocet you take doesn't bother you? Or does it bother you? No. You take 4 a day right now? Yes. Okay. Sometimes just 3. 3 or 4. Do you guys ever do video visits? Yeah. You can do video visits? Okay. So Olivia, I'm going to send that in, plus I'm going to send in something for the nausea, and then for the pantoprazole, I'm going to increase it to twice a day. Right x-ray, right hip. Okay, let's see. She's going to come do the flu shots and the COVID shots. She's going to give you the x-ray order. Obviously, we're not going to do it right now, but if we're not improving next week, that will be plan number two. If you still can't walk and you can't make it to the x-ray, as much of a pain in the you-know-what as it is, it's probably worth going to the ER so they can get it done and triage you and so on. It may just be a matter of pain management for this for now, but... And we'll also, as I said, so I sent in a little more pain med, we're going to increase the Pantoprazole to twice a day. I also sent in something for nausea to see if it helps. Okay. I know you're not in the mood for questions, Olivia, but do you have any questions? No. At the moment? Okay. I think what I'd like to do is... have for, just do a quick check-in video and like, you know. and follow up for this thing, see if there's anything else we can do.Oh, you mean for this? Yes. Yes, no, I know. If we can avoid you going to Fairview, I don't think I have to go to Fairview. Okay. So the first thing I need to find out from, this is, hopefully he'll remember, is why, was it only because that guy was on call and he knows the story? Or. Is he enrolled between the Thomas Edison? Or is [inaudible] Thomas Edison? No, it's not a Thomas Edison thing. So this person, so the problem is they are worried about your jaw. And this person is what we call an oral maxillofacial surgeon. So he's different than a regular ENT. And so the question is, it might be number 1, that he was just on call here, maybe he does call once a month, or it could be he's the only one in this area that can do this, I don't know. Yeah. So that's why I want to email the doctor in the hospital and say, why this guy? Yeah. So we can figure it out, okay? All right, she'll be in soon for the shots. Okay. And the follow-up video. Thank you. Okay? Hang in there. And when I spend time over there, it rubs off. It's like I was just like, yo, everything is yo. And I'm like, yo, y'all talk to me like that. What? on a US Geo site, or what site did it go on? [Inaudible] Oh, it's the [inaudible] I don't remember it is. It looks like you can, like, do all of the internet standards. I'm just curious, because I went on to see that, like, the U.S. government, I think it was [inaudible] some other thing. Yeah. And it looks like it's all the earthquakes. Oh, that earthquake I'm saying is that right? And there's like a basilarity of the U.S. side of the border with Northern California today, but I don't know. Yeah. He and his sister lives up there, and we just called her, and she said it was pretty intense. Oh, okay. She said that was the worst. Yeah, she said all the earthquakes are going to be awful. Yeah. I'll be, but I can tell.I was just talking to my husband, because the girls are in the show, but I get it. I feel like. What I understand is like if you are right on the coast of the ocean, it can be pretty intense, but. No, no, I just have you. Like a day. Well, we can all use, but I want to give you some. I know. Not an answer. Logically, it seems that with the land mass of San Francisco and all that. My brother-in-law's in San Francisco, and my sister's in San Francisco, and so. Oh, yeah. They were waffling on it, yeah. Oh, interesting. Because they are, they're on a, whatever, they're on like a desert floor. Yeah, I guess that's, it's hard to imagine, because that's not really here, yeah. That's on the bay side, not the ocean. I mean, that's, yeah. So, physics. Happy holidays. Merry Christmas. Oh, because of it, [inaudible]. Because if they don't cancel tomorrow, my note will disappear. I was concerned, so I across the street at a meeting. I kept taking the [inaudible] Yes, but the problem is. I could have played pickleball for another hour, I came straight from pickleball to get here on time. I think that I played for an hour and a half this morning. The problem is, because they canceled already your appointment tomorrow, I have a whole note pre-prepared, and it's gone. Oh, shit. It's not your fault. What kind of note? I do want to know what's added on top. I had all the info, everything I was going to ask, [inaudible] just vanished into the. I'm sorry. But it's okay. He never, apparently his office didn't set up for him [inaudible] just use your own clearance form. So this is? This is for my foot. Oh, which doctor? Sibeli. Sibeli, okay. Sibeli, S-I-V-A-L-L-I. Right, Sibeli. I've been trying to call him for the last few days, and [inaudible] the 13th. 13th, well.He had a cancellation, so I was able to do that in October, give me a lot more time between that and the nose surgery. And the other one? The other one's now scheduled for the 18th. And I have an appointment, when were you on the 31st of October? November. November. Okay. They gave me an October, but that might be a little too close to it. I don't know if you had something just a few days earlier. Originally, we had the 16th, but that's too far out. It's more than 30 days. Right, they wanted it to. Yeah, I don't know if you have anything earlier in that week, so it's 3 weeks rather than 2. Well, I have more of them. Just in case there's a problem? Cancel? I hope there's no problem this time. When's your appointment? 1:25? It's the 31st, it's at 3 o'clock too, it's an afternoon, so I guess I've got the traffic going on. I don't know if you have any 11:30s available. We'll sort it out. Did you need this? I think I gave you one of these when I thought I was going to do the other, this is all previous surgeries. I think he did. He didn't ask for it, but you should have it in your records, but if you don't, I keep it on my computer, so you can keep that, I don't care. I'll keep it, and then I'll update my list with your list and see if it's. Yeah, I mean it's a long list, so I never fill in those forms with it, I just attach this. Yeah, no, that's fine. Can I have this? Absolutely. And I won't. I have all my medical stuff on my computer, and the December, December is stuff in medical, and it's all there. Okay, so this is, tell me the surgery he's doing. Okay, he's going to correct what the first guy screwed up. On this toe. Your left big toe. Yeah, I'll show you what a mess it is. Left. Okay, do you see this? Big toe. Okay. Yeah. When I started, there was barely a bunion there, but I was having nerve pain across into here.Okay. And Simile initially had said, just have to shave this down a little bit and then I'll get therapy to do the nerve. So he wasn't available, and his office actually gave me the name of this other guy, Swift. in Swift, who's in, who supposedly is decent, I mean, the guy who did my anesthesia said, oh, I've used him, he does my feet. I don't know, for whatever that's worth. He really did more than what was necessary, according to Harper. He said, why on earth did he do a foot bunionectomy on your foot? It didn't meet it. So what does Harper do? So Harper now, well, what there is now, there's like a little wedge here that he left. Yeah. There's a ledge there and there's a bump here and he said he still thinks that the pain I'm feeling is all connected to this nerve. Okay. And he said- He said, all I want to do is shave this down so you don't have this bump on top and figure out, you know, smooth out the ledge that's here. And then he said, if there's any scar tissue in there, which there probably is, I'll get rid of it. I just wish I had gone back to him to begin with. It was just, just, you know, it was a timing thing because he didn't have any surgery dates available for months and I wanted to get it over with, you know? stupid on my part, but this is what I'm left with. Okay, and is he doing this in his office? No, at the surgery center. At the Pine Surgery Center. Okay, and it's under local and as well as local. Local with sedation. Sedation plus local. Yeah. And like a colonoscopy plus pain. Exactly, that's what I had the first time on this. Plus a local pain killer. Well, they wanted to do a general for this and I said no, so they did local sedation for it the first time too. so be local. And sedation, which is the only reason I would do this now after having the pneumonia, because I thought you said I should wait at least a month, as Hunter did, a month after pneumonia before doing general anesthetic. He did, when I saw him.It's always good to not have general anesthetic, once you really need it. Yeah, well, I'm looking, I know, as I [inaudible]. Yeah, that would happen. Up there, they have. Okay. First time I had it done when I was 15, when I had a nose job. Just sedation? Not even sedation, they did needles all the way up to numb it for them, it was that awful. And they used to do it in the office. Oh my God. Park Avenue doctor, Dr. August, I still remember. It was very painful. I guess that's the safest way, but most uncomfortable. That's what they all used to do back then. All my friends who had it done also the same thing. Anyway. Oh, okay. That just sounds cool. It is, it was. I wouldn't have it do it again. -littered up or? Everything's fine. I'm still getting a little dizzy here and there. Still having the slight. It's kind of the thing that goes along with when I get the tinnitus, which I still have on my left ear a little bit on and off. Okay. You know, I was doing the Epley's for a while, the Epley window, but that usually helps. So surgery, so you haven't had, not that you're having general anesthesia, but you haven't had any trouble with anesthesia, sedation, bleeding, right? Well, bleeding I have to stop the Xarelto a few days. You have to stop the Xarelto, usually. 3 days. 3 is plenty, they say 2 or 3, 3 should be plenty. Well, I'm going to have to get a note from Savage now, it says whoever the prescribing doctor is has to send them a note that says that you can stop. That? I mean, Sibeli? Sibeli, that you can stop the blood thinner. And in the past, the only thing Savage has written is, usually 3 days, but it's up to your surgeon. That's what he wrote the last time I asked him for something. I don't know if you can do it because you didn't prescribe it. I mean, if they'll take it from me, I don't care.It said prescribing, you know, it's on his thing, it says prescribing doctor, I don't care. Personally, I think it's silly, I know 3 days is okay, that's what I've done for all of them. I mean, 2 to 3 days, 3 days is the extra cost. I've done 3, and you know, I don't have anything going on with my heart right now, I have No flutter, no, the AFib is completely gone, it's been gone for 2 and a half years now I haven't had AFib since the last ablation. Actually, what I might do is I'll just send him my note, and in my note it'll say, stoms are out filled 3 days before. Okay, well I can write to [inaudible] send it on the system and I can [inaudible] and see if it would be, if I get through his office [inaudible] This office, this is very strange. Either they're on vacation or something's wrong with their phones because they always pick up right away. Oh. It's very odd for them. For 3 days that I've been trying to get them and they don't pick up. Nobody picks up the phone. I keep getting a message. And he doesn't have a partner, right? He does. Oh, really? In home care, so, but not in the breakfast place. Okay. But it's odd because his office is very good about picking up the phones. Well, I have his cell number. If I go another day, I may, I've never used it, but I may just call him in case there is a problem with their phones, they should know about it. Yeah, you know, most of the stuff is stuff I just keep around, although I'm sure that for this he's prescribed some opioid, which I think I still have it. Crestor you're not taking it, Nexium you're not taking it. Nexium, I just, I've been trying in the last couple of weeks not to, I was taking it every other day and I'm trying not to. Okay, should I take it off your list? Yeah, I mean if I have to I'll start it again, but. Take it off.And since I've lost the weight that I lost, it seems to be a little better. I'm keeping off the weight I lost over being sick. Down about a couple pounds since I was here last. I'd like to lose another, you know. And nothing new going on, right? No new, absolutely that cleared up. No new fever, insurance, but nothing new. So nothing is going to happen in the next week. I took a welcome out of here this morning. I would have done 2 if I hadn't had to appear and phone. Your place has a court, right? Yeah. You don't have to travel, it's in your complex. No, we play both days, no. 3 days a week we have open play, and that's what I've been doing, and then Sunday I could sign up for another day, but I'm not quite sure with my foot, because my foot hurts after I play. Okay. So the third, you know, what When we clear people for surgery, well, how did surgery go before? Do you have any new symptoms that bothers, and then the third thing is, do you have any medical problems that would get in the way of surgery? No. No. You have these things, your heart's been fine. I don't, I haven't had the PACs lately, I haven't had anything. So you've been okay. PACs, PVCs, I have had nothing. Well, you see, you can play pickleball, your meds are good, you're not worried about that. Okay, so. I played for an hour and a half straight today, too, I didn't get any breaks because we were an even number of people, usually if it's an odd people, odd one, it's almost waiting. [inaudible] No, we have a sign-up board, and you just, 4 to each box, and you just sign up, and sometimes you have to wait, you know, 5, 10 minutes if people have just started and there aren't enough. But today there was just an even number, so we just kept playing. this right now, but I could do Sundays as well. I do feel like. A little tickle right there. Still, that's the remnant of what I had. Of what you had, okay. Yeah, but still a little bit.I'm going to listen here, you just relax. any of the [inaudible] No, I'm good. Okay, good. The red color is to throw off. I figure if I can miss a shot, they'll look here and they'll miss one. Where is it at? Good. named Said, [inaudible] Said to take a probiotic, just with it, because it tends to upset the stomach, and he said that will kind of bring back whatever bacteria it gets rid of, it brings back the good stuff, whatever. I think [inaudible] stomach, I mean I put the mice in, my stomach is very upset, it did not, at all. So for whatever it's worth, and my stomach has been a lot less tender than usual, so I kept Taking it. What are your thoughts? So, it's a fascinating and very complicated subject. So, this idea of a microbiome, right, is in our intestines, mostly bacteria, some viruses, and fungus. And it's been a long time coming, but the general medical community is starting to accept that it's a very important part of our health and has a big influence on our health, or potentially. But it's a fascinating subject, getting the mix of bacteria in your intestines is helpful, but it's very hard to do. And this is why I try to avoid antibiotics if possible. No, in this case, yeah. I mean, if there's any way not to, if you have to, you have to. So the question is, well, how do you fix it? So, you know, it's probably not as simple as taking a probiotic pill, but there's not, but as long as it doesn't bother you, there's nothing wrong with it if you think it's helping, and some people do take them and they feel, they do feel like they're getting better. I feel like my stomach's been less tender, less upset, and my stomach gets upset very easily. If it's not harmful, I would keep doing it for a while. No, keep. It's the Walgreens, brands, and whatever. Keep doing it. [inaudible] doctor in Congress, he's been sort of doing this for 15, 20 years, everyone's out of here.So he does go a little overboard, almost everyone comes into his office, because he gives them, he recommends this whole regimen of supplements and prebiotics and probiotics, and it ends up being some $100 worth, but some subsection of people that do this feel a lot better. Well, while I was on the antibiotic, he had me on 2 a day when they're called for 1 a day, so I cut it back to the 1 a day and that's what I'm doing. Definitely continue. Okay. But then, more likely to do benefit than harm. Okay. Okay, so we will send. Certainly, whatever your clearance is. Now, do we need to send it to his Brookfield office or does it matter? I don't think it matters. Okay. I don't think it matters, whatever number you have for him, I don't think it makes any difference because he's doing this in Maple Valley anyway at the Pine Center, so. And then. He's only in Brookfield once a week. Not that you need labs, but you have labs, just in case. I have them. You have them. No, you do, actually. They wanted labs within 30 days. Okay, that's dumb. And since we have them already. It's dumb, but. It's dumb because it's not. That's right. It's not. Just like, do we do labs? It's a localized head. We have a colonoscopy. No. Which is sedation. No. I don't know. He claims it's Pine that requires it. I don't know if that's true or not. I don't know. Whatever it is they've done, so it doesn't matter. I filled out a whole long form for Pine, by the way. You did? It was like 5 or 6 pages worth of everything. I had to do that when I had gone off. Okay, so I'm not worried about it. I will send Harper what he needs. And if they want the labs, I mean, they can do it right on your site. Well, I don't think they have it. They don't, right. So I'll send it to them. Okay, that's fine. Send labs just in case. And send it in. And as long as we're doing this, so I guess we can wait.Since I haven't updated EKG, because they were on one within 30 days, my other surgeon, since we haven't updated them, [inaudible] him the updated EKG? He doesn't require another one. Send, right, I mean, should I just, but I'll send it to him when I. When we do the pre-op. Yeah. Yeah, send him another, we just did some, he has a more recent one, and the last one I had was like from June, I think. 100%, okay, so that, sorry, that. That one? Surgery is when? November 18th. November 18th. Let me check my phone. -I just called, she never calls during the week, I'm wondering if she gave up her job. I'll have to get back to her, she was. Wait, so your current appointment with me is when? The 31st, and it has to be within 30 days, so, but I thought that was pushing it a little bit. Coming April 2? It'll be like the 23rd at noon? Does that give us 30 days? That's a Thursday, 23rd. September, October 23rd. You said November 18th, right? Yeah, so is that I don't think that's enough, I think that's 2. No, that's like 300. Is it? 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 1, 2, 3, 4, 5, 6, 7, 8, it's 28 days. I'd rather do it a couple days later just in case for some reason and he pushes it out, because he operates on Tuesdays, Wednesdays, and Thursdays, if for some reason he changes it, that way I'm within his thing altogether. Do you want to do October 28th? Yeah, let's do that. And 12th? I have something, oh no, I have Dr. Cohen for my eye on the 28th.I've got a cataract going on that I think has to be done, so the 28th I can't do. And how do you [inaudible] 29th? I mean, I was glad that you don't want [inaudible] 27th, 29th. I don't know if I have to do that. I have the 31st. Well, that's what we already have. Oh, no, I'm sorry. I have the 24th. Wait, I was looking in the wrong thing. Hold on. I don't even have the 23rd. Oh, I see the 21st. No, that's 2. I see 1 of it later. I have the 24th and 12. All right, why don't we do that? I have Harper down, but that's because that was the original one. That's disappearing. I'm going to do 20 foot. or did you say you have something on the 24th? No, I originally had the surgery on the 24th. That's gone. You have another appointment on the 28th. The 28th is Dr. Cohen for my eye. You want to do the 24th? 24th or 27th, or you don't do Mondays? I don't have anything available. Okay. In the morning, I think. All right, let's do the 24th. I think that's safe. That gives us like 17 days or something, I think. Or 27. 27? Yeah, that's fine. -I heard your math is on. The 24th, how many days in the week? 3, 6, 7. That's 25 days. That's 25. 19, 21, 2, 3, 4, 5. That's fine. Yeah. So we're going to do October 24th instead of the 31st. Let me just change that. At what time? 12. whatever. 10, 12. I'll just put down 11:40, 11:45. Sure. 11, what did you say, 11:50? Sure. Okay, that works. Thank you. [Inaudible] Good luck, hopefully time number 2 will be the trick.And then he texted me, I said, how long until I get back to Pickle Boys? 3 weeks. He said, this, you know, I'm not putting anything in there, I'm just shaving it down a little bit, it should be okay. He said, it's based on your pain, if it doesn't hurt, go back. And the other one wanted like 2 months. Yeah. I just, yeah, I think that I'm just. You know how to get out of here, right? I do. All right. Oh, I'm sorry, thank you. Oh, so you're just sending him the [inaudible]. Yeah. Because he said that's fine, he said whatever he has is fine. [inaudible] uh, them. I [Foreign] Roll it up for me, little man. It actually is, because I can normally just right click and block it, there's a little setting here. And you can't block it at all, like, can you put any block on it? Like. I can put a test [inaudible] Make it a third. [inaudible] The chart that you gave me says yes tomorrow. Right. So we'll get it out. Right. So I tried calling you, and I called the MAs, and eventually they just said, yes, do it. What should be the standard? Say, just flat out, no. So here's the thing. Not everyone comes in on a few, so this wouldn't affect hardly anyone except me, so it might not be. Well, I meant the standard for you. I guess for most- Right. second appointment in there, they will enable us to know she's in there, but she's coming today. And that way, what I can do is I can then go in, copy my notes, and then I can read it today. Then delete it in there? Or, no, just after I've seen her. Oh, okay. But I'm going to reach there's much you can do about it, I'm just saying that's what happens, whatever, she was like Oops. Tee dee. Tee dee. Tee dee. Tee dee. Tee dee. Tee dee.","14":"69-year-old woman here for a new patient evaluation of microhematuria. Her urinalysis today shows moderate blood with no evidence of bacterial growth. 69-year-old woman here for a new patient evaluation of microhematuria. Her urinalysis today shows moderate blood with no evidence of bacterial growth. Hello, good morning, how are you? Good. Good. I'm Dr. Harris, it's nice to meet you. Hi. Wonderful. Welcome, how can I help you today? Mm-hmm. Hi, Dr. Harris. Hello. My daughter. Hi, how are you? Hi, good, how are you? Good, thank you. Just coming in, introducing myself and wondering how I can help. Okay, so visible blood in the urine. No. No. No. In the lab. In the lab only. Only lab. Okay, I understand. And for how long, more or less, has it been happening? This has been happening actually the first time when she was in Iran. Okay. 2 times in the lab. Okay, well it's present today in the urine as well, but I'm relieved that it has not been visible and she's not seen any clots or any other material coming out of the bladder. And right now the mama, we give me, and today I don't draw a doubt. She just did one, how long does it take for the result to come back? It's there now, I've looked at it already, there's blood in the urine today. So, it does not take very long for that result to come back, but there's nothing to suggest an infection. Is there any family history of cancer? No. No, and has she ever been a smoker? No. [Foreign] Never. Got it. Okay. And how many pregnancies? Four. Four. And C-sections. All C-sections. No. One natural, three. One vaginal, three C-sections. Okay. And is there any sensation of tissue protruding from the vagina? Yeah. as well. Okay. When what? Too much? Standing, standing on the vagina. Standing too much, okay. Well, there's some pelvic pain and pressure, but is there any protruding tissue? What does that mean? Pushing out, as though a baby is coming out. Some tissue pushing out of the vagina. [Foreign] Yeah, she's saying whenever I stand too much, it feels like something wants to come out of my. Okay, well, at the next appointment, I'll be able to have a closer look. What we're going to recommend is what's called a cystoscopy. That's an appointment to look inside the bladder with a little camera to make sure that there's nothing concerning within the bladder. She doesn't have it anymore. Okay, that's also important to know, but no, cystoscopy is relating to the bladder. Okay, so you just like look at the bladder to make sure there's no extra stuff? Tumors, I'm looking for tumors, okay? So, when there's blood in the urine, we're concerned about a lot of things, and 2 important assessments need to take place. one of them being Assessment of the kidneys because blood could be coming from the kidneys the ureters the bladder the urethra any of those locations and so Imaging of the kidneys or the upper tracts as it's called needs to happen and then direct Visualization of the bladder with a little camera. That's called a cystoscopy. That'll be done at the next appointment In the meantime, we'll need to do an assessment. We'll send her urine out for for testing to make sure there are no unusual cells there Does she have any urinary symptoms or bother? bother? Is she bothered by her urination? [Foreign] Sometimes. Okay. No. Uh-huh. Sometimes. Oh, sometimes. Yeah. Okay. Yes. No. Uh-huh. And when did she go through menopause? Oh, it's been a long time, 50 years, 48, 50, 50. 48. 48. Mm-hmm. Okay, and when was the uterus removed? [Foreign] 10 years. 12 years. 12 years ago? Uh-huh, yes. Okay, and why was it removed? Because she had a lot of bleeding. A lot of bleeding. And was there anything abnormal in the uterus when they took it out? No. Okay, has she ever had any hormone treatments after menopause? Yeah, [Foreign]. Yeah. So she was on oral hormone treatments for a period of time? Yeah. And then when did she stop those? Yeah. They said it's not good for cancer, so stop taking it. Okay, but there was no suggestion of cancer in the uterus when it was removed? No. Okay. Yes, and is there any history in the family of kidney stones? [Foreign] Uh-huh. Okay. Well, all the more reason for us to make sure that we look into any sources of bleeding. [Foreign] I don't know. [Foreign] I don't know, I don't know. I don't know, I don't know. I'm sorry, I can't hear you both. Sorry, would you repeat what you said? was the bleeding of the kidney, that's all she knows. That's all she knows, okay. All right, well, what I would recommend, as I mentioned before, is that we get imaging of her kidneys to assess to make sure there's nothing abnormal there, and then she. comes back to look inside the bladder. In the meantime, if she sees a gynecologist, that may help with her pelvic pressure, but if I see anything out of the ordinary when I do the cystoscopy, we can discuss how we can help with that. Thank you. So the imaging is going to be x-ray or MRI? CT. It is [inaudible]. Yeah. Yep, we'll give her the order at the exit and an appointment to come back to talk about the results and to look inside the bladder. Got it, I appreciate it. Of course. She'll call you again, I suppose, when she's at the exit, but hopefully to help arrange for the next appointment and understand the imaging request. I'm going to stay on the line. Okay, well come on this way. Yeah. Well, it won't really matter until we get the imaging, so she'll need to get the imaging as soon as possible. And that's... Can I [inaudible] ASAP? Yeah. Can I meet you next week? Probably not next week, but soon after that, when might she be leaving? Fourth of January. Okay. And how long will she be there? [inaudible] Okay, well, we'll see how quickly we can get the look inside scheduled. I really appreciate it. Of course. Thank you. Hold on, let me put that order in and then I'll come get her. Here, we'll go down to..."},"HPI":{"0":"Mark is a 72-year-old male with a history of anxiety, presenting for follow-up.\n\nMark reports increased irritability over the past several weeks, particularly noted by his wife. He acknowledges being more \"short-fused,\" \"snapping,\" and \"not real patient,\" especially with his youngest son, which is atypical for him. He attributes some of this irritability to inadequate rest, stating, \"I need to get my rest, otherwise I'm irritable.\" He does not notice this irritability in other settings, such as playing pickleball or at work, where he interacts well with others.\n\nHe recalls a period during which his wife felt he was doing better, which coincided with seeing a clinician named Emma Clarke. However, he does not believe he tolerated the medication well at that time, experiencing nausea and vomiting in the mornings. He is currently on mirtazapine 7.5 mg and is open to increasing the dose to manage his irritability.\n\nHe also mentions a high-stress situation involving his son, who has autism and experienced a medical emergency. This event contributed to his stress and irritability, as he had little sleep and was not eating well during that time.\n\nHe expresses interest in counseling to help process his emotions and manage irritability. He is open to a referral for counseling services.\n\nHe denies any suicidal thoughts and reports enjoying his job, which involves working outdoors and interacting with people. He finds satisfaction in his work and appreciates the positive feedback he receives from the community.","1":"Patient is an 85-year-old male with a history of HTN, CKD, anemia, and AFib, presenting for evaluation of bilateral lower extremity edema and pain, and back pain.\n\nBilateral Lower Extremity Edema and Pain:\n- Onset of bilateral lower extremity edema and pain from hips to calves x1 week.\n- Describes pain as \"pins and needles\" sensation, exacerbated by ambulation.\n- Denies known trauma or injury.\n- Denies recent medication changes in the last 2 weeks.\n- Denies worsening dyspnea, orthopnea, or chest pressure.\n- Denies falls in the past year.\n\nBack Pain:\n- Onset of left-sided mid-back pain coinciding with lower extremity symptoms.\n- Believes pain may be due to twisting movement.\n- Pain exacerbated by certain movements.\n\nHypertension:\n- Home blood pressure readings range from 160-180\/70 mmHg.\n- Heart rate approximately 50 bpm, improved from previous readings in the 40s.\n- Recent medication changes include discontinuation of lisinopril, metoprolol, and carvedilol due to severe diarrhea.\n- Currently taking diltiazem and amlodipine.\n- Upcoming cardiology appointment with Dr. Kim in 6 days.\n\nChronic Kidney Disease:\n- Recent ER visit 3-4 weeks ago for hyperkalemia; advised to discontinue lisinopril by ER physician after consulting with a nephrologist.\n- Recent labs show stable kidney function and normal potassium levels.\n- Upcoming nephrology appointment on March 5th.\n\nAnemia:\n- Undergoing regular monitoring with Dr. Fernandez.\n- Recent bone marrow biopsy showed a small monoclonal plasma cell population and a genetic deletion in one chromosome.\n- Possible early dysplastic syndrome or MGUS.\n- Next appointment with Dr. Fernandez in April.\n\nAtrial Fibrillation:\n- Managed with Eliquis and propafenone.\n- Has a loop recorder in place.\n\nHearing Loss:\n- Reports difficulty distinguishing sounds, but has not pursued hearing aids.\n- Has been tested for hearing loss in the past.\n\nLifestyle:\n- Consumes 1-2 alcoholic drinks per week.\n- No recent falls.\n- Memory described as stable with occasional word-finding difficulties.\n- Attending a workshop on advanced directives and trusts.","2":"The patient is a 66-year-old male with a history of prostate cancer, CAD, and SVT, presenting for follow-up. The patient has a scheduled prostatectomy. He was diagnosed with prostate cancer following a biopsy that revealed three areas of concern, with one area rated as a 3 on a scale of 1 to 5, indicating moderate risk. A subsequent PSMA PET scan showed no evidence of metastasis. The patient has not yet informed his daughters about the diagnosis but plans to do so before the surgery. He prefers surgery over radiation due to the potential need for hormone therapy and the inability to perform surgery after radiation. He is aware of the potential postoperative complications, including the need for a catheter for 10 days and possible incontinence.\n\nThe patient has a history of increasing PSA levels, with the most recent reading at 7. He also has a history of a bladder growth removed a year ago, which was benign. He is currently taking atorvastatin, metoprolol 12.5 mg daily, and a baby aspirin. He also takes vitamin B, vitamin D, and folic acid supplements. He uses a CPAP machine every night for sleep apnea. He denies any new symptoms such as fevers, dyspnea, or high blood pressure. He reports good functional capacity, able to walk up a flight of stairs without dyspnea. He has a history of a catheter ablation for SVT in 2014 and an angiogram in early 2021. He also had a bladder biopsy in November of the previous year, after which he developed blotchy spots on his forehead and bald spot, which a dermatologist identified as bruising rather than a rash.\n\nThe patient reports a recent episode of ankle pain in August, which lasted for 3-4 weeks and has since resolved. However, he still experiences occasional pain on the lateral side of his shin and the ball of his foot, described as similar to shin splints. He also reports chronic pain in his left elbow and occasional neck pain, which he attributes to stress and poor sleeping posture. He denies any worsening or new low back pain. He has resumed walking and exercising after a period of reduced activity due to recent medical procedures. He reports normal bowel movements after a period of constipation, which resolved with the use of Metamucil. He is up to date on his vaccinations, including COVID-19, flu, tetanus, and shingles.","3":"Annual Wellness Exam:\n- Recent Pap smear performed.\n- Recent mammogram performed.\n- Recent corneal abrasion.\n- Denies chest pain, palpitations, abdominal pain, hematochezia, melena, rashes, or new edema.\n- Denies any limitations in daily activities; reports feeling \"really good\" overall.\n- Recent fall resulting in wrist fracture; plans to resume exercise post-hip surgery.\n- Recent weight loss of 28 lbs.\n- Denies any new or worsening symptoms related to chronic conditions.\n\nPre-Op Evaluation:\n- Scheduled for right hip replacement.\n- Previous hip surgery in 2014 without complications.\n- Recent labs completed; awaiting results.\n- Plans to discontinue Wegovy two weeks prior to surgery.\n- Denies any issues with anesthesia or bleeding during previous surgeries.\n\nURI Symptoms:\n- Onset 11 days ago, with persistent rhinorrhea and postnasal drip.\n- Occasional cough causing urinary incontinence.\n- Denies fever or dyspnea.\n- Taking Sudafed sinus and allergy medication.\n\nDM:\n- A1c reduced from 7.0 to 6.2.\n- Managed with Wegovy, currently on the highest dose.\n- Denies significant side effects from Wegovy.\n- Regular eye exams performed.\n- Recent labs show slightly elevated hemoglobin, fluctuating over the past few years.\n\nNeuropathy:\n- Reports numbness and tingling in feet.\n- Managed with gabapentin.\n- Denies any new or worsening symptoms.\n\nHyperlipidemia:\n- Managed with medication; adherent to daily regimen.\n\nOsteopenia:\n- Not currently taking vitamin D or calcium supplements.\n- Plans to start taking a multivitamin and vitamin D3.\n\nDepression:\n- Managed with Lexapro, trazodone, and Ativan.\n- Reports stable mood.\n- Considering tapering off medications.\n\nTobacco Use:\n- Smokes 5-10 cigarettes per day; abstained for the past few days.\n- Expresses desire to quit smoking.\n- Previous attempts to quit included cold turkey and nicotine patch.","4":"Patient is a 62-year-old female with a history of rheumatoid arthritis, presenting for follow-up regarding iron deficiency anemia.\n\nIron Deficiency Anemia:\n- Taking 3-4 ibuprofen tablets daily for pain management.\n- Expresses reluctance to undergo a colonoscopy due to a previous negative experience with the procedure.\n- Denies any current abdominal pain.\n\nRheumatoid Arthritis:\n- Reports current medication is effective in managing symptoms.\n- Receives Prolia injections at the rheumatology office.","5":"Patient is a 7-month-old female presenting with URI symptoms, including wheezing, congestion, and cough, that began yesterday afternoon. Patient's mother reports that she began experiencing URI symptoms yesterday afternoon, including wheezing and frequent coughing. Last night, she developed loose congestion, which partially cleared before bedtime. She slept well but awoke this morning with persistent loose chest congestion, wheezing, and a high-pitched whistle. She also had a runny nose, watery eyes, and was lethargic. Her temperature was 98.6°F this morning. She ate normally but took an unusually long 2.5-hour nap. She has been drinking her bottles as usual and had a normal appetite, consuming two eggs, cheese, ground turkey, and green beans today. She denies vomiting, diarrhea, or abnormal stools. She received the RSV and flu vaccines. No known exposure to RSV at daycare, and she has not been informed of any current cases. She has not exhibited signs of difficulty breathing, only a raspy sound when breathing. She has been trying to crawl and stand but fell backward a few times this morning, which is unusual for her. She has also lost her voice and has a mild diaper rash, for which Desitin is being applied.\n\nPatient\/legal guardian\/accompanying adult have been advised and gave their verbal consent to the recording for the purpose of transcribing the visit into the patient's medical record.","6":"Patient is a 67-year-old female presenting for evaluation of right knee swelling and vertigo.\n\nRight Knee Swelling:\n- Intermittent swelling in the right knee since 1\/12.\n- Swelling varies with duration of standing; sometimes localized to the posterior knee.\n- Recent episode of significant anterior knee swelling, described as \"huge.\"\n- Associated pain with swelling.\n- Recent x-ray in November showed mild right suprapatellar joint effusion.\n- Denies known trauma.\n\nVertigo:\n- Recent episode of severe vertigo lasting 24 hours, described as \"spins\" when eyes were open.\n- Occurred after a weekend trip to Yosemite; began Monday night.\n- Vertigo experienced in various positions: lying down, standing up.\n- Describes sensation as \"complete spins\" with associated nausea.\n- Similar, less severe episode occurred previously.\n- Denies alcohol consumption prior to the episode.\n- History of migraines.","7":"Patient is a 52-year-old female presenting for an annual wellness visit.\n\nAnnual Wellness Exam:\n- Has not had a physical exam in a long time.\n- Plans to travel to Singapore in a week and will return in the summer.\n- Regular exercise, especially when in Singapore.\n- Husband is a professor; patient is developing a biosensor for ocular toxicity testing.\n- Received COVID booster; denies receiving flu shot this year.\n- Received shingles vaccine.\n\nMenstrual Cycle:\n- Recently stopped taking birth control pills x2 weeks.\n- Recent menstrual cycle was regular and not heavy.\n- Previously stopped taking iron supplements due to improved blood work.\n\nMammogram:\n- Last mammogram showed a benign lump; advised to return to normal screening schedule.\n- Scheduled for a mammogram in March but will be abroad.\n\nColonoscopy:\n- Has not had a colonoscopy.\n- Considering scheduling a colonoscopy upon return from abroad.\n\nPap Smear:\n- Last Pap smear was approximately 5 years ago.\n- Plans to get a new gynecologist for future Pap smears.","8":"Patient is a 47-year-old female with a significant past medical history of lupus, non-alcoholic fatty liver disease, chronic GERD, generalized anxiety disorder, opiate dependence, fibromyalgia, migraine, COPD with asthma, type 2 diabetes mellitus, depression, and hypothyroidism, presenting for follow-up on kidney function and other health concerns.\n\nPatient reports experiencing tenderness in the kidney area and notes that her urine is consistently cloudy with a greenish-gray color. She denies dysuria, urgency, or frequency. She has not yet been seen by urology despite multiple attempts to schedule an appointment.\n\nPatient has been dealing with pneumonia, described as \"walking pneumonia,\" which has been persistent and difficult to resolve. She reports associated chest pain and shortness of breath, which have not improved. She is scheduled to see her doctor next week for further evaluation.\n\nPatient has gained 16 pounds since her last visit, now weighing 186 pounds. She attributes some of her symptoms, including nausea and vomiting, to her Benlysta injections. She is currently on Mounjaro for diabetes management, with a recent A1c of 6.5%. She is also taking multiple medications for pain management, including imoscontin, oxycodone, Celebrex, gabapentin, and hydroxyzine. Her hypothyroidism is managed with levothyroxine. She is currently taking furosemide 20 mg twice weekly as needed for swelling.","9":"Patient is a 54 year old female presenting for a follow-up visit regarding hormone therapy, medication review, and recent postmenopausal bleeding.\n\nHormone Therapy:\n- Patient has been on hormone therapy for about 5 months.\n- Currently on estradiol patch 0.0375 milligram twice weekly and progesterone 200 milligrams nightly.\n- Recently reduced estradiol dosage from 0.05 to 0.0375 due to postmenopausal bleeding.\n- Expressed concern about potentially needing to discontinue estrogen due to postmenopausal bleeding.\n\nPostmenopausal Bleeding:\n- Patient reports experiencing postmenopausal bleeding.\n- Has an upcoming appointment with her OB\/GYN to investigate this issue.\n- Has a history of fibroids, with two currently present, one of which is 4 centimeters.\n- Had an ultrasound done in October (exact date not specified) to monitor fibroids.\n\nMedication Review:\n- Patient is on multiple medications including eye drops, bupropion 450mg, clonidine 0.1mg at night, estradiol patch, estradiol vaginal cream, levothyroxine 137mg, modafinil 100mg, progesterone 200mg, topiramate 75mg (down from 300mg), and tirzepatide 3mg per week.\n- Recently stopped taking gabapentin.\n- Uses an insulin pump, but has not been taking insulin due to tirzepatide use. Expects to need insulin again in the near future.\n- Also uses a midi face cream, which she recently ordered a refill for.\n\nSmoking History:\n- Patient has not smoked for at least 35 years.\n\nConcerns:\n- Patient expressed concern about overlapping care from multiple providers, including primary care, OB\/GYN, psychiatrist, endocrinologist, and MIDI.\n- Expressed a desire to maintain a relationship with MIDI, particularly in the event that testosterone becomes an option for her in the future.\n- Expressed concern about potential need for surgery due to fibroids and postmenopausal bleeding.\n- Expressed concern about efficient utilization of healthcare resources due to her appreciation for her health insurance.\n\nPMHx:\n- Diabetes\n- Fibroids\n\nCurrent Meds:\n- Estradiol patch 0.0375 mg twice weekly\n- Progesterone 200 mg nightly\n- Eye drops\n- Bupropion 450 mg\n- Clonidine 0.1 mg at night\n- Estradiol vaginal cream\n- Levothyroxine 137 mcg\n- Modafinil 100 mg\n- Topiramate 75 mg\n- Tirzepatide 3 mg weekly\n- Insulin pump\n- Midi face cream\n\nSocial Hx:\n- Tobacco Use: Quit smoking over 35 years ago","10":"CC:\nPatient is a female presenting for follow-up, accompanied by her daughter.\n\nHPI:\nPatient reports feeling left out and anxious during her daughter's wedding weekend, particularly during a rehearsal event where she was the only family member present. She describes feeling like an outsider and experiencing anxiety, which was noticed by a friend who advised her to breathe and avoid a panic attack. During the wedding, she consumed alcohol, which she believes exacerbated her emotions. She felt jealous and angry when she saw her daughter's mother-in-law dancing with her daughter, leading to a confrontation where she expressed feelings of being disconnected from her daughter. This interaction resulted in her crying in the restroom and later apologizing to her daughter the next morning.\n\nShe expresses regret for her actions at the wedding and wishes she had communicated her feelings to her daughter beforehand. She acknowledges that her emotions were intensified by alcohol and the stress of the event. She feels depressed and emotionally exhausted, stating that she is not happy with her life right now. She reports feeling let down and experiencing heartburn and acid reflux, which she attributes to stress. She has resumed taking medication for acid reflux that she had previously discontinued.\n\nPatient is currently on a 28-day exercise challenge and has set a goal to reach a certain weight by November. She admits to having issues with portion control and feeling guilty about eating, describing it as a \"mind game.\" She is also experiencing constipation, which she attributes to an increased dose of spironolactone. She has been sweating excessively, which she believes is due to an increased dose of estradiol.\n\nShe has upcoming appointments with a cardiologist and a neurologist. She recently had her amitriptyline prescription refilled by her primary care physician, whom she is considering changing. She has been experiencing swelling in her foot and is working on flexibility exercises for her shoulder, which has been acting up again.\n\nPatient has been advised of the pros\/cons and the basics of the technology. The Patient gave their verbal consent to the recording for the purpose of transcribing the visit into the patient’s medical record.","11":"Patient is a 65-year-old male presenting as a new patient for evaluation of an elevated PSA level of 6.52, detected during routine blood work in July 2024. He has no history of prior prostate biopsy and reports only mild baseline voiding symptoms. He was seen in the ER for gross hematuria in April 2024, at which time a CT scan of the abdomen and pelvis revealed prostate enlargement but no other acute abnormalities. He has a history of pre-diabetes, peptic ulcer disease, hypertension, and erectile dysfunction. He denies any current urinary discomfort or intermittent urination. He is currently taking Tamsulosin, which he reports causes him to urinate more frequently, approximately 3-4 times per day. He has no family history of prostate cancer.\n\nLabs & Tests\n- PSA (07\/2024): 6.52 ng\/mL\n\nPOCs\n- Urinalysis (Today): No blood or bacteria\n- Post-Void Residual (Today): 201 mL\n\nImaging\n- CT Abdomen\/Pelvis (04\/2024): Prostate enlargement, no other acute abnormality\n\nPatient was informed that the conversation was recorded for scribing purposes. Patient has given verbal consent.","12":"Patient is a 34-year-old male presenting to the ED with elevated blood pressure and chest discomfort. History was obtained from the patient using a Spanish interpreter. \n\nPatient reports that at approximately 0000, he experienced a sudden increase in blood pressure, which disrupted his sleep. He describes a sensation of chest agitation, which he attributes to the elevated blood pressure. He denies experiencing any chest pain and has not felt similar symptoms recently or in the past. \n\nHe denies any significant medical history or previous surgeries. He consumes beer but denies smoking cigarettes or using illicit drugs such as methamphetamine, cocaine, or heroin. He also denies any significant family history of cardiac or pulmonary issues.","13":"Patient is a 79-year-old female with a history of osteoporosis, presenting for evaluation of right hip pain following a fall, chronic jaw drainage, and worsening throat burning.\n\nRight Hip Pain:\n- Acute onset of right hip pain following a fall 2-3 days ago.\n- Unable to bear weight on the right foot.\n- Denies known fracture; believes it may be bruised.\n- Chronic pain in the right hip and back, exacerbated by the fall.\n- Denies recent epidural injections for back pain due to difficulty leaving the house.\n- Reports dizziness when looking up, requiring support to prevent falls.\n- History of compression fractures in the spine.\n\nChronic Jaw Drainage:\n- Persistent drainage from the jaw, described as thick yellow pus.\n- Denies increase in size of the lesion.\n- Reports pressure and itching at the site.\n- Seen by a surgeon who mentioned it could be a cyst or abscess; no definitive diagnosis given.\n- Denies receiving follow-up instructions or referrals from the hospital.\n\nThroat Burning:\n- Worsening burning sensation in the throat, particularly when swallowing and eating.\n- Associated with nausea and stomach pain.\n- Taking pantoprazole daily with no relief.\n- Denies heartburn or black stools.\n- Taking Percocet 3-4 times daily for pain management.\n\nOsteoporosis:\n- Taking Fosamax once weekly.\n\nRestless Legs Syndrome:\n- Worsening symptoms over the past week.\n- Managed with gabapentin.\n\nAortic Aneurysm:\n- Recent testing in June showed no increase in size.","14":"Patient is a 69-year-old female presenting for a new patient evaluation of microhematuria. Patient's daughter is present and providing history on behalf of the patient. Patient's urinalysis today shows moderate blood with no evidence of bacterial growth. Patient has not observed any visible blood in the urine or clots, with the presence of blood only being detected in laboratory tests. The initial occurrence of blood in the urine was noted during a lab test in Iran. Patient denies any family history of cancer and has never smoked. \n\nPatient has a history of four pregnancies, with one vaginal delivery and three C-sections. She reports a sensation of tissue protruding from the vagina, particularly when standing for extended periods, accompanied by pelvic pain and pressure. Patient denies any urinary symptoms or bother. \n\nPatient went through menopause at age 48 and underwent a hysterectomy 12 years ago due to excessive bleeding. No abnormalities were found in the uterus at the time of removal. Patient was on oral hormone treatments post-menopause but discontinued them due to concerns about cancer risk. Patient denies any family history of kidney stones.\n\nLabs & Tests\n- Urinalysis (Today): Moderate blood with no evidence of bacterial growth.\n\nPatient was informed that the conversation was recorded for scribing purposes. Patient has given verbal consent."},"Clinical feedback":{"0":"Physician precharting about a visit to the ER was omitted","1":"I am a little confused here. We spent a long time on his shortness of breath and fatigue and this is not noted whatsoever in the HPI","2":"Missing details in the HPI about his lower leg pain, what makes it worse when it comes, when it does not, etc.","3":"A1c belongs in the A\/P, this is not subjective information","4":null,"5":null,"6":null,"7":null,"8":"I asked about red flag symptoms like chest pain and this was not captured.","9":null,"10":"The HPI is completely confused, the daughter was discussed but she is not present for the visit","11":"The system missed important information about tamsulosin","12":"Omitted Spanish interpreter number.","13":"why no mention of inhalers in the HPI? Clearly we talked about it for more than","14":"omitted crucial information"}}